{
    "id": 2,
    "hexagram_code": "䷁",
    "name": "Receptivity",
    "description": "The power of open acceptance and responsive capacity. Like fertile earth receiving seeds, this represents the creative potential of yielding awareness.",
    "king_wen": {
        "sequence": 2,
        "traditional_title": "K'un",
        "common_title": "The Receptive"
    },
    "binary_sequence": 0,
    "trigrams": {
        "above": {
            "Trigram Number": 2,
            "Binary Decimal": 0,
            "Symbol": "☷",
            "Chinese Symbol": "坤",
            "Phonetic": "Kūn",
            "English Translation": "Earth",
            "English Symbol": "地",
            "Meaning": "The Receptive",
            "Quality": "Receptive and Nurturing"
        },
        "below": {
            "Trigram Number": 2,
            "Binary Decimal": 0,
            "Symbol": "☷",
            "Chinese Symbol": "坤",
            "Phonetic": "Kūn",
            "English Translation": "Earth",
            "English Symbol": "地",
            "Meaning": "The Receptive",
            "Quality": "Receptive and Nurturing"
        }
    },
    "attributes": {
        "perspective": "Pure receptivity and sustaining power",
        "nature": "Nurturing",
        "action": "Supporting growth",
        "success_through": "Patient acceptance",
        "challenge": "Maintaining boundaries while remaining open"
    },
    "lines": [
        {
            "position": 6,
            "name": "Supreme Receptivity",
            "meaning": "Representing the ultimate state of yielding and depth, the sixth line is the culmination of an ongoing process. It epitomizes complete openness and the power that arises from maximum receptivity.",
            "changing": "At this stage, the perfected state of passive understanding has the latent ability to transform into a potent active force, marking the full cycle of dynamic evolution."
        },
        {
            "position": 5,
            "name": "Harmonious Maturity",
            "meaning": "The fifth line is the pinnacle of balanced receptivity, where mature understanding blends with an intuitive readiness to act. It signifies a harmonious integration of inner wisdom with the demands of the outer world.",
            "changing": "A moment of clarity transmutes calm acceptance into decisive, creative energy, bridging the gap between quiet insight and active influence."
        },
        {
            "position": 4,
            "name": "Delicate Surrender",
            "meaning": "This line reflects the art of yielding with dignity under pressure. The receptive spirit adapts by releasing rigidity, allowing wisdom to emerge through flexibility.",
            "changing": "In times of change, a measured shift can convert passive surrender into a proactive alignment with transformative forces."
        },
        {
            "position": 3,
            "name": "Hesitant Bloom",
            "meaning": "Here, the energy of receptivity meets the challenge of self-doubt. Moments of uncertainty hint that potential is present but requires trust and courage to fully awaken.",
            "changing": "A tentative concession of energy invites the possibility for a gentle surge of yang, transforming hesitation into confident action."
        },
        {
            "position": 2,
            "name": "Embracing Foundation",
            "meaning": "This line embodies nurturing energy and steadfast support. It acts as a stabilizing force, providing the fertile ground in which seeds of potential may develop.",
            "changing": "When the receptive earth aligns with a rising drive, it can shift into a dynamic force that actively nurtures transformation."
        },
        {
            "position": 1,
            "name": "Quiet Genesis",
            "meaning": "The first line represents the humble beginning of receptivity, where stillness paves the way for unseen potential. It invites introspection and calm, creating space for growth.",
            "changing": "A subtle spark of inner light can emerge from this quiet foundation, hinting at a future transformation toward active expression."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents pure receptivity, with both trigrams being Kun/Earth. This creates complete openness to receiving and nurturing energy.",
        "limitation": "Structure is provided by earth above and below, indicating that receptivity must maintain form. The doubled earth suggests containment through natural boundaries.",
        "contribution": "This pattern contributes to evolution by providing the space for growth. It shows how receptivity enables manifestation.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents pure potential. It demonstrates how consciousness creates space for emergence."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on maintaining receptive capacity. Success comes through steady support rather than initiative.",
        "all_moving_lines": "A complete transformation in how receptivity functions is indicated. Old patterns of acceptance must give way to new forms of support. Ensure nurturing remains while embracing change."
    },
    "hierarchy": {
        "order8child": "Pure receptive force",
        "order8parent": "PRIMAL DEFINITION; Creation of Basic Forms"
    },
    "image": {
        "description": "The image representing the hexagram \"Receptivity\" is a landscape that embodies the essence of open acceptance and nurturing awareness. The soft, rolling hills reflect universal patterns of growth and harmonious balance, illustrating the dynamic relationships between earth and sky. The layering of elements emphasizes a triadic interaction where the ground supports, the horizon defines, and the sky integrates order and emergence through its weightless expanse. The tonal gradations between light and shadow capture the equilibrium between chaos and structure, allowing new forms to emerge gently, much like the creative potential symbolized in the hexagram. This composition uses landscape as a medium to depict the nurturing aspect of receptivity, showing how sustaining power is woven through natural harmony and patient support.",
        "file": "02.png"
    },
    "energy_cycle": "ascending",
    "stories": {
        "title": "Three Tales of \"Receptivity\"",
        "entries": [
            {
                "title": "The Art of Silence (Man vs. Man)",
                "theme": "Haruki Murakami",
                "short_story": "In a bustling city, Alexis found solace in the silence of his own thoughts. Despite being surrounded by noise, he cherished moments of solitude where inspiration whispered through the chaos. Alexis sat in his small studio, staring at a blank canvas, feeling the first stirrings of creation. His mind brimmed with raw potential, yet direction eluded him. As days passed, he slowly began to paint, the strokes forming and the colors blending, but barriers loomed. The world outside crept in, shattering his silence with demands, and doubt clawed at his resolve. He met with friends who questioned his dedication, sparking a battle between creation and external pressures. Yet, Alexis persevered, refining his vision, aligning his art with reality. Momentum grew, and his creation took shape, resounding with a harmony of colors and a balance of light. As Alexis stood before his finished piece, he felt mastery over his creation, yet a whisper cautioned against arrogance. Finally, he knew it was time to release it to the world where it would transcend, no longer his alone, but part of something greater. In silence, Alexis found his voice.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "The completion of Alexis's artwork, symbolizing its release into the world beyond his control.",
                        "changing": "If Yang changes to Yin, it indicates reluctance to let go of his creation, stifling its potential impact."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Alexis achieves full command over his creative process and the artwork itself.",
                        "changing": "If Yang changes to Yin, it suggests arrogance or misjudgment threatening his accomplishment."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "The artwork reflects Alexis's refined vision, aligning with the reality and gaining momentum.",
                        "changing": "If Yin changes to Yang, it indicates overreaching ambition, leading to unsteady expansion."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "External challenges threaten Alexis's creative progress, testing his resolve.",
                        "changing": "If Yang changes to Yin, it marks a retreat from challenges, weakening the creative pursuit."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Alexis shapes his potential and confronts initial barriers that define his artistic path.",
                        "changing": "If Yin changes to Yang, it signifies premature action, causing instability in his progression."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "The first stirrings of creation within Alexis, filled with potential but lacking direction.",
                        "changing": "If Yang changes to Yin, it suggests hesitation delaying the creative impulse."
                    }
                }
            },
            {
                "title": "The Sculptor and the Mountain (Man vs. Nature)",
                "theme": "Gabriel García Márquez",
                "short_story": "In a forgotten village nestled between enigmatic mountains, the sculptor Florentino discovered an immense rock. It loomed like an uncharted world, pregnant with possibility, yet silent and immovable. Each morning, he awoke with the vision of a statue hidden within, urging him to uncover its form. Despite the work's enormity, Florentino's chisel remained hesitant, unsure of where to begin amidst the stone's expanse.\n\nAt last, under the relentless sun, he raised his chisel with a newfound resolve, framing the outlines of an image in his mind. The rock began to yield, carving a path through the resistance with rhythmic blows. His hands bled with effort, yet the stone resisted, casting doubts like shadows upon his ambition.\n\nUndeterred, Florentino poured his soul into each stroke, transforming the rock's stubbornness into an ally. The villagers watched in awe as fragments of stone gave way to his tenacity, revealing the contours of a magnificent figure within.\n\nSoon, his creation stood resplendent, touched by the moonglow that bathed it in ethereal majesty. Florentino stepped back, feeling a breath of relief as the statue now possessed a life of its own, a testament to his ceaseless journey between potential and mastery.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "Florentino's creation stands completed, embodying a life beyond his hand that influences and captivates.",
                        "changing": "If Yang changes to Yin, it reflects Florentino's reluctance to release his creation, trapping its potential within limits."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Florentino achieves full command over his craft, reaching the pinnacle of his creative prowess.",
                        "changing": "If Yang changes to Yin, it suggests overconfidence or failure to recognize the completion of the process."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "The sculpture takes shape, aligning Florentino's vision with reality and gaining form.",
                        "changing": "If Yin changes to Yang, it may indicate a rush of ambition, resulting in imbalance or an incomplete form."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Faced with the rock's stubbornness, Florentino battles inner uncertainties that challenge his progress.",
                        "changing": "If Yang changes to Yin, it signifies withdrawal from the challenge, halting creative progress."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Florentino begins to shape his vision, encountering the first obstacles that guide his path.",
                        "changing": "If Yin changes to Yang, it implies hasty action, leading to disarray and misalignment."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "Florentino is filled with unshaped potential, standing before the rock with an untapped vision.",
                        "changing": "If Yang changes to Yin, it suggests hesitation or inefficacy, delaying the initial burst of creation."
                    }
                }
            },
            {
                "title": "The Unwritten Symphony (Man vs. Self)",
                "theme": "Virginia Woolf",
                "short_story": "Evelyn sat at her piano, fingers hovering over keys that promised a symphony yet to be born. Her mind swirled with melodies, unformed like the morning mist. The silence around her was both a cradle and a shackle, offering a space where potential brewed. Yet, with each attempt, the notes fell flat, interrupted by doubts that danced like shadows across her thoughts. \n\nLine by line, Evelyn began to sculpt the symphony. Her notes started to take shape amidst barriers of uncertainty. As she clarified her vision, the melody grew bolder, aligning itself with the pulse of her desire. But conflict rippled through her resolve; voices of cynicism questioned her endeavor, challenging every chord she planted, every harmony she nurtured. \n\nWith perseverance and growing confidence, she wrested the music from chaos, each note cementing her vision into reality. The symphony began to reflect her heart's clarity, her fingers moving with newfound mastery. As the final chord resonated, it transcended her ownership, becoming a narrative on its own—a gift to the listener, in the air, free of its creator, to touch and transform the world.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "The symphony is complete, existing independently of Evelyn, capable of touching others.",
                        "changing": "If Yang changes to Yin, it reflects Evelyn's struggle to release control, anchoring her in fear."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Evelyn fully commands her creation, the music resonates with the clarity of her vision.",
                        "changing": "If Yang changes to Yin, she risks losing perspective, as arrogance undermines her harmony."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "The symphony aligns with Evelyn's vision, solidifying into an expressive and coherent form.",
                        "changing": "If Yin changes to Yang, ambition may overtake realism, leading to chaos."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Evelyn faces doubt and external skepticism threatening to derail her process.",
                        "changing": "If Yang changes to Yin, it marks a retreat, stalling the music’s evolution."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Evelyn begins to organize the melodies, constructing a pathway towards her creative goal.",
                        "changing": "If Yin changes to Yang, premature rush causes disarray and the pattern breaks."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "The initial spark within Evelyn promises creation, yet it is unshaped and undirected.",
                        "changing": "If Yang changes to Yin, hesitation halts the inspirational genesis."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "Darwin's Silent Revolution",
        "subtitle": "\"Receptivity\" in History",
        "short_story": "In 1858, Charles Darwin received a manuscript from Alfred Russel Wallace that outlined the exact theory of evolution by natural selection that Darwin had been developing for twenty years. Rather than defending his priority or dismissing Wallace's insights, Darwin demonstrated remarkable receptivity. He arranged for both their papers to be presented jointly to the Linnean Society, giving Wallace full credit as co-discoverer. Darwin's receptive approach extended to his scientific method. Unlike his contemporaries who imposed theories on nature, Darwin spent decades simply observing and collecting data. His notebooks show a mind open to evidence that often contradicted his initial assumptions. He let his theory emerge from observations rather than forcing facts to fit preconceptions. This receptive approach proved crucial to his insights. By remaining open to nature's patterns rather than imposing his own, he was able to perceive the subtle workings of natural selection that others had missed. His willingness to consider every piece of evidence, even those that challenged his ideas, led to a more robust theory.",
        "source": [
            "\"Darwin: The Life of a Tormented Evolutionist\" by Adrian Desmond",
            "James Moore (1991)",
            "\"Darwin's Century: Evolution",
            "the Men Who Discovered It\" by Loren Eiseley (1958)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Completion and Refinement of Receptivity",
                "meaning": "Closing of the cycle of receptivity, surrendering to change or refining experiences. This stage signifies the completion of the receptive process, leading to renewal and refinement.",
                "changing": "When encountering a changing line, there may be resistance to closure or clinging to power, indicating challenges in gracefully concluding the receptive journey."
            },
            "5": {
                "name": "Manifestation of Harmonious Engagement",
                "meaning": "Full engagement in the external world, demonstrating leadership and the execution of receptive potential. This stage represents the active realization of receptivity in action.",
                "changing": "In the presence of a changing line, there may be indecision or incomplete realization of receptivity, hinting at a need for clarity and authority in external engagement."
            },
            "4": {
                "name": "Emergence of External Alignment",
                "meaning": "Receptive forces align with external factors, preparing for outward action and manifestation. This stage embodies the alignment with external influences to support stability.",
                "changing": "If a moving line emerges, it signifies potential instability or premature assertion in external alignment, requiring a reassessment of readiness for action."
            },
            "3": {
                "name": "Transition to External Receptivity",
                "meaning": "Culmination of internal receptivity, signaling the transition towards external expression and action. This stage marks the completion of the inner transformation.",
                "changing": "When encountering a changing line, there may be hesitation in externalizing receptivity, leading to a delay in fully manifesting openness and adaptability."
            },
            "2": {
                "name": "Formation of Receptivity",
                "meaning": "Receptive forces align to support and structure potential, embodying the essence of adaptability and consolidation. This stage represents the active state of receptivity taking shape.",
                "changing": "With a changing line, there is a potential for premature action or instability in receptivity, prompting a need for realignment and integration."
            },
            "1": {
                "name": "Emergence of Receptivity",
                "meaning": "The initial stage of receptivity unfolding, marking the birth of a transformative force. This stage signifies the emergence of openness and adaptability.",
                "changing": "If a moving line occurs, it indicates a significant shift in receptivity, potentially leading to a deeper level of openness and engagement."
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "The harmonious interplay wherein the nurturing essence of the earth communes with its own being, forging an eternal cycle of receptivity and sustenance.",
        "Platonic": "When the soul becomes attuned to the nurturing essence, it gives birth to profound receptivity, and thus a continuous cycle of openness and mutual support is woven, as if the fabrics of existence dance in harmonious resonance.",
        "Taoist": "The blossoming of nurturing essence emerges in the ceaseless dance of mutual support and boundless openness.",
        "Tholonic": "The fruit of Unblemished Receptivity and Enduring Might emerges from its intrinsic nature, weaving an eternal tapestry of nurturing embrace and harmonious acceptance.",
        "Thermodynamics": "The emergence of profound openness and unwavering support manifests through the equilibrium of complete acceptance and nurturing energy."
    },
    "line_type": [
        "⚋",
        "⚋",
        "⚋",
        "⚋",
        "⚋",
        "⚋"
    ]
}