{
    "id": 14,
    "hexagram_code": "䷍",
    "name": "Radiance",
    "description": "The illuminating power of conscious awareness joined with creative force. Like sunlight filling the sky, this represents the expansive influence of clear understanding combined with powerful action.",
    "king_wen": {
        "sequence": 14,
        "traditional_title": "Ta Yu",
        "common_title": "Great Possessions"
    },
    "binary_sequence": 47,
    "trigrams": {
        "above": {
            "Trigram Number": 7,
            "Binary Decimal": 5,
            "Symbol": "☲",
            "Chinese Symbol": "离",
            "Phonetic": "Lí",
            "English Translation": "Fire",
            "English Symbol": "火",
            "Meaning": "The Clinging",
            "Quality": "Bright and Radiant"
        },
        "below": {
            "Trigram Number": 1,
            "Binary Decimal": 7,
            "Symbol": "☰",
            "Chinese Symbol": "乾",
            "Phonetic": "Qián",
            "English Translation": "Heaven",
            "English Symbol": "天",
            "Meaning": "The Creative",
            "Quality": "Strong and Creative"
        }
    },
    "attributes": {
        "perspective": "Clear awareness guiding powerful action",
        "nature": "Illuminating",
        "action": "Conscious expansion",
        "success_through": "Combining insight with capability",
        "challenge": "Managing abundance without being overwhelmed"
    },
    "lines": [
        {
            "position": 6,
            "name": "Final Glow",
            "meaning": "As the cycle completes, the radiance softens into a reflective afterglow. It advises moderation to prevent brilliance from overwhelming delicate balances.",
            "changing": "The intense, outward brilliance gradually recedes, inviting a return to inward contemplation and signaling a graceful pivot from dynamic expression back to calm introspection."
        },
        {
            "position": 5,
            "name": "Celestial Emanation",
            "meaning": "A stage of full, inspiring radiance unfolds, merging human aspiration with higher energies. This brightness not only dazzles but uplifts and unifies ambitions.",
            "changing": "The expansive glow transforms from a receptive, diffuse light to a concentrated, vibrant force that actively channels inner wisdom outward."
        },
        {
            "position": 4,
            "name": "Radiant Clarity",
            "meaning": "At this juncture, truth and understanding emerge vividly as complications dissolve. It invites you to embrace honest perception and transparent communication.",
            "changing": "The gentle light transforms into an assertive illumination, turning receptive clarity into brilliant action and bold expression."
        },
        {
            "position": 3,
            "name": "Illuminated Path",
            "meaning": "Clear insights begin to break through lingering shadows. This stage calls for following a well-lit course with patience, whereby clarity replaces uncertainty.",
            "changing": "A subdued, reflective glow shifts into a decisive radiance, marking the evolution from introspection to the pursuit of clear, illuminated purpose."
        },
        {
            "position": 2,
            "name": "Warming Glow",
            "meaning": "This line signifies a nurturing energy that gradually permeates your surroundings. It encourages steady progress, as the warmth builds confidence and fosters growth.",
            "changing": "The passive warmth intensifies, transforming into a dynamic, active light that infuses energy and empowers decision-making."
        },
        {
            "position": 1,
            "name": "Subtle Beacon",
            "meaning": "At the outset, a gentle light emerges, hinting at potential and offering quiet guidance. It reminds you to root your aspirations in a modest beginning.",
            "changing": "A hidden spark awakens, shifting from a passive glow to an assertive spark, marking the transition from contemplation to action."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the negotiation between illuminating awareness (Li/Fire) and creative power (Qian/Heaven). This creates a dynamic balance between understanding and action, like consciousness guided by clear purpose.",
        "limitation": "Structure is provided by the fire above, indicating that power must be guided by wisdom. The heaven below suggests that creative force must serve higher understanding.",
        "contribution": "This pattern contributes to evolution by demonstrating how consciousness can guide creative force. It shows how clarity of understanding can direct and amplify power.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents the point where awareness actively shapes reality through clear intention. It demonstrates how consciousness can illuminate and transform through aligned action."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on maintaining the harmony between insight and action. Success comes through balanced application of understanding and power.",
        "all_moving_lines": "A complete transformation in how wisdom and power are expressed is indicated. Old forms of influence must give way to new understanding. Ensure that clarity guides force while embracing change."
    },
    "hierarchy": {
        "order8child": "Gathering resources",
        "order8parent": "EARLY DEVELOPMENT; Building Structure"
    },
    "image": {
        "description": "The chosen image for the hexagram \"Radiance\" exemplifies universal patterns of illumination and creative force through its golden light and intricate, swirling forms. This visual metaphor captures the dynamic relationship between clarity and power, echoing the interplay of understanding with creative action. The image's triadic composition includes a central light source, the emanating patterns, and the encompassing space, symbolizing the emergent order arising from conscious awareness guiding action. The balance between structure and chaos is evident in the harmonious blending of fluid forms with discernible boundaries, highlighting the essence of dynamic equilibrium. This medium and style together convey the transcendent potential of consciousness to illuminate, transform, and harmonize the elements of existence, mirroring the hexagram's core message.",
        "file": "14.png"
    },
    "energy_cycle": "descending",
    "stories": {
        "title": "Three Tales of \"Radiance\"",
        "entries": [
            {
                "title": "The Artisan's Confluence (Man vs. Man)",
                "theme": "Haruki Murakami",
                "short_story": "In a bustling seaside town, Aiko was known for her handcrafted lanterns, rumored to illuminate dreams. One day, consumed by a vision, she crafted a lantern unlike any other, boundless in its glow. Its creation summoned whispers throughout the community, stirring both admiration and envy. As the lantern's fame spread, rival craftsmen plotted to replicate its mystery, seeking to unravel its secrets. Confronted by the clamor of imitation and dissent, Aiko struggled to protect the heart of her vision. Yet, amidst this turmoil, she honed her craftsmanship, refining her lantern until it radiated an untarnished brilliance, overshadowing dissent. At last, the lantern transcended its material form, leaving an ethereal imprint upon the town, its light inspiring unity and warmth. Aiko realized her creation thrived not in containment, but in liberating its glow to touch every life around her.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence of Radiance",
                        "meaning": "The lantern is complete, transcending Aiko's personal touch to affect the community at large, symbolizing the elevation of her creativity beyond individual constraints.",
                        "changing": "If the lantern's influence is held too tightly, Aiko risks preventing its growth, clinging to control when it should be released."
                    },
                    "5": {
                        "name": "Mastery of Craft",
                        "meaning": "Aiko stands at the peak of her artistic prowess, commanding her vision with clarity and authority. The creation reaches its zenith.",
                        "changing": "If Aiko becomes overconfident, she may risk misjudgments that threaten her success."
                    },
                    "4": {
                        "name": "Manifestation of Vision",
                        "meaning": "Aiko refines her lantern, aligning her dream with reality as she navigates external challenges and deepens her resolve.",
                        "changing": "Overreaching in her ambition, she risks unsustainable expansion, threatening the integrity of her craft."
                    },
                    "3": {
                        "name": "Confrontation with Imitation",
                        "meaning": "Aiko faces direct opposition from rivals wishing to replicate her work, testing her commitment to her unique path.",
                        "changing": "Retreating due to exhaustion or external pressures may leave her brilliance unrealized."
                    },
                    "2": {
                        "name": "Shaping the Light",
                        "meaning": "The potential of Aiko's raw vision begins to take form as she carefully shapes her lantern, encountering initial barriers.",
                        "changing": "Missteps or rushed actions could lead to misalignment with her true intent."
                    },
                    "1": {
                        "name": "Emergence of Creative Vision",
                        "meaning": "Aiko starts with boundless creative energy, filled with potential yet in need of direction to shape her unique vision.",
                        "changing": "Hesitation or failure to act upon her inspiration could delay the unfolding of her creative journey."
                    }
                }
            },
            {
                "title": "The Radiance Within the Storm (Man vs. Nature)",
                "theme": "Gabriel García Márquez",
                "short_story": "In the village of San Andaluz, a powerful storm brewed on the horizon, threatening to swallow the fledgling crops and dreams of its people. At the heart of the village, young Alejandra, touched by an unquenchable spark of creativity, saw in the tempest a dance of infinite potential rather than a force to fear. Her mind ablaze with inspiration, she began crafting luminous kites designed to capture the storm’s energy. As the gales intensified, skeptics doubted her vision, yet Alejandra persevered, shaping her dreams against the stark ferocity of nature. But her path was fraught with challenges—the first kites tore asunder amid the howling winds, nearly quenching her spirit. Yet determination fueled Alejandra, and through intuitive adjustments, her kites took form, ascending to the angry skies, harnessing the storm’s fury into radiant displays of light. In time, Alejandra’s creation became more than mere spectacle; it empowered the village, dispelling darkness with newly harnessed energy, linking each home with vibrant connections of brilliance. By releasing the true potential of her vision, Alejandra transcended her creation, leaving an indelible glow upon her world.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence of Creation",
                        "meaning": "Alejandra's creation surpasses its origin, forging a lasting impact on the village as it becomes a symbol of hope and empowerment.",
                        "changing": "If the transcendence is hindered, the creation may remain constrained by its initial intent, missing its broader potential."
                    },
                    "5": {
                        "name": "Mastery Over Elements",
                        "meaning": "Alejandra reaches her zenith, demonstrating unparalleled mastery in capturing and transforming the storm’s energy.",
                        "changing": "If mastery is marred by arrogance, Alejandra risks losing control over her kites, leading to possible failure."
                    },
                    "4": {
                        "name": "Manifestation of Innovation",
                        "meaning": "Alejandra’s kites take flight, bridging her vision with the fury of the storm, and realizing her creative design.",
                        "changing": "Overreaching ambition could lead to instability, threatening the structural integrity of her innovation."
                    },
                    "3": {
                        "name": "Struggle with Adversity",
                        "meaning": "Confronted with the storm's wrath, Alejandra faces skepticism and the tangible threat of failure.",
                        "changing": "A retreat in this phase might leave her inventions unrealized, succumbing to external pressures."
                    },
                    "2": {
                        "name": "Crafting the Vision",
                        "meaning": "This stage sees Alejandra diligently working to shape her kites, refining her approach amidst obstacles.",
                        "changing": "Premature actions might lead to incomplete designs, impairing the alignment of her vision."
                    },
                    "1": {
                        "name": "Emergence of the Idea",
                        "meaning": "The storm awakens creative potential within Alejandra, propelling her to imagine possibilities previously unseen.",
                        "changing": "Hesitation might stall her initial burst of creativity, halting the realization of her potential."
                    }
                }
            },
            {
                "title": "The Artisan's Awakening (Man vs. Self)",
                "theme": "Hermann Hesse",
                "short_story": "In the secluded town of Vitra, Elias, an aspiring painter, felt the stirring of untapped potential within his soul. Obsessed with capturing the essence of light on canvas, he embarked on an inward journey, consumed by a vision of unbridled creativity. In his studio, amidst scattered palettes and brushes, Elias hesitated, fearing that his longing for perfection would paralyze his art. Yet gradually, he began weaving the first strokes, wrestling with the turmoil of doubt and external criticism that threatened to overshadow his quest. As each color found its rhythm, his internal battles transformed into vibrant manifestations of his truth. Through tireless dedication, Elias reached the pinnacle of his craft, blending harmony with chaos in transcendental pieces that captivated and inspired others. When he finally released his creations to the world, his art no longer belonged solely to him but to anyone who beheld it, leaving a luminous trace across the collective consciousness of his town.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "Elias's paintings transcend personal expression, becoming a shared legacy that affects those who witness them.",
                        "changing": "Clinging to his creations instead of releasing them might prevent their broader impact."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Elias achieves mastery over his artistic vision, standing at the height of his creative talent.",
                        "changing": "If Elias becomes overconfident, he may overlook crucial details that compromise the integrity of his work."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "Elias aligns his vision with external reality, deftly translating inner light into powerful artistic expressions.",
                        "changing": "Pushing too far may lead to overextension, destabilizing the cohesion of his vision."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Elias confronts external criticism and his inner doubts, testing his dedication to his artistic path.",
                        "changing": "Retreating due to criticism may suppress the full emergence of his creative potential."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Elias begins to shape his raw potential, carefully navigating the constraints of his medium and technique.",
                        "changing": "Acting without careful consideration may lead to instability in his emerging style."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "Elias feels the first stirrings of creative energy, filled with potential but needing focus and direction.",
                        "changing": "If hesitation prevails, Elias may delay the initiation of his creative journey."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "The House of Wisdom: Baghdad's Radiant Center",
        "subtitle": "\"Radiance\" in History",
        "short_story": "In 832 CE, at the height of the Islamic Golden Age, Caliph Al-Ma'mun expanded Baghdad's House of Wisdom (Bayt al-Hikma) into what would become humanity's greatest center of learning. While other rulers focused on military conquest, Al-Ma'mun understood that true power came from the radiance of knowledge combined with the resources to pursue it.\n\nThe House of Wisdom represented an unprecedented combination of intellectual clarity and material support. Al-Ma'mun sent emissaries across the known world to collect books in all languages and fields of study. He paid translators the weight of their books in gold, establishing history's first systematic program of scholarly translation. But his genius lay not just in gathering knowledge but in creating an environment where it could flourish and spread.\n\nScholars of all faiths and backgrounds worked together in the House of Wisdom, producing groundbreaking work in mathematics, astronomy, medicine, and philosophy. The mathematician Al-Khwarizmi developed algebra there, while the polymath Al-Kindi pioneered new methods in cryptography, medicine, and music theory. The institution became known not just for preserving ancient knowledge but for generating new insights that would influence human thought for centuries.\n\nWhat made the House of Wisdom extraordinary was how it combined material abundance with intellectual brilliance. Al-Ma'mun provided scholars with everything they needed - books, instruments, stipends - while fostering an atmosphere of free inquiry and debate. This union of resources and wisdom created a radiance that illuminated not just the Islamic world but all of human civilization, preserving and advancing knowledge through Europe's Dark Ages.",
        "source": [
            "The House of Wisdom: How Arabic Science Saved Ancient Knowledge",
            "Gave Us the Renaissance by Jim Al-Khalili (2011); The House of Wisdom: How the Arabs Transformed Western Civilization by Jonathan Lyons (2009)"
        ],
        "lines_in_history": {
            "1": {
                "name": "Emergence of Radiance",
                "meaning": "The initial stage marked by the birth of the House of Wisdom, embodying the potential for radiance and knowledge to blossom.",
                "changing": "If a changing line, the emergence of radiance may face hesitance, weakness, or unreadiness."
            },
            "2": {
                "name": "Harmony in Diversity",
                "meaning": "The stage of harmonious alignment and structuring of knowledge from diverse sources within the House of Wisdom.",
                "changing": "If a changing line, premature action or struggle to integrate knowledge may disrupt the harmony."
            },
            "3": {
                "name": "Illumination of Insight",
                "meaning": "The culmination within the House of Wisdom, transitioning knowledge into external actions and profound realizations.",
                "changing": "If a changing line, hesitation in sharing insights outwardly or stagnation in the transition of wisdom may occur."
            },
            "4": {
                "name": "Expansion of Influence",
                "meaning": "The emergence of the House of Wisdom's influence in the external world, aligning with forces beyond its walls.",
                "changing": "If a changing line, premature assertion externally or instability in influence may challenge the expansion."
            },
            "5": {
                "name": "Radiant Brilliance",
                "meaning": "The full engagement and leadership of the House of Wisdom, illuminating the world with knowledge and advancements.",
                "changing": "If a changing line, indecision, loss of authority, or incomplete realization of the vision may dim the brilliance."
            },
            "6": {
                "name": "Integration of Legacy",
                "meaning": "The completion and refinement of the House of Wisdom's cycle, surrendering to change for the next phase of evolution.",
                "changing": "If a changing line, resistance to closure, clinging to power, or forced extension beyond completion may hinder the integration."
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "Within the depths of the collective unconscious, a profound synergy emerges as the dynamic force of creativity reveals itself through the luminous brilliance of radiant clarity.",
        "Platonic": "Behold the harmonious dance of potent creativity, revealing itself as a radiant light.",
        "Taoist": "When the mighty energies of creation merge, they blossom into a radiant and lucid understanding.",
        "Tholonic": "When the harmonious forces of Might and Imagination entwine, they give life to a resplendent Luminescence.",
        "Thermodynamics": "The entropic confluence of Force and Ingeniousness materializes as Radiant Energy."
    },
    "line_type": [
        "⚊",
        "⚋",
        "⚊",
        "⚊",
        "⚊",
        "⚊"
    ]
}