{
    "id": 36,
    "hexagram_code": "䷣",
    "name": "Obscured Light",
    "description": "Intelligence and clarity operating under constraints. Like the sun below the earth, this represents inner radiance maintaining its strength despite external darkness.",
    "king_wen": {
        "sequence": 36,
        "traditional_title": "Ming I",
        "common_title": "Darkening of the Light"
    },
    "binary_sequence": 5,
    "trigrams": {
        "above": {
            "Trigram Number": 2,
            "Binary Decimal": 0,
            "Symbol": "☷",
            "Chinese Symbol": "坤",
            "Phonetic": "Kūn",
            "English Translation": "Earth",
            "English Symbol": "地",
            "Meaning": "The Receptive",
            "Quality": "Receptive and Nurturing"
        },
        "below": {
            "Trigram Number": 7,
            "Binary Decimal": 5,
            "Symbol": "☲",
            "Chinese Symbol": "离",
            "Phonetic": "Lí",
            "English Translation": "Fire",
            "English Symbol": "火",
            "Meaning": "The Clinging",
            "Quality": "Bright and Radiant"
        }
    },
    "attributes": {
        "perspective": "Wisdom persisting through adversity",
        "nature": "Hidden strength",
        "action": "Preservation",
        "success_through": "Internal cultivation",
        "challenge": "Sustaining clarity amid darkness"
    },
    "lines": [
        {
            "position": 6,
            "name": "Diminished Glow",
            "meaning": "In the final stage, excess radiance can become overwhelming, risking the loss of subtlety and balance if not carefully managed.",
            "changing": "A dynamic equilibrium is required as the lingering yin begins to integrate with a potent yang force, ensuring that transformation remains balanced."
        },
        {
            "position": 5,
            "name": "Luminous Beacon",
            "meaning": "A pivotal juncture where clarity and purpose shine forth, dispelling doubts and guiding the way forward with renewed energy.",
            "changing": "The suppressed yin qualities now erupt into enlightening yang brilliance, marking a transformation that illuminates the path ahead."
        },
        {
            "position": 4,
            "name": "Subtle Radiance",
            "meaning": "The inherent light begins to break through the haze, suggesting that wisdom and innate strength are emerging from humble origins.",
            "changing": "A quiet yin energy gradually shifts into an assertive yang expression when inner truths are acknowledged."
        },
        {
            "position": 3,
            "name": "Veiled Impulse",
            "meaning": "A moment when inner urges are obscured by doubt and uncertainty; caution is advised in acting without clear vision.",
            "changing": "A restrained yin impulse can transform into a confident yang initiative as clarity overcomes hesitation."
        },
        {
            "position": 2,
            "name": "Glimmering Hope",
            "meaning": "An early sign that beneath darkened outward appearances, hope and opportunity are beginning to emerge, waiting to be seized.",
            "changing": "The yielding yin quality slowly unfolds into a decisive yang action, symbolizing the delicate shift from uncertainty to clarity."
        },
        {
            "position": 1,
            "name": "Hidden Spark",
            "meaning": "A subtle starting point where a faint light appears despite prevailing obscurity; the moment of potential that requires careful nurturing.",
            "changing": "A muted yin presence can gradually ignite into a vibrant yang force when recognized and cultivated."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "Balance between expression and preservation. The hexagram shows how wisdom can thrive even when constrained. Represents negotiation between visibility and protection.",
        "limitation": "Creates protection through concealment. The earth above contains and protects the fire below, showing how limitation can preserve rather than extinguish.",
        "contribution": "Contributes by demonstrating how awareness can persist and develop under adverse conditions. Like a seed growing underground, this constraint enables future emergence.",
        "significance_in_thologram": "Represents crucial phases where development must occur hidden from view. Shows how temporary constraint can strengthen rather than weaken a system."
    },
    "transformations": {
        "no_moving_lines": "A period where wisdom must be cultivated internally. Accept this time of restricted expression as necessary for development. Focus on inner growth.",
        "all_moving_lines": "Complete transformation from concealment to expression approaching. The period of constraint has served its purpose. Prepare for emergence while maintaining gained wisdom."
    },
    "hierarchy": {
        "order8child": "Hidden transformation",
        "order8parent": "TRANSFORMATION; Active Change"
    },
    "image": {
        "description": "In this representation of the hexagram \"OBSCURED LIGHT,\" the camouflaged chameleon symbolizes hidden transformation, embodying the principle of negotiation as it balances between visibility and invisibility, mirroring the dynamic of change and adaptation inherent in awareness. Styled in surrealism, this portrayal transcends ordinary perception to reveal deeper layers of reality, akin to the Thologram's recursive exploration of existence. Georgia O'Keeffe, recognized for capturing the essence beyond the apparent, parallels the Tholonic model's emphasis on awareness as fundamental. The choice of gouache enhances the vivid yet nuanced textures, reflecting the interplay of contribution and limitation — highlighting the chameleon’s integration into its environment while maintaining distinctiveness. This composition, as award-winning and highly symbolic, encapsulates the essence of active change, unmasking the subtleties of transformative processes within both the physical and abstract realms.",
        "file": "36.png"
    },
    "energy_cycle": "ascending",
    "stories": {
        "title": "Three Tales of \"Obscured Light\"",
        "entries": [
            {
                "title": "The Sculptor's Obsession (Man vs. Man)",
                "theme": "Gabriel García Márquez",
                "short_story": "In a secluded workshop at the edge of a bustling city, an eccentric sculptor named Aurelio toiled endlessly on his magnum opus: a stone gargoyle intended to capture raw beauty but chisel by chisel eluded his grasp. Driven by an inexplicable urge to shape his masterpiece, he sifted through dust and debris, tirelessly pressing his vision upon an unyielding block of granite. His enthusiasm faced a wall of resistance in the form of naysayers in the village, skeptics convinced that his artistic pursuit led nowhere. Yet, with each stroke upon stone, the rudimentary outline of a creature slowly emerged, often mocking him with its monstrous gaze. As the form took shape and attracted curious onlookers, Aurelio's fervor intensified. He fashioned wings with angles never seen, creating a juxtaposition of elegance and ferocity. Soon, Aurelio knew he had transcended beyond his personal ambition. Passersby paused, marveling at the figure that seemed to hover between worlds, as though ready to take flight constructed aptly, precisely beyond its creator's hand. His obsession borne into light transformed into a tale told long after the sculptor's hands lay still, forever echoed in the murmurs of the town's legend.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "The completed sculpture exists beyond Aurelio, affecting the community and becoming a lasting symbol.",
                        "changing": "Clinging to control prevents the sculpture from gaining significance and influence beyond the artist's personal satisfaction."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Aurelio reaches the height of his craft, crafting the wings in a unique, masterful way.",
                        "changing": "Arrogance or error at this stage may cause flaws that undermine the work's final impact."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "Aurelio refines his vision into the stone, aligning his work with its purpose as onlookers begin to appreciate it.",
                        "changing": "Overreaching ambition leads to a forced expansion, potentially destroying delicate aspects of the sculpture."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Aurelio encounters village skepticism, representing opposition that challenges his artistic mission.",
                        "changing": "Retreat or exhaustion could lead Aurelio to abandon his work before fulfillment."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Aurelio shapes the basic form, initially unsteady as he defines his artistic path against barriers.",
                        "changing": "Premature action results in misalignments with the inherent potential of the stone."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "Aurelio's initial vision of raw, creative potential in the rough stone, yet without defined clarity.",
                        "changing": "Hesitation or doubt delays Aurelio's ability to engage with his craft, stifling creative impulses at inception."
                    }
                }
            },
            {
                "title": "The Phoenix and the Storm (Man vs. Nature)",
                "theme": "Margaret Atwood",
                "short_story": "Amidst a desolate landscape, a lone artist named Liora encounters a bleak, storm-ridden desert. Her heart, filled with the uncontainable urge to create, brims with a fervent intensity that rivals the lightning-streaked sky. Despite the incessant storms, she visualizes an ornate sculpture—a phoenix rising majestically from the sands. Gathering fragments of colorful glass scattered by past winds, she begins to piece them together. At first, Liora wrestles with the storm's relentless gales, her hands steady but her resolve wavering as each new attempt seems futile. The storm appears an insurmountable adversary, tearing at her work, testing her perseverance. Bitter winds bite, but she learns to harness the storm's rhythm, weaving its energy into her art. As sun breaks through the torrential gloom, she stands her ground, adaptively aligning with both storm and sun, her sculpture shimmering with iridescence. Thus, the phoenix takes flight, transcending its origins, no longer her own but a beacon of resilience for all who witness it, whispering tales of determination in the face of nature's fury.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "The phoenix sculpture, complete and unbound, now impacts others beyond Liora's initial vision.",
                        "changing": "Holding onto control restricts the sculpture's ability to inspire others, keeping it tethered to the creator's personal domain."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Liora achieves mastery over her art, fully realizing her vision despite external chaos.",
                        "changing": "Mistakes born from arrogance or miscalculation can unravel the established harmony, diminishing the creation's effect."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "Liora aligns her creation with natural elements, finding balance in the storm's chaos.",
                        "changing": "Overextension risks destabilizing the fragile balance achieved, threatening to consume her progress."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Liora faces the storm's fury, challenging her ability to shape and progress.",
                        "changing": "Fatigue or retreat could cause her to abandon her creation prematurely, foreclosing its potential."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Assembling fragments with care, Liora shapes her initial vision into tangible form.",
                        "changing": "Rushing the process leads to instability, disrupting the organic unfolding of her artistic journey."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "The first spark of Liora's vision emerges within her, filled with boundless potential.",
                        "changing": "Failing to act on her initial impulse would delay or stifle her creative aspiration."
                    }
                }
            },
            {
                "title": "The Silent Symphony (Man vs. Self)",
                "theme": "Virginia Woolf",
                "short_story": "Evelyn sat alone in the attic, surrounded by endless silence, the symphony of ideas whispering just beyond the edge of perception. Her heart resonated with an unformed melody, a raw rhythm of emotions straining for expression. Yet each time she reached for her violin, doubt clouded the notes, and her fingers hesitated over the strings. Resting the instrument in her lap, Evelyn breathed the crisp air of potentiality and let the inspiration form naturally around her.\n\nDetermined, she began to sketch the first draft of her composition, embracing the stumbling awkwardness as part of the process. The music unfolded hesitantly, every pause a battle against self-imposed barriers that hindered her flow. But gradually, her vision clarified, and notes danced like stars across the page, forming constellations of harmony.\n\nEvelyn confronted internal conflicts, the fear of inadequacy skirmishing with her growing confidence. However, with each resolved chord, a newfound strength illuminated her endeavor, illuminating her resolve. Her vision gained substance, echoing through the attic’s stillness as she harmonized her creation with her heart's profound yearning.\n\nAs the weeks unfolded, Evelyn honed her mastery until the symphony exhaled, transcending her individual struggle. The music, now a living entity, flowed through her, evoking a vivid tapestry of resonant emotions cascading freely into the world.",
                "lines_in_context": {
                    "6": {
                        "name": "Release",
                        "meaning": "Evelyn's composition is complete and resonates beyond her personal experience, affecting all who hear it.",
                        "changing": "Struggling to let go of control, Evelyn risks confining her music to personal meaning, hindering its universal resonance."
                    },
                    "5": {
                        "name": "Artistic Pinnacle",
                        "meaning": "Evelyn reaches the height of her artistic endeavor, fully embracing the synergy of her inner music and outward expression.",
                        "changing": "Allowing pride to overshadow her work's essence could lead to imperfections that distort its harmonious impact."
                    },
                    "4": {
                        "name": "Resonance",
                        "meaning": "Evelyn aligns her musical expression with her inner vision, achieving an inspiring momentum.",
                        "changing": "Overextending her ambitions could disrupt the delicate harmony, causing her music to lose its intimate touch."
                    },
                    "3": {
                        "name": "Inner Struggle",
                        "meaning": "Evelyn contends with self-doubt, which challenges the authenticity and progress of her creation.",
                        "changing": "Her music could prematurely end if exhaustion overtakes her perseverance, leaving its potential unrealized."
                    },
                    "2": {
                        "name": "Drafting",
                        "meaning": "Evelyn begins structuring her ideas, encountering initial obstacles, and defining her musical path.",
                        "changing": "Rushing into the creative process might lead to instability, misaligning her vision with natural harmony."
                    },
                    "1": {
                        "name": "Inspiration",
                        "meaning": "The first sparks of Evelyn's musical ambition arise, filled with raw potential yet lacking form.",
                        "changing": "Hesitation to act on her inspiration may delay the manifestation of her creative impulse."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "The Underground Railroad",
        "subtitle": "\"Obscured Light\" in History",
        "short_story": "Between 1810 and 1850, the Underground Railroad represented one of history's most powerful examples of light persisting through darkness. Harriet Tubman, known as \"Moses\" to those she helped free, conducted 19 secret missions along this clandestine network of safe houses and hidden routes. Operating under the constant threat of capture, she and other conductors developed intricate systems of codes and signals. Quilts hung on clotheslines contained map symbols, lanterns in windows indicated safe houses, and spirituals contained hidden messages about escape routes. In total, the Underground Railroad helped an estimated 100,000 enslaved people reach freedom, all while maintaining strict secrecy. The entire operation functioned like a flame burning beneath the earth - invisible to those above but providing crucial light to those who needed to find their way to freedom.",
        "source": [
            "\"Bound for Canaan: The Underground Railroad",
            "the War for the Soul of America\" by Fergus Bordewich (2005)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Reflection on Sacrifice",
                "meaning": "Contemplating the completion of a transformative journey and the sacrifices made. This line embodies the closure of a cycle, reflecting on the sacrifices and changes necessary for growth and completion. If changing to its opposite state, the reflection on sacrifice may turn into resistance or reluctance to let go, hindering the process of renewal and the transition to a new cycle of light and liberation.",
                "changing": "When this line shifts, the reflection on sacrifice and the closure of a cycle may face resistance or attachment, challenging the surrender to transformation and hindering the ability to embrace the renewal of light and liberation that follows the completion of a transformative journey."
            },
            "5": {
                "name": "Radiant Leadership",
                "meaning": "Exemplifying the full expression of guiding light and leadership. This line signifies the embodiment of radiant guidance and decisive actions, illuminating the path with clarity and authority. If transitioning to its opposite state, the radiant leadership may falter, casting shadows of doubt and uncertainty, potentially dimming the light that guides others to freedom.",
                "changing": "When this line transforms, the radiant leadership and authority in guiding others may face challenges, leading to moments of hesitation and loss of clarity, potentially dimming the beacon that lights the way for those seeking freedom from darkness."
            },
            "4": {
                "name": "Adaptation to Shadows",
                "meaning": "Embracing the challenge of manifesting light in the external world. This line represents the integration of light within the shadows, navigating the complexities of operating in secrecy and under constant threat. When changing to its opposite, the adaptation to shadows may waver, leading to exposure or vulnerability, jeopardizing the safety and efficacy of guiding others towards light in the darkness.",
                "changing": "A changing line here suggests a shift in adapting to shadows, where the balance between concealment and exposure may be disrupted, impacting the ability to operate covertly and protect both the light and those seeking it in the depths of darkness."
            },
            "3": {
                "name": "Culmination of Resilience",
                "meaning": "Reaching the pinnacle of inner strength and transition towards external action. This line symbolizes the completion of inner fortitude and the readiness to manifest light outwardly. If transitioning to its opposite state, the culmination of resilience may face obstacles, delaying the transformation of inner strength into visible actions, hindering the ability to shine brightly in the face of adversity.",
                "changing": "As this line transitions, the culmination of inner resilience may encounter hurdles, testing the ability to extend that resilience outwardly, affecting the readiness to shine light into the darkness with full strength."
            },
            "2": {
                "name": "Harmonious Alignment",
                "meaning": "Establishing connections and structures to support the emerging light. This line embodies the formation of supportive networks and strategies that enhance the spreading of light and hope. When shifting to its opposite state, the alignment may falter, leading to disruptions in the flow of support and guidance, hindering the progression towards illumination.",
                "changing": "When this line changes, the harmonious alignment of sources of support and guidance may face challenges, impacting the stability of the network and the effectiveness of conveying light in the midst of darkness."
            },
            "1": {
                "name": "Emergence of Light",
                "meaning": "The initial spark of hope and illumination emerges in the darkness. This line represents the birth of potential light, signaling a transformative force ready to shine. When transitioning to its opposite state, the emergence of light may be obscured or delayed, hindering progress and clarity in the journey from darkness to illumination.",
                "changing": "This changing line signifies a critical moment when the potential for light to break through is either embraced and amplified or obscured, challenging the path to enlightenment."
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "Illumination arises where the psyche remains open, fostering the soul's vibrance under the gentle embrace of nurturing shadows.",
        "Platonic": "Within the embrace of a nurturing soul, the brilliance and clarity of the inner light are unveiled and flourish.",
        "Taoist": "Radiant clarity emerges when the receptive and nurturing embrace the flow.",
        "Tholonic": "The luminous essence unfolds through its serene union with the earth's nurturing embrace.",
        "Thermodynamics": "The entropic potential of inherent brilliance manifests itself through the gentle facilitation and thermal conduciveness of openness and receptivity."
    },
    "line_type": [
        "⚋",
        "⚋",
        "⚋",
        "⚊",
        "⚋",
        "⚊"
    ]
}