{
    "id": 2,
    "hexagram_code": "䷁",
    "name": "Receptivity",
    "description": "The power of open acceptance and responsive capacity. Like fertile earth receiving seeds, this represents the creative potential of yielding awareness.",
    "king_wen": {
        "sequence": 2,
        "traditional_title": "K'un",
        "common_title": "The Receptive"
    },
    "binary_sequence": 0,
    "trigrams": {
        "above": {
            "Trigram Number": 2,
            "Binary Decimal": 0,
            "Symbol": "☷",
            "Chinese Symbol": "坤",
            "Phonetic": "Kūn",
            "English Translation": "Earth",
            "English Symbol": "地",
            "Meaning": "The Receptive",
            "Quality": "Receptive and Nurturing"
        },
        "below": {
            "Trigram Number": 2,
            "Binary Decimal": 0,
            "Symbol": "☷",
            "Chinese Symbol": "坤",
            "Phonetic": "Kūn",
            "English Translation": "Earth",
            "English Symbol": "地",
            "Meaning": "The Receptive",
            "Quality": "Receptive and Nurturing"
        }
    },
    "attributes": {
        "perspective": "Pure receptivity and sustaining power",
        "nature": "Nurturing",
        "action": "Supporting growth",
        "success_through": "Patient acceptance",
        "challenge": "Maintaining boundaries while remaining open"
    },
    "lines": [
        {
            "position": 6,
            "name": "Supreme Receptivity",
            "meaning": "Representing the ultimate state of yielding and depth, the sixth line is the culmination of an ongoing process. It epitomizes complete openness and the power that arises from maximum receptivity.",
            "changing": "At this stage, the perfected state of passive understanding has the latent ability to transform into a potent active force, marking the full cycle of dynamic evolution."
        },
        {
            "position": 5,
            "name": "Harmonious Maturity",
            "meaning": "The fifth line is the pinnacle of balanced receptivity, where mature understanding blends with an intuitive readiness to act. It signifies a harmonious integration of inner wisdom with the demands of the outer world.",
            "changing": "A moment of clarity transmutes calm acceptance into decisive, creative energy, bridging the gap between quiet insight and active influence."
        },
        {
            "position": 4,
            "name": "Delicate Surrender",
            "meaning": "This line reflects the art of yielding with dignity under pressure. The receptive spirit adapts by releasing rigidity, allowing wisdom to emerge through flexibility.",
            "changing": "In times of change, a measured shift can convert passive surrender into a proactive alignment with transformative forces."
        },
        {
            "position": 3,
            "name": "Hesitant Bloom",
            "meaning": "Here, the energy of receptivity meets the challenge of self-doubt. Moments of uncertainty hint that potential is present but requires trust and courage to fully awaken.",
            "changing": "A tentative concession of energy invites the possibility for a gentle surge of yang, transforming hesitation into confident action."
        },
        {
            "position": 2,
            "name": "Embracing Foundation",
            "meaning": "This line embodies nurturing energy and steadfast support. It acts as a stabilizing force, providing the fertile ground in which seeds of potential may develop.",
            "changing": "When the receptive earth aligns with a rising drive, it can shift into a dynamic force that actively nurtures transformation."
        },
        {
            "position": 1,
            "name": "Quiet Genesis",
            "meaning": "The first line represents the humble beginning of receptivity, where stillness paves the way for unseen potential. It invites introspection and calm, creating space for growth.",
            "changing": "A subtle spark of inner light can emerge from this quiet foundation, hinting at a future transformation toward active expression."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents pure receptivity, with both trigrams being Kun/Earth. This creates complete openness to receiving and nurturing energy.",
        "limitation": "Structure is provided by earth above and below, indicating that receptivity must maintain form. The doubled earth suggests containment through natural boundaries.",
        "contribution": "This pattern contributes to evolution by providing the space for growth. It shows how receptivity enables manifestation.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents pure potential. It demonstrates how consciousness creates space for emergence."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on maintaining receptive capacity. Success comes through steady support rather than initiative.",
        "all_moving_lines": "A complete transformation in how receptivity functions is indicated. Old patterns of acceptance must give way to new forms of support. Ensure nurturing remains while embracing change."
    },
    "hierarchy": {
        "order8child": "Pure receptive force",
        "order8parent": "PRIMAL DEFINITION; Creation of Basic Forms"
    },
    "image": {
        "description": "The image representing the hexagram \"Receptivity\" is a landscape that embodies the essence of open acceptance and nurturing awareness. The soft, rolling hills reflect universal patterns of growth and harmonious balance, illustrating the dynamic relationships between earth and sky. The layering of elements emphasizes a triadic interaction where the ground supports, the horizon defines, and the sky integrates order and emergence through its weightless expanse. The tonal gradations between light and shadow capture the equilibrium between chaos and structure, allowing new forms to emerge gently, much like the creative potential symbolized in the hexagram. This composition uses landscape as a medium to depict the nurturing aspect of receptivity, showing how sustaining power is woven through natural harmony and patient support.",
        "file": "02.png"
    },
    "energy_cycle": "ascending",
    "stories": {
        "title": "Three Tales of \"Receptivity\"",
        "entries": [
            {
                "title": "The Living Library (Man vs. Man)",
                "theme": "Ray Bradbury",
                "summary": "When they came to burn the books, Librarian Chen didn't fight. Instead, she opened the library's doors wide and welcomed the book-burners in. But as they grabbed volumes from shelves, she began telling stories - not defending or preaching, just sharing tales from the very books they meant to destroy. Night fell. The torches became reading lights. By dawn, the would-be burners sat cross-legged on the floor, passing books between them, their mission forgotten in the simple act of receiving stories.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion: Metamorphosis of Mission",
                        "meaning": "The book-burners return to the library transformed, signifying the completion of a cycle. This stage represents surrender to change, refinement of experiences, and the potential for new beginnings. Resistance to closure, clinging to past ways, or extending a concluded mission may hinder the transformative process.",
                        "changing": "If the line changes from Yin to Yang, it may suggest resistance to closure, preventing the completion of the transformative cycle, or prolonging the process beyond its natural endpoint."
                    },
                    "5": {
                        "name": "Engagement: Evolution of Purpose",
                        "meaning": "The book-burners fully engage in the stories, leading to a transformative experience. This stage signifies leadership and execution of the potential within the shared narratives. Indecision, loss of authority, or incomplete realization of the transformative vision may arise if there are deviations from the natural state of engagement.",
                        "changing": "If the line changes from Yang to Yin, it could indicate a loss of authority or a lack of decisiveness in fully integrating the transformative experiences, potentially stalling the evolution of purpose."
                    },
                    "4": {
                        "name": "Alignment: The Gathering of Minds",
                        "meaning": "The book-burners experience alignment with the stories, preparing for a shift in their original mission. This stage represents the external emergence of receptivity and alignment with new perspectives. Premature assertion or instability at this point could hinder the readiness for a transformation in the book-burners' intentions.",
                        "changing": "If the line changes from Yin to Yang, it suggests premature external assertion, possibly leading to disruptions in the alignment process and hindering the transition towards a new mission."
                    },
                    "3": {
                        "name": "Transition: Conversion of Torches to Lights",
                        "meaning": "As night falls and the stories unfold, Librarian Chen reaches a culmination in the inner process of transformation. This stage signifies the completion of sharing stories and the transition to external manifestation through storytelling. Any hesitation in carrying the inner realization outward may stagnate the transformative power of the narratives.",
                        "changing": "If the line changes from Yang to Yin, it may indicate a reluctance to carry the stories outward, resulting in a lack of progression towards external manifestation or an obstruction in sharing the transformative power of the stories."
                    },
                    "2": {
                        "name": "Manifestation: Unity in Stories",
                        "meaning": "Librarian Chen actively engages in storytelling, aligning perspectives and offering insight through shared narratives. This stage represents the active state of consolidating experiences and structuring potential. Premature action or instability in this phase could disrupt the harmonious storytelling dynamic and impede the formation of connections.",
                        "changing": "If the line changes from Yin to Yang, it suggests potential issues with premature action or struggle to integrate, leading to disruptions in the storytelling process."
                    },
                    "1": {
                        "name": "Emergence: Sharing Stories",
                        "meaning": "At this stage, Librarian Chen initiates a transformative process by sharing stories instead of resisting book-burners. It signifies the birth of potential bridging understanding through narratives. If Librarian Chen hesitated or showed weakness in this stage, the transformation might not have unfolded as profoundly.",
                        "changing": "If the line changes from Yang to Yin, it would indicate a setback in the storytelling process, possibly leading to a lack of readiness or failure to initiate change effectively."
                    }
                }
            },
            {
                "title": "The Desert Keeper (Man vs. Nature)",
                "theme": "Antoine de Saint-Exupéry",
                "summary": "In a desert where others built walls against sandstorms, Maria learned to welcome the wind. She created curved channels in the sand, letting storms deposit their grains precisely where she needed them. Each dune became a note in her desert symphony, shaped by acceptance rather than resistance. Over years, her land transformed into a self-sustaining oasis, where wind-carved formations captured moisture and sheltered life. The desert hadn't changed, but by receiving its nature, she had changed what it could create.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion and Renewal",
                        "meaning": "Signifying the closing of a cycle, surrender to change, and refinement of experience, allowing for dissolution and renewal.",
                        "changing": "If Yang replaces Yin, it may indicate resistance to closure, clinging to power, or forced extension beyond completion."
                    },
                    "5": {
                        "name": "Leadership and Execution",
                        "meaning": "Full engagement in the world, leadership, and execution of potential, embodying a position of authority and action.",
                        "changing": "If Yin replaces Yang, it could mean indecision, loss of authority, or incomplete realization of visions."
                    },
                    "4": {
                        "name": "Alignment in Manifestation",
                        "meaning": "Alignment with external forces and preparation for action, setting the stage for external realization.",
                        "changing": "If Yang replaces Yin, it may suggest premature external assertion before stable conditions are established."
                    },
                    "3": {
                        "name": "Transition to Action",
                        "meaning": "Culmination of inner processes and transition to external manifestation, bridging inner realization with outer expression.",
                        "changing": "If Yin replaces Yang, it suggests hesitation in carrying inner insights outward, or stagnation at the threshold of change."
                    },
                    "2": {
                        "name": "Formation of Harmony",
                        "meaning": "Representation of support, alignment, and structuring of potential, integrating inner realizations.",
                        "changing": "If Yang replaces Yin, it may indicate premature action, instability, or struggle to integrate."
                    },
                    "1": {
                        "name": "Emergence of Potential",
                        "meaning": "The birth of potential and an initiating force, marking the beginning of a transformative process.",
                        "changing": "If Yin replaces Yang, it suggests hesitation, weakness, or a lack of readiness."
                    }
                }
            },
            {
                "title": "The Memory Vessel (Man vs. Self)",
                "theme": "Stanisław Lem",
                "summary": "In 2157, while others fought against cognitive overflow, Dr. Sarah Wei discovered she could function as a pure receiver of information. Rather than filtering or organizing incoming data, she learned to be like water - holding all without resistance. Her breakthrough came when she stopped trying to control her augmented memory and instead allowed it to find its own patterns. The more receptive she became, the more naturally order emerged from chaos.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion and Surrender",
                        "meaning": "Sarah embraces the closure of her current cycle, surrendering to change and refining her experiences.",
                        "changing": "If Yang replaces Yin, resistance to closure or clinging to past power may hinder her journey towards renewal."
                    },
                    "5": {
                        "name": "Full Engagement in Manifestation",
                        "meaning": "Dr. Wei fully engages with the world, embodying leadership and executing her newfound potential.",
                        "changing": "If Yin replaces Yang, indecision or incomplete realization may challenge her authority and vision."
                    },
                    "4": {
                        "name": "Aligning with External Forces",
                        "meaning": "Sarah prepares herself for outward action, seeking alignment with the external conditions she encounters.",
                        "changing": "If Yang replaces Yin, premature assertion in the external world may result in unstable outcomes."
                    },
                    "3": {
                        "name": "Culmination and Transition",
                        "meaning": "Sarah reaches the completion of her internal journey, poised to transition her inner realization outward.",
                        "changing": "If Yin replaces Yang, hesitation in externalizing her newfound understanding may lead to stagnation."
                    },
                    "2": {
                        "name": "Formation of Alignment",
                        "meaning": "Dr. Wei embraces receptivity, aligning herself with the structuring of incoming data without resistance.",
                        "changing": "If Yang replaces Yin, premature action or struggle with integration may disrupt the harmonious flow."
                    },
                    "1": {
                        "name": "Emergence of Potential",
                        "meaning": "Dr. Sarah Wei perceives the birth of potential, initiating a transformative process within herself.",
                        "changing": "If Yin replaces Yang, hesitation and weakness may hinder the initial phase of growth."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "Darwin's Silent Revolution",
        "subtitle": "\"Receptivity\" in History",
        "summary": "In 1858, Charles Darwin received a manuscript from Alfred Russel Wallace that outlined the exact theory of evolution by natural selection that Darwin had been developing for twenty years. Rather than defending his priority or dismissing Wallace's insights, Darwin demonstrated remarkable receptivity. He arranged for both their papers to be presented jointly to the Linnean Society, giving Wallace full credit as co-discoverer. Darwin's receptive approach extended to his scientific method. Unlike his contemporaries who imposed theories on nature, Darwin spent decades simply observing and collecting data. His notebooks show a mind open to evidence that often contradicted his initial assumptions. He let his theory emerge from observations rather than forcing facts to fit preconceptions. This receptive approach proved crucial to his insights. By remaining open to nature's patterns rather than imposing his own, he was able to perceive the subtle workings of natural selection that others had missed. His willingness to consider every piece of evidence, even those that challenged his ideas, led to a more robust theory.",
        "source": [
            "\"Darwin: The Life of a Tormented Evolutionist\" by Adrian Desmond",
            "James Moore (1991)",
            "\"Darwin's Century: Evolution",
            "the Men Who Discovered It\" by Loren Eiseley (1958)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Completion and Refinement of Receptivity",
                "meaning": "Closing of the cycle of receptivity, surrendering to change or refining experiences. This stage signifies the completion of the receptive process, leading to renewal and refinement.",
                "changing": "When encountering a changing line, there may be resistance to closure or clinging to power, indicating challenges in gracefully concluding the receptive journey."
            },
            "5": {
                "name": "Manifestation of Harmonious Engagement",
                "meaning": "Full engagement in the external world, demonstrating leadership and the execution of receptive potential. This stage represents the active realization of receptivity in action.",
                "changing": "In the presence of a changing line, there may be indecision or incomplete realization of receptivity, hinting at a need for clarity and authority in external engagement."
            },
            "4": {
                "name": "Emergence of External Alignment",
                "meaning": "Receptive forces align with external factors, preparing for outward action and manifestation. This stage embodies the alignment with external influences to support stability.",
                "changing": "If a moving line emerges, it signifies potential instability or premature assertion in external alignment, requiring a reassessment of readiness for action."
            },
            "3": {
                "name": "Transition to External Receptivity",
                "meaning": "Culmination of internal receptivity, signaling the transition towards external expression and action. This stage marks the completion of the inner transformation.",
                "changing": "When encountering a changing line, there may be hesitation in externalizing receptivity, leading to a delay in fully manifesting openness and adaptability."
            },
            "2": {
                "name": "Formation of Receptivity",
                "meaning": "Receptive forces align to support and structure potential, embodying the essence of adaptability and consolidation. This stage represents the active state of receptivity taking shape.",
                "changing": "With a changing line, there is a potential for premature action or instability in receptivity, prompting a need for realignment and integration."
            },
            "1": {
                "name": "Emergence of Receptivity",
                "meaning": "The initial stage of receptivity unfolding, marking the birth of a transformative force. This stage signifies the emergence of openness and adaptability.",
                "changing": "If a moving line occurs, it indicates a significant shift in receptivity, potentially leading to a deeper level of openness and engagement."
            }
        }
    }
}