{
    "id": 10,
    "hexagram_code": "䷉",
    "name": "Potential",
    "description": "The dynamic state of unrealized power. Like a tiger observing its surroundings before acting, this represents latent energy awaiting the right moment for expression.",
    "king_wen": {
        "sequence": 10,
        "traditional_title": "Lü",
        "common_title": "Treading"
    },
    "binary_sequence": 59,
    "trigrams": {
        "above": {
            "Trigram Number": 1,
            "Binary Decimal": 7,
            "Symbol": "☰",
            "Chinese Symbol": "乾",
            "Phonetic": "Qián",
            "English Translation": "Heaven",
            "English Symbol": "天",
            "Meaning": "The Creative",
            "Quality": "Strong and Creative"
        },
        "below": {
            "Trigram Number": 8,
            "Binary Decimal": 4,
            "Symbol": "☱",
            "Chinese Symbol": "兑",
            "Phonetic": "Duì",
            "English Translation": "Lake/Marsh",
            "English Symbol": "泽",
            "Meaning": "The Joyous",
            "Quality": "Joyful and Harmonious"
        }
    },
    "attributes": {
        "perspective": "Power held in check by awareness",
        "nature": "Contained strength",
        "action": "Mindful conduct",
        "success_through": "Disciplined restraint of power",
        "challenge": "Maintaining control while possessing strength"
    },
    "lines": [
        {
            "position": 6,
            "name": "Transcendent Completion",
            "meaning": "The cycle of potential reaches its culmination, symbolizing wisdom achieved through the full evolution of energy.",
            "changing": "At this pinnacle, the transformative process is complete, with no further shift from yin to yang required."
        },
        {
            "position": 5,
            "name": "Radiant Ascendancy",
            "meaning": "The apex of potential is near as the essence of purpose fully emerges to illuminate the path with clarity and strength.",
            "changing": "The transformation reaches a peak, with latent energies converting entirely to dynamic, visible manifestation."
        },
        {
            "position": 4,
            "name": "Rising Momentum",
            "meaning": "Accumulated energy surmounts internal resistance, opening new avenues for growth and forward movement.",
            "changing": "A merging of energies transforms stability into active momentum, with yin gradually yielding to yang vitality."
        },
        {
            "position": 3,
            "name": "Burgeoning Initiative",
            "meaning": "Dynamic energy starts to assert itself, signifying that the initial phase of potential is ready to test its limits.",
            "changing": "A notable change unfolds, where inner softness rearranges into a more assertive, yang-driven force."
        },
        {
            "position": 2,
            "name": "Gentle Sprout",
            "meaning": "Early signs of growth emerge quietly, suggesting potential that is delicate yet promising.",
            "changing": "A measured transformation occurs, with soft yin energies transitioning into a fragile yang presence."
        },
        {
            "position": 1,
            "name": "Dormant Seed",
            "meaning": "A nascent spark of possibility lies hidden, awaiting the nurturing forces that can awaken its latent energy.",
            "changing": "A subtle internal shift begins as the dormant essence stirs toward expression."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the negotiation between powerful force (Qian/Heaven) and joyful expression (Dui/Lake). This creates a dynamic balance between strength and restraint.",
        "limitation": "Structure is provided by heaven above, indicating that power must be guided by higher principles. The lake below suggests that expression must be contained.",
        "contribution": "This pattern contributes to evolution by demonstrating how controlled power leads to sustainable progress. It shows how awareness guides force.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents the point where power meets conscious restraint. It demonstrates how awareness can guide potential into proper expression."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on maintaining disciplined conduct. Success comes through careful management of power rather than its release.",
        "all_moving_lines": "A complete transformation in how potential is handled is indicated. Old patterns of restraint must give way to new forms of control. Ensure that power remains guided while embracing change."
    },
    "hierarchy": {
        "order8child": "Mindful progress",
        "order8parent": "EARLY DEVELOPMENT; Building Structure"
    },
    "image": {
        "description": "The image embodies the hexagram \"Potential\" by illustrating the intricate interplay between latent energy and disciplined restraint. The central motif of a dynamic, yet contained, structure represents the universal patterns of potential energy held in check by conscious awareness. This reflects a hierarchy where the potential for action is balanced by mindful control, akin to a carefully calibrated machine. The triadic relationship is visible in the interaction between the flames of possibility, the structural elements of order, and the fluid chaos of clouds, demonstrating how emergence arises from this balance. Through the interplay of these components, the image captures how awareness guides force, embodying the emergence of order from chaos, and the evolution of restrained power into sustainable progress.",
        "file": "10.png"
    },
    "energy_cycle": "descending",
    "stories": {
        "title": "Three Tales of \"Potential\"",
        "entries": [
            {
                "title": "The Master's Challenge (Man vs. Man)",
                "theme": "In the style of Murasaki Shikibu",
                "summary": "At the imperial court, where political power flowed like invisible currents, Lady Akiko possessed knowledge that could destroy her greatest rival. Yet she recognized that wielding such power carelessly would disturb the delicate balance of court life. While others urged immediate action, she chose to cultivate patience.\n\nThrough careful observation, she noticed how her rival's actions were already creating ripples of consequence. In formal ceremonies, she maintained perfect courtesy, each graceful gesture a reminder of her potential power rather than its exercise. Her restraint itself became a form of strength, drawing others to trust her judgment.\n\nWhen her rival finally orchestrated a public confrontation, Lady Akiko's response was so measured, so perfectly calibrated, that it transformed the attack into an opportunity for reconciliation. The court witnessed not the destruction of an enemy but the masterful conversion of opposition into alliance.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion of Transformation",
                        "meaning": "The court witnesses not the destruction of an enemy but the refinement of experience through Lady Akiko's measured response. Indicates the closing of a cycle and surrender to the opportunity for change.",
                        "changing": "If Yang replaces Yin, it may suggest resistance to closure, clinging to power, or forced extension of a process beyond its natural course."
                    },
                    "5": {
                        "name": "Leadership in Alliance",
                        "meaning": "Lady Akiko's masterful conversion of opposition into alliance, demonstrating full engagement with the world and leadership qualities. The pinnacle of influence and manifestation.",
                        "changing": "If Yin replaces Yang, it could imply indecision, loss of authority, or incomplete realization of the alliance's potential."
                    },
                    "4": {
                        "name": "Alignment for Reconciliation",
                        "meaning": "Lady Akiko's response to the orchestrated confrontation, transforming it into an opportunity for reconciliation. Demonstrates her alignment with external forces and preparation for action.",
                        "changing": "If Yang replaces Yin, it may suggest premature external assertion or an incomplete realization of her vision for reconciliation."
                    },
                    "3": {
                        "name": "Transition to External Action",
                        "meaning": "Lady Akiko's balanced observation of her rival's actions and her preparation for an eventual external manifestation. Culmination of internal processes leading to outward transition.",
                        "changing": "If Yin replaces Yang, it suggests reluctance to bring her inner realizations into action, risking stagnation at the threshold of change."
                    },
                    "2": {
                        "name": "Formation of Restraint",
                        "meaning": "Lady Akiko's choice to cultivate patience and maintain perfect courtesy despite possessing the power to act. Restraint becomes a form of strength.",
                        "changing": "If Yang replaces Yin, it may indicate premature action or missed opportunity to consolidate power through patience."
                    },
                    "1": {
                        "name": "Emergence of Potential",
                        "meaning": "Lady Akiko's initial realization of possessing knowledge that could disrupt the balance of court life. A moment of birth of potential power.",
                        "changing": "If Yin replaces Yang, it suggests hesitance or missed opportunity to initiate a significant change."
                    }
                }
            },
            {
                "title": "The Storm Dancer (Man vs. Nature)",
                "theme": "In the style of Ursula K. Le Guin",
                "summary": "On a planet where electromagnetic storms could shred the strongest ships, Navigator Sarah Chen discovered she could pilot through them by treating their power as a dance partner rather than an enemy. While others sought stronger shields, she learned to read the storm's rhythms.\n\nEach massive discharge of energy became a step in an intricate dance. Her small ship moved not against the lightning but between its bolts, using minimal adjustments to glide through impossibly narrow safe zones. What looked like reckless risk-taking to others was actually precise calculation tempered by deep respect for the storm's power.\n\nThe technique revolutionized space travel, showing how ships could navigate the most dangerous regions by understanding and working with natural forces rather than trying to overpower them.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion and Renewal",
                        "meaning": "Sarah embraces the completion of the cycle, surrendering to the storm's power for refinement and renewal of her experience.",
                        "changing": "If Yang replaces Yin, resistance to closure or clinging to power may hinder the natural course of dissolution and evolution."
                    },
                    "5": {
                        "name": "Engagement and Execution",
                        "meaning": "Sarah fully engages in navigating the storm, demonstrating leadership and executing her vision with authority.",
                        "changing": "If Yin replaces Yang, indecision or incomplete realization of the vision may lead to a loss of effectiveness."
                    },
                    "4": {
                        "name": "Alignment with External Forces",
                        "meaning": "Sarah prepares for external action by aligning herself with the storm's energies, balancing influences to maintain harmony.",
                        "changing": "If Yang replaces Yin, premature external assertion may disrupt the stability of preparations."
                    },
                    "3": {
                        "name": "Culmination of Transition",
                        "meaning": "Sarah reaches the culmination of this internal process, ready to manifest her understanding outwardly by gliding through the storm's safe zones.",
                        "changing": "If Yin replaces Yang, hesitation in transitioning outwards or stagnation at the threshold of change may hinder progress."
                    },
                    "2": {
                        "name": "Alignment and Integration",
                        "meaning": "Sarah aligns with the storm's rhythms, forming a structured dance of movement between lightning bolts, embracing receptivity and adaptability.",
                        "changing": "If Yin replaces Yang, premature action and struggle to integrate may destabilize the structure."
                    },
                    "1": {
                        "name": "Emergence of Harmony",
                        "meaning": "Navigator Sarah Chen discovers the potential in treating electromagnetic storms as dance partners, initiating a transformative approach to navigating nature.",
                        "changing": "If Yang replaces Yin, the emergence of potential becomes hesitant or weakened."
                    }
                }
            },
            {
                "title": "The Mind Smith (Man vs. Self)",
                "theme": "In the style of William Gibson",
                "summary": "In 2157, when neural enhancement had become universal, Wei discovered she possessed the rare ability to forge raw digital consciousness. Each quantum thought pattern was like molten metal, capable of becoming anything but requiring perfect control to shape.\n\nRather than rushing to monetize her gift, she spent years developing discipline, learning to contain and direct the wild potential of unformed thought. Her workshop became known not for the quantity of its output but for the perfect balance of each creation.\n\nWhen others lost control of their enhanced minds, they came to her not for more power but for the wisdom to manage what they had. Her greatest achievement wasn't in what she created but in what she chose not to create.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion and Surrender",
                        "meaning": "Signifying the closing of a cycle, surrender to change, or refinement of experience. Wei's greatest achievement lies not in what she creates but in the discipline to choose what not to create, surrendering to the wisdom of discernment over blind productivity.",
                        "changing": "If Yang replaces Yin, it may indicate resistance to closure, clinging to power, or forced extension beyond completion."
                    },
                    "5": {
                        "name": "Full Engagement and Leadership",
                        "meaning": "Indicating full engagement in the world, leadership, and execution of refined potential. Wei's workshop becomes known not for vast output, but for the quality and leadership she displays in guiding others to manage their enhanced minds.",
                        "changing": "If Yin replaces Yang, it could mean indecision, loss of authority, or an incomplete realization of vision."
                    },
                    "4": {
                        "name": "Alignment and Preparation",
                        "meaning": "Alignment with external forces, preparing for the next phase of action. Others seek Wei's guidance to prepare themselves for the challenges of enhanced minds, aligning themselves with her teachings before venturing further.",
                        "changing": "If Yang replaces Yin, it may suggest premature external assertion before stable conditions."
                    },
                    "3": {
                        "name": "Culmination and Transition",
                        "meaning": "The culmination of inner realization, standing at the threshold of external action. Wei's journey nears completion as she prepares to manifest her refined creations externally, transitioning from internal exploration to an outward expression of her wisdom.",
                        "changing": "If Yin replaces Yang, it suggests hesitation in carrying inner realization outward, or stagnation at the threshold of change."
                    },
                    "2": {
                        "name": "Alignment and Structuring",
                        "meaning": "Representing support, alignment, and structuring of potential. Wei develops discipline to contain and direct the wild potential of unformed thought, aligning her abilities to create a perfect balance in her workshop.",
                        "changing": "If Yang replaces Yin, it may indicate premature action, instability, or struggle to integrate."
                    },
                    "1": {
                        "name": "Emergence of Potential",
                        "meaning": "The birth of potential and an initiating force. Wei discovers her rare ability to forge raw digital consciousness, akin to molten metal awaiting shaping. This marks the initial stage of unleashing untapped possibilities within her.",
                        "changing": "If Yin replaces Yang, it suggests hesitation, weakness, or a lack of readiness."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "Lincoln's First Inaugural Response",
        "subtitle": "\"Potential\" in History",
        "summary": "In March 1861, when seven Southern states had already seceded and civil war seemed inevitable, Abraham Lincoln delivered his first inaugural address from a position of immense but precarious power. As the newly-installed President, he commanded the nation's military might, yet understood that an aggressive display of force would likely trigger immediate conflict.\n\nInstead of threatening the South or making a show of federal power, Lincoln chose a path of measured restraint. His address carefully balanced firmness with conciliation, famously concluding \"We are not enemies, but friends... Though passion may have strained, it must not break our bonds of affection.\"\n\nEven as he assured the South that he had no intention to interfere with slavery where it existed, he made clear his constitutional duty to preserve the Union. When he did mention federal power, it was with careful precision: \"Beyond what may be necessary for these objects, there will be no invasion, no using of force against or among the people anywhere.\"\n\nThis masterful display of controlled strength - showing power while choosing when and how to use it - exemplifies the essence of treading carefully while possessing great force. Though war eventually came, Lincoln's measured approach helped secure crucial border states and demonstrated to the world that the Union sought peace while possessing the strength for war.",
        "source": [
            "\"Lincoln's First Inaugural Address\" (1861)",
            "\"Team of Rivals: The Political Genius of Abraham Lincoln\" by Doris Kearns Goodwin (2005)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Return, Closure, Refinement",
                "meaning": "Signaling the closure of the cycle, this stage embraces surrender to change, refinement of experience, and the preparation for renewal.",
                "changing": "If this line's Yin changes to Yang, it could suggest resistance to closure, clinging to power, or the prolongation of a phase that has reached its completion."
            },
            "5": {
                "name": "Manifestation of Leadership",
                "meaning": "Taking on a role of full engagement, this stage embodies leadership and execution, guiding the vision towards realization.",
                "changing": "When Yang changes to Yin in this line, it may indicate indecision, loss of authority, or an incomplete realization of the intended vision."
            },
            "4": {
                "name": "Emergence in External Realm",
                "meaning": "Aligned with external forces, this stage prepares for action in the outer world, setting the groundwork for further manifestation.",
                "changing": "If a changing line alters from Yin to Yang, it could imply premature external assertion before stable conditions are established."
            },
            "3": {
                "name": "Completion and Transition",
                "meaning": "Reaching the culmination of the inner cycle, a transition to external action is marked, signifying readiness to embody transformation.",
                "changing": "A change where Yin replaces Yang suggests hesitation in externalizing realizations or potential stagnation at the brink of change."
            },
            "2": {
                "name": "Formation of Harmony",
                "meaning": "As the process unfolds, support and alignment structures the potential, paving the way for materialization and manifestation.",
                "changing": "When the line's Yang changes to Yin, it may indicate premature action, instability, or struggle to integrate the forming structure."
            },
            "1": {
                "name": "Emergence of Potential",
                "meaning": "At the beginning of this transformation, the potential for change is birthed, signaling the initiation of a crucial process.",
                "changing": "If the line's Yin changes to Yang, it signifies hesitation, weakness, or unreadiness in embracing the emerging potential."
            }
        }
    }
}