{
  "id": 57,
  "hexagram_code": "䷸",
  "name": "Penetration",
  "description": "The gentle but persistent influence that creates lasting change. Like wind shaping mountains or water wearing through stone, this represents the power of subtle, continuous action to transform even the most resistant situations.",
  "king_wen": {
    "sequence": 57,
    "traditional_title": "Xun/The Gentle",
    "common_title": "The Penetrating Wind"
  },
  "binary_sequence": 54,
  "trigrams": {
    "above": {
      "Trigram Number": 5,
      "Binary Decimal": 6,
      "Symbol": "☴",
      "Chinese Symbol": "巽",
      "Phonetic": "Xùn",
      "English Translation": "Wind/Wood",
      "English Symbol": "风/木",
      "Meaning": "The Gentle",
      "Quality": "Gentle and Penetrating"
    },
    "below": {
      "Trigram Number": 5,
      "Binary Decimal": 6,
      "Symbol": "☴",
      "Chinese Symbol": "巽",
      "Phonetic": "Xùn",
      "English Translation": "Wind/Wood",
      "English Symbol": "风/木",
      "Meaning": "The Gentle",
      "Quality": "Gentle and Penetrating"
    }
  },
  "attributes": {
    "perspective": "The cumulative power of consistent subtle influence",
    "nature": "Persistent, adaptable, pervasive",
    "action": "Gentle influence, steady progress",
    "success_through": "Consistent, subtle pressure",
    "challenge": "Maintaining persistence without forcing"
  },
  "lines": [
    {
      "position": 6,
      "name": "The Final Transformation",
      "meaning": "Completion brings a profound change. This line represents the culmination of efforts, inviting renewal and the emergence of a new phase.",
      "changing": "Residual openness is recharged into creative power, transforming prior vulnerabilities into a robust foundation for future endeavors."
    },
    {
      "position": 5,
      "name": "Illumination of the Path",
      "meaning": "Clarity emerges at the peak of penetration, illuminating hidden aspects and guiding further efforts with wisdom and vision.",
      "changing": "The quiet glow of understanding matures into a clear, radiant force, turning inner reflection into external guidance."
    },
    {
      "position": 4,
      "name": "The Deep Strike",
      "meaning": "At its core, the moment demands a decisive and penetrating action. It challenges one to face risks directly in pursuit of breakthrough.",
      "changing": "A latent insight transforms into direct engagement, shifting from reserved perception to an active, decisive intervention."
    },
    {
      "position": 3,
      "name": "Midway Resistance",
      "meaning": "Obstacles naturally arise during the process of penetration. This line signifies testing limits and refining the method in the midst of resistance.",
      "changing": "Passive endurance gradually unveils assertive energy, as the inner softness congeals into constructive action."
    },
    {
      "position": 2,
      "name": "The Firm Approach",
      "meaning": "Progress requires a steady, resolute attitude. This line emphasizes commitment and a careful, measured advance amid challenges.",
      "changing": "A gentle determination evolves into robust confidence, turning softness into the strength of character."
    },
    {
      "position": 1,
      "name": "The Opening Strike",
      "meaning": "The first step is subtle yet significant. It sparks the process of breaking through limitations and initiates the journey with latent potential.",
      "changing": "The initial quiet vulnerability transforms into a bold impulse, shifting from introspection to dynamic onset."
    }
  ],
  "tholonic_analysis": {
    "negotiation": "The hexagram represents the balance between influence and resistance. The doubled wind shows how persistent gentle force can overcome obstacles, demonstrating that subtle influence can be more effective than direct confrontation.",
    "limitation": "The structure defines boundaries between effective and ineffective influence. It establishes how change must occur through natural patterns, showing that force must align with existing flows.",
    "contribution": "This configuration contributes to systemic evolution by demonstrating how subtle persistence creates lasting change. It shows how gentle but continuous influence shapes reality.",
    "significance_in_thologram": "Represents the critical role of persistent subtle influence. Functions as a model for how awareness shapes circumstances through consistent action. Important in understanding how systems evolve through gradual transformation."
  },
  "transformations": {
    "no_moving_lines": "The situation calls for maintaining gentle persistence. Continue subtle influence while respecting natural patterns. Success comes through steady, unforced progress.",
    "all_moving_lines": "Complete transformation through subtle influence is occurring. All aspects of the situation are responding to gentle pressure. The penetration will create fundamental change, requiring careful attention to maintaining appropriate force."
  },
  "hierarchy": {
    "order8child": "Subtle penetration",
    "order8parent": "COMPLETION & RENEWAL; Return to Source"
  },
  "image": {
    "description": "The hexagram \"PENETRATION\" with its themes of completion, renewal, and subtle transformation, finds expression through the chosen elements. The object of wind symbolizes a gentle yet persistent influence, akin to the transformational power of awareness in the Tholonic Model, subtly shaping reality. Minimalism, represented in form and style, mirrors the Thologram's simplicity and elegance, illustrating how complex systems emerge from basic principles. Pencil as a medium reflects a raw, fundamental quality, echoing the primal point of origin in the Tholonic Model, where creativity starts from simplicity. Henri Matisse, known for his ability to convey depth through simplicity, embodies the essence of negotiation and balance forces within a Tholon, capturing the interconnectedness of universal love and transformation. These elements collectively articulate the hexagram's deeper meaning of subtle but pervasive metamorphosis.",
    "file": "57.png"
  },
  "energy_cycle": "descending",
  "stories": {
    "title": "Three Tales of \"Penetration\"",
    "entries": [
      {
        "title": "Whispers in the Dark (Man vs. Man)",
        "theme": "Haruki Murakami",
        "short_story": "In a city woven with neon lights and shadows, Kenji felt the echoes of unshaped ideas stirring within him. A writer caught in a mundane routine, each night he scribbled fragments on napkins in dimly lit bars. It was as if his soul were whispering amidst the noise, urging him to shape his raw potential into stories. But when the tremor of inspiration struck, doubt clouded his vision, stalling his creative impulse like a boat snagged in fog. Determined, he secluded himself at a coastal inn, letting the ocean’s rhythm shape his thoughts. Words began to flow, gentle yet persistent, like ink over paper. His stories formed, although the currents of the outside world threatened to pull him off course, challenging his resolve to create. As he persevered, his narratives took root, aligning with the deeper currents of his consciousness. Kenji found mastery in this alignment, his stories gaining clarity and strength, illuminating hidden corners of human experience. The tales transcended their creator, walking into the world as entities of their own. Kenji, now a vessel rather than a keeper, realized that in creativity, ultimate freedom lay in letting go.",
        "lines_in_context": {
          "6": {
            "name": "Transcendent Creation",
            "meaning": "Kenji's creations become autonomous, impacting the world beyond the author's intent, representing the completion and independence of creative endeavors.",
            "changing": "If yang changes to yin, Kenji’s tendency to cling to his stories prevents their full realization, hindering their influence and growth."
          },
          "5": {
            "name": "Clarity and Mastery",
            "meaning": "Kenji achieves a profound understanding and mastery over his creative work, guiding and shaping his stories with vision.",
            "changing": "If yang changes to yin, his clarity may falter, bringing about arrogance or misjudgment that undermines his success."
          },
          "4": {
            "name": "Alignment with Reality",
            "meaning": "Kenji's stories begin to align with his reality and its demands, gaining momentum and effectiveness.",
            "changing": "If yin changes to yang, this alignment could result in overreaching ambition, leading to unsustainable creative effort."
          },
          "3": {
            "name": "Resolute Determination",
            "meaning": "Kenji persists through external challenges, using his internal conviction to drive creative work forward despite obstacles.",
            "changing": "If yang changes to yin, he risks retreat or exhaustion before fully actualizing his creative vision."
          },
          "2": {
            "name": "Defined Vision",
            "meaning": "Kenji begins to structure his ideas into a coherent vision, shaping the path of his creative journey.",
            "changing": "If yin changes to yang, premature action could destabilize his efforts, causing misalignment with natural creative flow."
          },
          "1": {
            "name": "Stirrings of Potential",
            "meaning": "Kenji experiences the first inklings of creativity, filled with unshaped potential but faces the challenge of direction.",
            "changing": "If yang changes to yin, hesitation or lack of action delays the pursuit of creative expression."
          }
        }
      },
      {
        "title": "The Sculptor's Revelation (Man vs. Nature)",
        "theme": "Gabriel Garcia Marquez",
        "short_story": "In the remote village of Piedra Blanca, an enigmatic sculptor named Sebastian found himself surrounded by vast quarries, each stone a vessel of unformed dreams. Despite his talent, he seemed lost, staring at the silent blocks without a hammer. His heart brimmed with the potential to breathe life into these lifeless boulders, yet uncertainty tethered him to inaction. As weeks passed, he bravely struck his chisel upon the rock, forming the outline of a figure. The raw stone slowly revealed a hint of humanity, but Sebastian faced mockery from the villagers who saw his work as meaningless toil. Undeterred, he captured their scorn and turned frustration into fervor, refining each curve with unwavering patience. His persistence transformed skeptics into spectators. Guided by whispers of the rustling wind, he shaped his vision to the will of the stone. As months turned, the sculpture stood complete—an eternal dancer poised in mid-flight, testimony to the tenacity of one man's heart. The villagers gazed in awe, no longer seeing Sebastian's mark but a tangible wonder transcending the artist himself. In letting go, he became the legend of Piedra Blanca, and the dancer, though motionless, danced through the hearts of all who saw her.",
        "lines_in_context": {
          "6": {
            "name": "Transcendence",
            "meaning": "Sebastian's creation stands autonomous, touching the world beyond his own influence.",
            "changing": "If yang changes to yin, Sebastian's cling to ownership of the creation would hinder its broader acceptance and impact."
          },
          "5": {
            "name": "Mastery",
            "meaning": "The sculptor achieves command over his medium, reaching the peak of his craft.",
            "changing": "If yang changes to yin, arrogance could lead to a downfall or misinterpretation of his artistic vision."
          },
          "4": {
            "name": "Manifestation",
            "meaning": "Sebastian aligns his work with reality, drawing villagers' recognition and approval.",
            "changing": "If yin changes to yang, overreaching could create unsustainable ambition, misaligning with the stone's natural form."
          },
          "3": {
            "name": "Conflict",
            "meaning": "Facing villagers' ridicule, Sebastian pushes through opposition to refine his vision.",
            "changing": "If yang changes to yin, he risks retreat or losing momentum before completion."
          },
          "2": {
            "name": "Formation",
            "meaning": "Begins shaping raw stone, defining his artistic path while encountering initial barriers.",
            "changing": "If yin changes to yang, he might act prematurely, destabilizing the sculpture's essence."
          },
          "1": {
            "name": "Emergence",
            "meaning": "Filled with unshaped potential, Sebastian hesitates at the brink of creation.",
            "changing": "If yang changes to yin, lingering uncertainty delays the birth of his artistic endeavor."
          }
        }
      },
      {
        "title": "The Sculptor's Silent Symphony (Man vs. Self)",
        "theme": "Kazuo Ishiguro",
        "short_story": "In the quiet solitude of his studio, Marcus, a sculptor in a world where art was whispered of but rarely seen, felt an inexplicable pull toward a block of uncut marble. Day after day, the marble loomed, untouched yet teeming with the promise of a masterpiece. His days began to shape around this silent symphony of potential. Doubts gnawed at his resolve, unshaped visions danced beyond clarity. One sunrise, emboldened, Marcus lifted his chisel, daring to carve out the whispers that serenaded his soul. The stone began to echo his heart's unspoken desires, lines shaping into form amidst the rhythm of hammer against stone. Yet, as his vision took shape, the world outside stirred with the noise of criticism, challenging the purity of his intent. Steeling himself against doubt, Marcus let each strike reaffirm his commitment to the creative journey. As time breathed life into stone, he found his hand guided not by force, but a synchrony with the essence of the marble. The sculpture emerged—a figure both haunting and graceful, transcending Marcus's own expectations. In letting it unveil itself, Marcus recognized his creation lived beyond him, a testament to the quiet power of realized potential.",
        "lines_in_context": {
          "6": {
            "name": "Transcendence Unleashed",
            "meaning": "The sculpture is complete, resonating beyond Marcus's vision, influencing those who behold it.",
            "changing": "If yang changes to yin, Marcus's reluctance to release control prevents the sculpture from achieving its full impact."
          },
          "5": {
            "name": "Mastery at the Apex",
            "meaning": "Marcus attains the peak of his craft, symbiotically shaping stone and spirit.",
            "changing": "If yang changes to yin, overconfidence may lead to a disconnect between intention and outcome."
          },
          "4": {
            "name": "The Dance with Reality",
            "meaning": "Marcus aligns his internal vision with the marble, finding a shared rhythm that propels his art forward.",
            "changing": "If yin changes to yang, Marcus risks imposing willful designs that disrupt the natural evolution of his art."
          },
          "3": {
            "name": "Conflict of Critique",
            "meaning": "The world challenges Marcus's creative intent, threatening to disrupt his silence-crafted harmony.",
            "changing": "If yang changes to yin, yielding to external pressures might halt the realization of his artistic vision."
          },
          "2": {
            "name": "Initial Carving of Potential",
            "meaning": "Marcus embarks on the delicate journey of chiseling his raw potential into form.",
            "changing": "If yin changes to yang, rushing could fracture the equilibrium, resulting in unintentional dissonance."
          },
          "1": {
            "name": "Silent Symphony",
            "meaning": "The uncut marble echoes with the nascent potential of creation, yet awaits the sculptor's touch.",
            "changing": "If yang changes to yin, hesitation in beginning may lead the potential to remain dormant."
          }
        }
      }
    ]
  },
  "history": {
    "title": "Gandhi's Salt March",
    "subtitle": "\"Penetration\" in History",
    "short_story": "On March 12, 1930, Mahatma Gandhi began a seemingly simple act of protest that would ultimately help bring down the British Empire in India. Rather than calling for violent rebellion or grand political actions, he chose to challenge British authority by walking 240 miles to the sea to make salt. The British Salt Act prohibited Indians from collecting or selling salt, forcing them to buy the essential mineral from the British at a heavily taxed price. Gandhi's march demonstrated the power of gentle but persistent influence - each step forward gathered more followers, each day brought more attention to the cause. The British initially dismissed the action as trivial, but as Gandhi walked, the protest penetrated deeper into the national consciousness. By the time he reached the sea on April 6, tens of thousands were following him, and the march had inspired acts of civil disobedience across India. When he finally picked up a small handful of salt from the ocean, breaking the law in the gentlest way possible, the act resonated throughout the Empire. The Salt March demonstrated how non-violent resistance, like a persistent wind, could wear away at even the strongest structures of power.",
    "source": [
      "\"Gandhi: The Years That Changed the World, 1914-1948\" by Ramachandra Guha (Alfred A. Knopf, 2018)"
    ],
    "lines_in_history": {
      "6": {
        "name": "Completion and Refinement",
        "meaning": "Line 6 (Yin ⚋) signifies the completion of a cycle, surrender to change, or the refinement of experiences. It represents closure and acceptance. If Yang replaces Yin, resistance to closure or clinging to power might be observed.",
        "changing": "Resistance to closure or an unwillingness to let go, as indicated by the change from Yin to Yang, can hinder the process of completion and refinement, potentially leading to prolonged states of transition."
      },
      "5": {
        "name": "Full Engagement and Leadership",
        "meaning": "Line 5 (Yang ⚊) embodies full engagement, leadership, and the actualization of potential. It represents authority and decisive action. If Yin replaces Yang, indecision or incomplete realization of the vision may occur.",
        "changing": "The shift from Yang to Yin in this line may introduce elements of doubt, indecision, or a lack of full realization, impacting the leadership qualities and the manifestation of potential."
      },
      "4": {
        "name": "Alignment with External Forces",
        "meaning": "Line 4 (Yin ⚋) prepares for action by aligning with external influences. It signifies the readiness to engage with external circumstances. If Yang replaces Yin, premature external assertion might be made before stability is established.",
        "changing": "Premature external assertion due to the shift from Yin to Yang can result in actions taken out of sync with the environment, leading to potential challenges in establishment."
      },
      "3": {
        "name": "Transition to External Action",
        "meaning": "Line 3 (Yang ⚊) marks the culmination of the inner process and the shift towards external action. It signifies readiness for outward expression. If Yin replaces Yang, hesitation in externalizing realizations may occur.",
        "changing": "As the line transitions from Yang to Yin, there may be a delay in manifesting internal realizations into action, potentially leading to stagnation or missed opportunities."
      },
      "2": {
        "name": "Alignment and Formation",
        "meaning": "Line 2 (Yin ⚋) represents support and structuring of potential. It signifies alignment and integration. If Yang replaces Yin, premature action or struggle to integrate may arise.",
        "changing": "The premature action or struggle to integrate may disrupt the harmonious alignment and support that characterize the line's natural state."
      },
      "1": {
        "name": "Emergence of Potential",
        "meaning": "Line 1 (Yang ⚊) marks the initial stage where potential begins to take form. It signifies the birth of potential and an initiating force. If Yin replaces Yang, it suggests a lack of readiness or hesitation.",
        "changing": "Weakness, hesitation, or unpreparedness may hinder the emergence of potential as the line's energy changes from Yang to Yin."
      }
    }
  },
  "trigram_phrase": {
    "Jungian": "The harmonious synthesis of enduring influence and omnipresent adaptability crystallizes through the delicate dance of subtlety and constancy.",
    "Platonic": "The result of Steadfast Subtlety and Enduring Influence reveals itself through steadfast subtlety and enduring influence.",
    "Taoist": "Through the soft and all-encompassing currents, the quiet strength and transformative essence of the Way reveal themselves.",
    "Tholonic": "In the dance of Gentle Penetration, its true nature is revealed through the harmonious exchange of delicate influence and the art of gradual infusion.",
    "Thermodynamics": "The essence of Gentle Penetration emerges as an equilibrium of subtle and pervasive influence, mirroring the intrinsic dynamics of a continuous gentle force within the thermodynamic system.",
    "general": "The essence of Gentle Penetration is a harmonious blend of subtle influence and enduring adaptability.",
    "explanation": "The lower trigram, representing Gentle and Penetrating, embodies subtle influence and adaptability. The upper trigram, also Gentle and Penetrating, reinforces this with constancy and transformation. Together, they create a balance where gentle forces gradually and persistently permeate, reflecting a unified essence of subtle influence and enduring adaptability."
  },
  "line_type": [
    "───",
    "───",
    "─ ─",
    "───",
    "───",
    "─ ─"
  ],
  "pairpath": {
    "title": "Shock and Influence",
    "ascending_hex_num": 51,
    "ascending_hex_name": "Shock",
    "descending_hex_num": 57,
    "descending_hex_name": "Gentle Penetration",
    "description": "The path of transformation through sudden change and gradual influence. Shock initiates a powerful awakening, while Gentle Penetration sustains and deepens the transformation through subtlety and persistence.",
    "kstate": "dynamic",
    "image_prompt": "A powerful storm with lightning striking a serene forest, where the wind gently sways the trees, symbolizing the dynamic interplay of sudden change and subtle influence.",
    "path_num": 19
  }
}