{
    "id": 10,
    "hexagram_code": "䷉",
    "name": "Potential",
    "description": "The dynamic state of unrealized power. Like a tiger observing its surroundings before acting, this represents latent energy awaiting the right moment for expression.",
    "king_wen": {
        "sequence": 10,
        "traditional_title": "Lü",
        "common_title": "Treading"
    },
    "binary_sequence": 59,
    "trigrams": {
        "above": {
            "Trigram Number": 1,
            "Binary Decimal": 7,
            "Symbol": "☰",
            "Chinese Symbol": "乾",
            "Phonetic": "Qián",
            "English Translation": "Heaven",
            "English Symbol": "天",
            "Meaning": "The Creative",
            "Quality": "Strong and Creative"
        },
        "below": {
            "Trigram Number": 8,
            "Binary Decimal": 4,
            "Symbol": "☱",
            "Chinese Symbol": "兑",
            "Phonetic": "Duì",
            "English Translation": "Lake/Marsh",
            "English Symbol": "泽",
            "Meaning": "The Joyous",
            "Quality": "Joyful and Harmonious"
        }
    },
    "attributes": {
        "perspective": "Power held in check by awareness",
        "nature": "Contained strength",
        "action": "Mindful conduct",
        "success_through": "Disciplined restraint of power",
        "challenge": "Maintaining control while possessing strength"
    },
    "lines": [
        {
            "position": 6,
            "name": "Transcendent Completion",
            "meaning": "The cycle of potential reaches its culmination, symbolizing wisdom achieved through the full evolution of energy.",
            "changing": "At this pinnacle, the transformative process is complete, with no further shift from yin to yang required."
        },
        {
            "position": 5,
            "name": "Radiant Ascendancy",
            "meaning": "The apex of potential is near as the essence of purpose fully emerges to illuminate the path with clarity and strength.",
            "changing": "The transformation reaches a peak, with latent energies converting entirely to dynamic, visible manifestation."
        },
        {
            "position": 4,
            "name": "Rising Momentum",
            "meaning": "Accumulated energy surmounts internal resistance, opening new avenues for growth and forward movement.",
            "changing": "A merging of energies transforms stability into active momentum, with yin gradually yielding to yang vitality."
        },
        {
            "position": 3,
            "name": "Burgeoning Initiative",
            "meaning": "Dynamic energy starts to assert itself, signifying that the initial phase of potential is ready to test its limits.",
            "changing": "A notable change unfolds, where inner softness rearranges into a more assertive, yang-driven force."
        },
        {
            "position": 2,
            "name": "Gentle Sprout",
            "meaning": "Early signs of growth emerge quietly, suggesting potential that is delicate yet promising.",
            "changing": "A measured transformation occurs, with soft yin energies transitioning into a fragile yang presence."
        },
        {
            "position": 1,
            "name": "Dormant Seed",
            "meaning": "A nascent spark of possibility lies hidden, awaiting the nurturing forces that can awaken its latent energy.",
            "changing": "A subtle internal shift begins as the dormant essence stirs toward expression."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the negotiation between powerful force (Qian/Heaven) and joyful expression (Dui/Lake). This creates a dynamic balance between strength and restraint.",
        "limitation": "Structure is provided by heaven above, indicating that power must be guided by higher principles. The lake below suggests that expression must be contained.",
        "contribution": "This pattern contributes to evolution by demonstrating how controlled power leads to sustainable progress. It shows how awareness guides force.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents the point where power meets conscious restraint. It demonstrates how awareness can guide potential into proper expression."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on maintaining disciplined conduct. Success comes through careful management of power rather than its release.",
        "all_moving_lines": "A complete transformation in how potential is handled is indicated. Old patterns of restraint must give way to new forms of control. Ensure that power remains guided while embracing change."
    },
    "hierarchy": {
        "order8child": "Mindful progress",
        "order8parent": "EARLY DEVELOPMENT; Building Structure"
    },
    "image": {
        "description": "The image embodies the hexagram \"Potential\" by illustrating the intricate interplay between latent energy and disciplined restraint. The central motif of a dynamic, yet contained, structure represents the universal patterns of potential energy held in check by conscious awareness. This reflects a hierarchy where the potential for action is balanced by mindful control, akin to a carefully calibrated machine. The triadic relationship is visible in the interaction between the flames of possibility, the structural elements of order, and the fluid chaos of clouds, demonstrating how emergence arises from this balance. Through the interplay of these components, the image captures how awareness guides force, embodying the emergence of order from chaos, and the evolution of restrained power into sustainable progress.",
        "file": "10.png"
    },
    "energy_cycle": "descending",
    "stories": {
        "title": "Three Tales of \"Potential\"",
        "entries": [
            {
                "title": "The Sculptor's Vision (Man vs. Man)",
                "theme": "Gabriel García Márquez",
                "short_story": "In the land of verdant peaks and swirling mists, a sculptor named Elian lived with visions unspoken. His hands itched to carve the mountain that loomed over his village, to bring forth the face he saw in dreams. When he confided in the village elder, she only cautioned about the mountain's sacred nature.\n\nUnperturbed, Elian began, his chisel tapping against stone. His work progressed until whispers reached the ears of the villagers, inciting fear and envy. They demanded he halt his desecration.\n\nElian retreated to gather his thoughts, but determination spurred him on. He saw the potential for beauty that others could not, and as his craft coalesced, the mountain's form revealed itself.\n\nHis creation not only depicted a face but drew essence from the mountain’s spirit. Tranquility enveloped the valley, and the villagers, seeing its beauty, relented.\n\nAt the summit of his journey, Elian's masterpiece stood complete; no longer his alone, it became part of the land, transcending its origin.\n\nHe released his claim over it, knowing his vision achieved something greater than personal triumph. It changed all who beheld it, having transcended the boundary separating creator and creation.",
                "lines_in_context": {
                    "6": {
                        "name": "Release and Transcendence",
                        "meaning": "Elian's masterpiece transcends personal ownership, altering the world beyond its creator's original vision.",
                        "changing": "If Yang changes to Yin, it signifies personal resistance to releasing control, which would stifle further evolution."
                    },
                    "5": {
                        "name": "Command of Creation",
                        "meaning": "Elian takes full mastery of his art, bringing his vision to fruition at the peak of his creative power.",
                        "changing": "If Yang changes to Yin, arrogance or misjudgment might undermine his successful realization."
                    },
                    "4": {
                        "name": "Vision Manifested",
                        "meaning": "Elian aligns his internal vision with the mountain's essence, gaining momentum as his creation takes shape.",
                        "changing": "If Yin changes to Yang, overly ambitious expansion risks losing sight of the sustainable path."
                    },
                    "3": {
                        "name": "Confrontation of Fear",
                        "meaning": "Elian faces opposition from villagers who embody external fears threatening his creative endeavor.",
                        "changing": "If Yang changes to Yin, retreat or exhaustion could prematurely halt his progress."
                    },
                    "2": {
                        "name": "Shaping Potential",
                        "meaning": "Elian begins to carve through initial resistance, refining his raw potential into a definable path.",
                        "changing": "If Yin changes to Yang, premature action can lead to instability and deviation from his vision."
                    },
                    "1": {
                        "name": "Spark of Creation",
                        "meaning": "The initial stirrings of Elian's vision fill him with untapped potential and a longing to express.",
                        "changing": "If Yang changes to Yin, it suggests hesitation or a failure to act, delaying his creative impulse."
                    }
                }
            },
            {
                "title": "The Ascension of Argo (Man vs. Nature)",
                "theme": "Ray Bradbury",
                "short_story": "On the isolated plains of Mars, Engineer Argo crafted an aeroship, longing to touch the Martian skies with human ingenuity. Yet, challenges abounded; resources were scarce, and the unstable Martian winds threatened every test flight. This was not just a venture into air; it was a battle with the planet itself. Determination burned within Argo, igniting dreams of flight. Each iteration of the ship brought him closer, shaping raw ideas into tangible form. Skeptics surrounded him, urging caution, fears of collapse prevalent. Yet Argo listened to Mars' whisper, aligning his plans with the natural rhythms.\n\nSlowly, the aeroship began to take shape, casting shadows of promise on the red sands. It was more than human ambition; it was Mars itself speaking through his creation. As the aeroship ascended one dawn, Argo grasped mastery, feeling one with the machine and the Martian elements. The world watched as the ship soared, leaving the rooftops of its origins. Thus, his creation became a symbol not only of engineering triumph but a testament to humanity's ability to harmonize with the universe.\n\nNo longer belonging to Argo alone, it embodied the spirit of exploration and the unyielding dance between nature and creation.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendental Achievement",
                        "meaning": "Argo's aeroship reaches its final form, symbolizing unity between human innovation and Martian nature.",
                        "changing": "If Yang changes to Yin, it indicates an unwillingness to release control, thereby stifling further evolution."
                    },
                    "5": {
                        "name": "Command of Elemental Forces",
                        "meaning": "Argo harnesses the elements to ascend to new heights, fully realizing the project.",
                        "changing": "If Yang changes to Yin, a misjudgment could jeopardize his achievements, causing a potential fall from grace."
                    },
                    "4": {
                        "name": "Harmonious Alignment",
                        "meaning": "His creation aligns perfectly with Martian winds, capturing their energy for lift and propulsion.",
                        "changing": "If Yin changes to Yang, excessive ambition may lead to an unstable expansion and potential failure."
                    },
                    "3": {
                        "name": "Challenge of Adversity",
                        "meaning": "External elements and internal doubts challenge Argo's commitment to flight.",
                        "changing": "If Yang changes to Yin, withdrawal or fatigue could delay or halt progression."
                    },
                    "2": {
                        "name": "Initial Formation",
                        "meaning": "Beginnings of the ship take shape, determining the practical path towards the skies.",
                        "changing": "If Yin changes to Yang, premature actions could cause misalignments and setbacks."
                    },
                    "1": {
                        "name": "Spark of Innovation",
                        "meaning": "The initial idea of the aeroship fills Argo with the potential yet to be realized.",
                        "changing": "If Yang changes to Yin, hesitation or reluctance might delay the process of creation."
                    }
                }
            },
            {
                "title": "The Sculptor of Dreams (Man vs. Self)",
                "theme": "Haruki Murakami",
                "short_story": "In a quiet town, Aiko, a reclusive sculptor, felt the stirring of an inexplicable urge. This raw potential, like a voice whispering in the wind, beckoned her to create. She locked herself in her dimly lit studio, surrounded by unblemished clay. Her hands trembled as they hovered over the material, unsure of what form the silent whispers would take. As weeks passed, Aiko began shaping her dreams into tangible forms, coaxing the clay into life under the weight of her visions. With each touch, she fought the entropic forces that sought to dissolve her fragile creations back into chaos. The tangible manifestation of her innermost thoughts unfolded slowly, and Aiko cherished the quiet power within her growing sculptures. In the rhythm of her work, she found harmony, alignment with the universe's subtle flow, until at last, she gazed upon her completed masterpiece. Yet, even as she stepped back to appreciate its fullness, she realized that creation had transcended her solitary existence—a beacon of imagination that would inspire far beyond the confines of her studio. She relinquished personal ownership, acknowledging that true beauty lies in what we release, not possess.",
                "lines_in_context": {
                    "6": {
                        "name": "Release and Transcendence",
                        "meaning": "Aiko finishes her creation, transcending personal attachment, allowing the artwork to live independently.",
                        "changing": "If Yang changes to Yin, it indicates clinging to her creation, stunting its potential to inspire openly."
                    },
                    "5": {
                        "name": "Mastery and Command",
                        "meaning": "Aiko achieves full mastery of her sculpting, allowing her vision to reach its fullest expression.",
                        "changing": "If Yang changes to Yin, arrogance or errors in judgment risk undermining her artistic achievement."
                    },
                    "4": {
                        "name": "Harmonious Manifestation",
                        "meaning": "Her creation finds a balance, her vision aligning seamlessly with the artistic reality.",
                        "changing": "If Yin changes to Yang, her ambitions may overextend, disrupting the harmony of her work."
                    },
                    "3": {
                        "name": "Conflict and Resistance",
                        "meaning": "Aiko confronts external challenges and internal doubts threatening to derail her progress.",
                        "changing": "If Yang changes to Yin, retreat or exhaustion could prevent the fulfillment of her creation."
                    },
                    "2": {
                        "name": "Formation and Barriers",
                        "meaning": "Early obstacles test Aiko's resolve, helping to shape the initial path of her potential.",
                        "changing": "If Yin changes to Yang, premature actions could lead to turbulence and deviation from her vision."
                    },
                    "1": {
                        "name": "Emergence of Potential",
                        "meaning": "Aiko feels the initial surge of creative force, unshaped and yearning for direction.",
                        "changing": "If yang changes to yin, it suggests hesitation or failure to act on her creative impulse."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "Lincoln's First Inaugural Response",
        "subtitle": "\"Potential\" in History",
        "short_story": "In March 1861, when seven Southern states had already seceded and civil war seemed inevitable, Abraham Lincoln delivered his first inaugural address from a position of immense but precarious power. As the newly-installed President, he commanded the nation's military might, yet understood that an aggressive display of force would likely trigger immediate conflict.\n\nInstead of threatening the South or making a show of federal power, Lincoln chose a path of measured restraint. His address carefully balanced firmness with conciliation, famously concluding \"We are not enemies, but friends... Though passion may have strained, it must not break our bonds of affection.\"\n\nEven as he assured the South that he had no intention to interfere with slavery where it existed, he made clear his constitutional duty to preserve the Union. When he did mention federal power, it was with careful precision: \"Beyond what may be necessary for these objects, there will be no invasion, no using of force against or among the people anywhere.\"\n\nThis masterful display of controlled strength - showing power while choosing when and how to use it - exemplifies the essence of treading carefully while possessing great force. Though war eventually came, Lincoln's measured approach helped secure crucial border states and demonstrated to the world that the Union sought peace while possessing the strength for war.",
        "source": [
            "\"Lincoln's First Inaugural Address\" (1861)",
            "\"Team of Rivals: The Political Genius of Abraham Lincoln\" by Doris Kearns Goodwin (2005)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Return, Closure, Refinement",
                "meaning": "Signaling the closure of the cycle, this stage embraces surrender to change, refinement of experience, and the preparation for renewal.",
                "changing": "If this line's Yin changes to Yang, it could suggest resistance to closure, clinging to power, or the prolongation of a phase that has reached its completion."
            },
            "5": {
                "name": "Manifestation of Leadership",
                "meaning": "Taking on a role of full engagement, this stage embodies leadership and execution, guiding the vision towards realization.",
                "changing": "When Yang changes to Yin in this line, it may indicate indecision, loss of authority, or an incomplete realization of the intended vision."
            },
            "4": {
                "name": "Emergence in External Realm",
                "meaning": "Aligned with external forces, this stage prepares for action in the outer world, setting the groundwork for further manifestation.",
                "changing": "If a changing line alters from Yin to Yang, it could imply premature external assertion before stable conditions are established."
            },
            "3": {
                "name": "Completion and Transition",
                "meaning": "Reaching the culmination of the inner cycle, a transition to external action is marked, signifying readiness to embody transformation.",
                "changing": "A change where Yin replaces Yang suggests hesitation in externalizing realizations or potential stagnation at the brink of change."
            },
            "2": {
                "name": "Formation of Harmony",
                "meaning": "As the process unfolds, support and alignment structures the potential, paving the way for materialization and manifestation.",
                "changing": "When the line's Yang changes to Yin, it may indicate premature action, instability, or struggle to integrate the forming structure."
            },
            "1": {
                "name": "Emergence of Potential",
                "meaning": "At the beginning of this transformation, the potential for change is birthed, signaling the initiation of a crucial process.",
                "changing": "If the line's Yin changes to Yang, it signifies hesitation, weakness, or unreadiness in embracing the emerging potential."
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "Within the serene joy of the lake lies the archetypal embrace of the celestial, where the transcendent creative force of heaven molds and directs the soul's journey.",
        "Platonic": "The manifestation of harmonious joy is orchestrated and uplifted by the creative essence of strength.",
        "Taoist": "Joyful Harmony emerges and ascends on the stream of Creative Strength's flowing power.",
        "Tholonic": "The bloom of harmonious joy manifests through the vibrant and imaginative essence of potency.",
        "Thermodynamics": "The manifestation of harmonious joy emerges as entropy is reduced within the dynamic interplay of potent creative energy.",
        "general": "Joyful harmony is guided and uplifted by the strength of creative energy.",
        "explanation": "The lower trigram, 'The Joyous,' symbolizes joy and harmony, while the upper trigram, 'The Creative,' represents strength and creativity. Together, they suggest that a state of joyful harmony is achieved when it is supported and elevated by a strong, creative force, aligning with the synthesis of Jungian, Platonic, Taoist, Tholonic, and thermodynamic perspectives."
    },
    "line_type": [
        "───",
        "───",
        "───",
        "─ ─",
        "───",
        "───"
    ]
}