{
    "id": 12,
    "hexagram_code": "䷋",
    "name": "Stagnation",
    "description": "The state of blockage that arises when expansion meets resistance. Like heaven's energy blocked by earth, this represents the temporary cessation of flow that precedes necessary transformation.",
    "king_wen": {
        "sequence": 12,
        "traditional_title": "P'i",
        "common_title": "Standstill"
    },
    "binary_sequence": 56,
    "trigrams": {
        "above": {
            "Trigram Number": 1,
            "Binary Decimal": 7,
            "Symbol": "☰",
            "Chinese Symbol": "乾",
            "Phonetic": "Qián",
            "English Translation": "Heaven",
            "English Symbol": "天",
            "Meaning": "The Creative",
            "Quality": "Strong and Creative"
        },
        "below": {
            "Trigram Number": 2,
            "Binary Decimal": 0,
            "Symbol": "☷",
            "Chinese Symbol": "坤",
            "Phonetic": "Kūn",
            "English Translation": "Earth",
            "English Symbol": "地",
            "Meaning": "The Receptive",
            "Quality": "Receptive and Nurturing"
        }
    },
    "attributes": {
        "perspective": "Creative force meeting resistance, necessitating reassessment",
        "nature": "Obstructing",
        "action": "Strategic withdrawal",
        "success_through": "Understanding and accepting temporary limitations",
        "challenge": "Maintaining patience while seeking new pathways"
    },
    "lines": [
        {
            "position": 6,
            "name": "The Final Awakening",
            "meaning": "In the culmination of the stagnation cycle, the old state of inertia is left behind. This line signifies a full awakening where transformation brings a new, active phase of existence.",
            "changing": "The process is complete when the potent yang fully emerges, overtaking what was once static yin, and heralding a rebirth that propels forward momentum."
        },
        {
            "position": 5,
            "name": "The Quiet Turning",
            "meaning": "At this stage, the accumulated stillness reaches a turning point. The energy of restraint finds its expression as wisdom and life force begin to merge, indicating an imminent change.",
            "changing": "There is a graceful conversion as yin, having matured through quiet endurance, transitions into the dynamic vigor of yang, setting the stage for renewal."
        },
        {
            "position": 4,
            "name": "The Crossroads of Doubt",
            "meaning": "This line presents a moment of choice amid uncertainty. Standing at the threshold of stagnation, the seeker must decide to either remain in inertia or step forward with clarity of purpose.",
            "changing": "The transformation here is marked by an emerging yang decisiveness which begins to dissolve the grip of lingering yin hesitation."
        },
        {
            "position": 3,
            "name": "The Barrier's Reflection",
            "meaning": "Encountering obstacles within stagnation leads to introspection and self-assessment. This line emphasizes that reflection on blockages is essential for unlocking hidden reserves.",
            "changing": "Within the mirror of difficulty, the suppressed yang sparks an awakening, ready to challenge and break through the impasse."
        },
        {
            "position": 2,
            "name": "The Garden of Reserve",
            "meaning": "Amid the inertia of sustained stagnation, this line invites the cultivation of inner virtues. It symbolizes a space where patience and restraint nurture latent power.",
            "changing": "The concentrated yin energy, when carefully tended, gathers strength and begins its transformation toward a more dynamic, yang quality."
        },
        {
            "position": 1,
            "name": "The Bud of Stillness",
            "meaning": "In the quiet beginnings of stagnation, potential lies dormant, like a bud waiting to bloom. This line suggests that though movement is not yet apparent, inner capabilities are preparing for future expression.",
            "changing": "A subtle shift occurs as latent yang energy peeks through the calm yin, promising the initiation of growth."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the negotiation between containing forces (Kun/Earth) and expansive energy (Qian/Heaven). This creates a dynamic tension between movement and resistance, like pressure building in a closed system.",
        "limitation": "Structure is provided by the earth above, indicating complete but temporary containment. The heaven below suggests that creative force remains active but currently constrained.",
        "contribution": "This pattern contributes to evolution by demonstrating how periods of apparent stagnation can lead to transformation. It shows how resistance can build pressure for breakthrough.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents the point where energy meets maximum resistance, creating potential for transformation. It demonstrates how consciousness can work with obstruction to create new pathways."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on patient endurance and internal development. Success comes through accepting current limitations while preparing for future movement.",
        "all_moving_lines": "A complete transformation in how obstruction is experienced is indicated. Old patterns of resistance must give way to new forms of flow. Ensure that patience remains while embracing change."
    },
    "hierarchy": {
        "order8child": "Necessary pause",
        "order8parent": "EARLY DEVELOPMENT; Building Structure"
    },
    "image": {
        "description": "The image of a dammed river symbolizes Hexagram 12, \"Stagnation,\" capturing the moment of necessary pause where movement is temporarily halted to allow for reflection and realignment. The stillness of the water reflects the tholonic concept of limitation, where boundaries create a space for contemplation and restructuring. The reflective and intricate style emphasizes the layered complexities of stagnation, revealing hidden depths beneath the surface. The medium of ink on vellum enhances the image's timeless quality, underscoring the enduring importance of pauses in the flow of development. Edgar Degas, known for his attention to subtle details and introspective compositions, brings depth and nuance to this portrayal, making it a profound representation of the necessary stillness before renewal.",
        "file": "12.png"
    },
    "energy_cycle": "descending",
    "stories": {
        "title": "Three Tales of \"Stagnation\"",
        "entries": [
            {
                "title": "The Artisan's Dilemma (Man vs. Man)",
                "theme": "Herman Melville",
                "short_story": "In the bustling wharf of a 19th-century port town, Elias, a gifted yet obscure craftsman, dreamed of creating a wooden sloop that could defy the ocean's fury. Though haunted by visions of maritime glory and led by an inner fire, he found his hands hesitating on the freshly cut timbers (Emergence). The townsfolk, pragmatic and skeptical, deemed such ambition folly, whispering that no local craftsman could finish such an endeavor.\n\nUndeterred, Elias set about shaping the keel and ribs, his mind aflame with blueprints and promise (Formation). But challenges arose—a storm shredded the first sails sewn, and funds dwindled, embodying the grating sting of reality against his dreams (Conflict). Plunging into despair, Elias longed for the established path he had forsaken.\n\nDriven by renewed determination, he recalibrated his plans, drawing strength from the elemental nature of wood and wind (Manifestation). Slowly, the sloop took form beneath his hands, balanced between the wisdom of the old and his undying convictions. As he stood upon the nearly completed deck, Elias marveled at his creation (Mastery), aware yet vigilant of the burgeoning pride that claimed his heart.\n\nSending the sloop to sea, he released his vision to the world, relinquishing control over what it would become (Transcendence). Yet, unyielding within, his spirit whispered of new voyages to come.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "Elias's creation reaches completion and independence, affecting the world beyond himself.",
                        "changing": "Clinging to control rather than releasing it, Elias risks stalling the evolution of his creation."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Elias stands at the pinnacle of his craft, in full command of his creation.",
                        "changing": "Pride or overconfidence may lead to misjudgments, potentially undermining his success."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "Elias brings his refined vision to tangible form, harmonizing plans with reality.",
                        "changing": "Overreaching ambition could lead to an unstable or unsustainable expansion."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Elias faces direct opposition and challenges, threatening his progress.",
                        "changing": "A retreat from these challenges or giving in to exhaustion prevents realization."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Elias begins shaping his ideas into a defined path, encountering initial barriers.",
                        "changing": "Premature action may lead to instability and misalignment with natural forces."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "Elias experiences the first stirrings of creative potential, filled with possibility yet lacking direction.",
                        "changing": "Hesitation or failure to act delays the emergence and growth of his vision."
                    }
                }
            },
            {
                "title": "The Mountain and the Lark (Man vs. Nature)",
                "theme": "Gabriel Garcia Marquez",
                "short_story": "Once upon the grandeur of the Andes, a solitary peak stood untouched by any sound but the soft whisper of the wind and the rare cry of a lonesome lark that drifted from the vales below. The mountain breathed dreams of song, yearning for a melodious essence ingrained within its stony heart but dormant like a chrysalis amid the silence (Emergence). As time unfurled, that yearning took shape, spurring the lark to venture, weaving tunes among the high cliffs, shaping the vista with the thread of echoes it sang (Formation).\n\nAt dusk, a tempest descended, hurling pebbles of discord against the clouds, a symphony of chaos rendering the lark's song mute (Conflict). Undeterred, the lark persisted, weaving its voice through the storm's roar, refining its melody to harmonize with the thunder, each note honed and clear (Manifestation).\n\nAt dawn, the tempest lay vanquished by its own fury, and the lark's song soared, the mountain in totality resonating with the light (Mastery). Thus, the mountain and its lark became one, their melody everlasting, a testament to endurance—that creation, once born, belongs not to its originator but the world itself (Transcendence).",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "The lark's song becomes a part of the mountain, existing beyond its initial purpose and breathing new life into the landscape.",
                        "changing": "If yang changes to yin, the lark may become too attached to its song, failing to let go and share it with the world."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "The peak of harmony between the lark's song and the mountain, where both resonate together.",
                        "changing": "If yang changes to yin, it represents potential arrogance or missteps that could disrupt the achieved balance."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "The refinement of the lark's melody, now harmonizing with the environmental forces surrounding it.",
                        "changing": "If yin changes to yang, it suggests an overly ambitious melody, disrupting the harmony with its surroundings."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Challenges from the natural world threaten to silence the emerging song.",
                        "changing": "If yang changes to yin, it implies a retreat from the chaos, resulting in a loss of progress."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "The lark's first venture to stretch its song across the mountain, encountering initial obstructions.",
                        "changing": "If yin changes to yang, it suggests actions taken too early could lead to discordant results."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "The dormant potential of song lies within the peak, yearning for form but lacking direction.",
                        "changing": "If yang changes to yin, it shows reluctance or inactivity, delaying the birth of melody."
                    }
                }
            },
            {
                "title": "The Visionary's Dilemma (Man vs. Self)",
                "theme": "Virginia Woolf",
                "short_story": "In the heart of a silent attic, Eleanor sat surrounded by blank canvases, her mind a tempest of unformed visions hovering just beyond reach. The room was dim, save for a shard of light revealing the dust's slow dance in the air. Here, in this sanctum, the echoes of her father's voice, urging practicality over passion, clashed with her deep yearning to paint, to capture light itself (Emergence). She unfurled the first canvas, the white expanse daunting in its purity. Yet, within her heart, there was resolve, an internal whisper that urged her to begin, sketching lines that felt both alien and familiar (Formation). Obstacles swiftly mounted. The paint, mocking her intentions, subtle wars akin to the struggle between necessity and desire (Conflict). Days turned to restless nights as Eleanor wrestled with her art's direction, a candle flickering in the twilight of doubt (Manifestation). But then, unlike any dawn before, clarity pierced her, guiding each brush stroke with a grace forged from struggle. The canvas came alive, a dance of color and shadow that spoke of dreams and mysteries (Mastery). And finally, with trembling hands, she stepped back—her creation no longer hers but a vibrant testament to her journey, its existence now a narrative shared with the world (Transcendence).",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "Eleanor's creation moves beyond her to join the world, reflecting both her journey and universal truths.",
                        "changing": "If she clings too tightly, her art remains stagnant, unable to breathe its own life."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Eleanor reaches the zenith of her creativity, her work mirroring her internal peace and mastery.",
                        "changing": "Arrogance or missteps can unravel her creation's newfound harmony."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "Her vision gains momentum, aligning dreams with the tactile reality of her art.",
                        "changing": "If ambition clouds perspective, her work risks becoming overextended and unstable."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Adversity challenges Eleanor's dedication, testing her resolve and direction.",
                        "changing": "Yielding to exhaustion will halt the process, burying potential before fruition."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Eleanor's potential takes tentative form amid initial struggles, shaping her creative path.",
                        "changing": "Actions taken too soon breed discord, disrupting natural artistic evolution."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "Eleanor harbors raw creative potential, waiting for courage to mold her visions.",
                        "changing": "Hesitation causes stagnation, delaying her journey's commencement."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "The Preservation of Knowledge Through Medieval Stagnation",
        "subtitle": "\"Stagnation\" in History",
        "short_story": "During the European Dark Ages (500-800 CE), when Roman civilization had collapsed and cultural progress seemed to have ground to a halt, Irish monasteries engaged in a remarkable act of preservation. While continental Europe descended into chaos and illiteracy, Ireland's isolated position and stable monastic system allowed it to serve as a vault for classical knowledge.\n\nAs Europe stagnated, Irish monks methodically copied and preserved classical texts, both religious and secular. These monasteries became islands of literacy in a sea of darkness, maintaining not just books but the very practice of scholarship itself. The monks developed their distinctive insular script and elaborate illumination techniques during this period of apparent cultural standstill.\n\nWhat seemed like intellectual stagnation was actually a period of crucial incubation. When the Carolingian Renaissance began in the late 8th century, these preserved texts and scholarly traditions flowed back into Europe through Irish missionary scholars. The manuscripts that had been so carefully maintained during the dark years became the seeds of medieval learning.\n\nhis period demonstrates how apparent stagnation can mask vital preservation and preparation. The Irish monasteries didn't fight against the darkness of their times but used it as an opportunity for careful, methodical work that would later prove crucial for European civilization's renewal.",
        "source": [
            "How the Irish Saved Civilization by Thomas Cahill (1995)",
            "The Medieval Book by Barbara A. Shailor (1991)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Completion and Dissemination",
                "meaning": "Signifying the conclusion of a transformative cycle, surrendering to change and ensuring the refined preservation of classical knowledge.",
                "changing": "If the line's value changes to its opposite, it may indicate resistance to closure, clinging to outdated practices, or extending preservation efforts beyond their natural course."
            },
            "5": {
                "name": "Manifestation of Revitalization",
                "meaning": "Engagement in the revival of learning, leading with authority and executing the potential for educational renewal.",
                "changing": "When the line's value changes to its opposite, it could indicate indecision, loss of authority, or incomplete realization of the vision for cultural rejuvenation."
            },
            "4": {
                "name": "Emergence of Enlightenment",
                "meaning": "Alignment with the external world, preparing for the dissemination of preserved knowledge and the renaissance of learning.",
                "changing": "If the line's value changes to its opposite, it may suggest premature external assertion or instability in laying the groundwork for intellectual revival."
            },
            "3": {
                "name": "Transition to Scholarly Influence",
                "meaning": "Culmination of preservation efforts, transitioning towards external dissemination of scholarly traditions as the seeds of future learning.",
                "changing": "When the line's value changes to its opposite, it suggests hesitation in sharing inner realization outward, or stagnation in progressing towards cultural renewal."
            },
            "2": {
                "name": "Alignment with Tradition",
                "meaning": "Establishing support and alignment with classical knowledge, structuring and preserving wisdom during a time of cultural standstill.",
                "changing": "If the line's value changes to its opposite, it may indicate premature action or struggle to integrate historical insights."
            },
            "1": {
                "name": "Emergence of Preservation",
                "meaning": "The initial stage of vital preservation and preparation, laying the foundation for future transformation. This stage marks the birth of potential in the face of stagnation.",
                "changing": "When the line's value changes to its opposite, it signifies hesitation, weakness, or a lack of readiness in nurturing preservation."
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "The fruition of Earth's nurturing receptivity emerges through the potent creative energy of Heaven.",
        "Platonic": "The fruits of nurturing receptivity are revealed through the dynamic essence of potent creativity, akin to the soul's ascent from shadows to the light of pure forms.",
        "Taoist": "The gentle embrace of receptivity births the vibrant dance of creative strength.",
        "Tholonic": "In the dance of existence, the gentle embrace of nurturing reveals its form through the steadfast power of creative vigor.",
        "Thermodynamics": "The emergence of nurturing receptivity manifests through the assertive energy of creative strength.",
        "general": "The nurturing ground of receptivity allows the rise of creative energy.",
        "explanation": "In 'The Receptive,' the lower trigram symbolizes a nurturing foundation, which supports and enables the upper trigram, 'The Creative,' to express its strong and dynamic energy. This interaction illustrates how a stable and open base can foster the emergence of powerful creative forces, reflecting a harmonious balance between passive support and active creation."
    },
    "line_type": [
        "───",
        "───",
        "───",
        "─ ─",
        "─ ─",
        "─ ─"
    ]
}