{
    "id": 13,
    "hexagram_code": "䷌",
    "name": "Coalition",
    "description": "The power of aligned forces working toward common purpose. Like light and heat uniting in flame, this represents the synergistic effect of different energies combining in harmony.",
    "king_wen": {
        "sequence": 13,
        "traditional_title": "T'ung Jen",
        "common_title": "Fellowship"
    },
    "binary_sequence": 61,
    "trigrams": {
        "above": {
            "Trigram Number": 1,
            "Binary Decimal": 7,
            "Symbol": "☰",
            "Chinese Symbol": "乾",
            "Phonetic": "Qián",
            "English Translation": "Heaven",
            "English Symbol": "天",
            "Meaning": "The Creative",
            "Quality": "Strong and Creative"
        },
        "below": {
            "Trigram Number": 7,
            "Binary Decimal": 5,
            "Symbol": "☲",
            "Chinese Symbol": "离",
            "Phonetic": "Lí",
            "English Translation": "Fire",
            "English Symbol": "火",
            "Meaning": "The Clinging",
            "Quality": "Bright and Radiant"
        }
    },
    "attributes": {
        "perspective": "Creative power guided by shared understanding",
        "nature": "Unifying",
        "action": "Building connections",
        "success_through": "Harmonizing diverse elements",
        "challenge": "Maintaining individual integrity within collective action"
    },
    "lines": [
        {
            "position": 6,
            "name": "The Culmination of Unity",
            "meaning": "The final line signifies the completion of the journey, where the energies of disparate elements fully integrate into a harmonious and dynamic coalition.",
            "changing": "The lingering yin merges seamlessly with yang, achieving a state of balance and ensuring the enduring strength of the alliance."
        },
        {
            "position": 5,
            "name": "Empowered Union",
            "meaning": "The coalition reaches a period of strong collaboration where combined energies forge forward progress and collective empowerment.",
            "changing": "Cooperative yin energy transforms into a robust yang presence, solidifying leadership and unified action."
        },
        {
            "position": 4,
            "name": "Clarity and Reflection",
            "meaning": "A phase for introspection and evaluation as the coalition seeks to understand its core values and refine its purpose. Reflection invites prudent action.",
            "changing": "The reflective qualities of yin gradually infuse into the clarity of yang, turning uncertainty into measured, decisive insight."
        },
        {
            "position": 3,
            "name": "Tension and Discourse",
            "meaning": "A moment of dynamic interplay where disagreements surface, testing the integrity of the coalition. Conflict spurs clarification and the need for deeper dialogue.",
            "changing": "The yielding yin meets assertive yang, creating a pulse of energy that optimizes the balance between challenge and resolution."
        },
        {
            "position": 2,
            "name": "The Bond of Trust",
            "meaning": "A stage marked by the emergence of mutual respect and sincere connections, where individual intentions converge into a collective strength.",
            "changing": "The receptive yin nurtures rising yang, as trust transforms quiet reserves into dynamic, supportive energy."
        },
        {
            "position": 1,
            "name": "The Genesis of Alliance",
            "meaning": "A humble beginning in which the first steps toward a shared purpose are taken. The energy is cautious yet promising, laying a foundation for unity.",
            "changing": "Subtle yin potential begins to stir into nascent yang, marking the initial spark of transformation."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the negotiation between creative force (Qian/Heaven) and clear understanding (Li/Fire). This creates a dynamic balance between power and purpose, like different talents uniting for greater achievement.",
        "limitation": "Structure is provided by the heaven above, indicating that coalitions must serve higher purposes. The fire below suggests that unity must be based on shared understanding and values.",
        "contribution": "This pattern contributes to evolution by demonstrating how different elements can combine for greater effect. It shows how diversity can become strength through proper alignment.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents the point where individual forces consciously combine to create greater impact. It demonstrates how awareness can coordinate various elements into more powerful wholes."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on maintaining and strengthening existing alliances. Success comes through steady cultivation of relationships and shared purpose.",
        "all_moving_lines": "A complete transformation in how cooperation is achieved is indicated. Old forms of alliance must give way to new patterns of collaboration. Ensure that unity remains authentic while embracing change."
    },
    "hierarchy": {
        "order8child": "Basic connections",
        "order8parent": "EARLY DEVELOPMENT; Building Structure"
    },
    "image": {
        "description": "The image of a flame uniting light and heat embodies Hexagram 13, \"Coalition,\" symbolizing the formation of basic connections that bring individuals and elements together in shared purpose. The interplay of glowing warmth and structural lines reflects the tholonic concept of integration, where distinct components merge harmoniously to create greater unity. The collaborative and vibrant style underscores the dynamic interplay of energies, while the medium of acrylic on canvas captures the depth and intensity of this unifying process. Edgar Degas, renowned for his ability to convey subtle relationships and movement, brings life and cohesion to this portrayal, making it a profound representation of coalition as the foundation of collective growth and harmony.",
        "file": "13.png"
    },
    "energy_cycle": "descending",
    "stories": {
        "title": "Three Tales of \"Coalition\"",
        "entries": [
            {
                "title": "The Invisible Architect (Man vs. Man)",
                "theme": "Italo Calvino",
                "short_story": "In a bustling city filled with cacophony and chaos, a silent figure began to weave threads of connection between people. No plans, no blueprints, just a vision of unity that transcended walls and silences. The Architect, as he was known, moved like a shadow, planting ideas as charismatic seeds in the minds of the city's most influential figures. This unspoken network grew, its tendrils stretching silently across the districts. Gradually, distrustful glances transformed into nods of understanding. Competitors found themselves in unexpected alliances, fused by a shared purpose that none could precisely name but all could feel. However, when the city began to change palpably, the Architect faced his greatest challenge — the fear of change. As old power structures pushed back, the Architect realized that his silent revolution needed voice. He stepped into the light, revealing the intricate web he had quietly spun. This culmination was not his own achievement but a living entity pulsing with the city's newfound collective energy. In stepping back, he watched as the city continued to blossom, the pattern of cooperative power remaining tethered not to him, but to the spirit he had nurtured — a spirit now perpetually evolving.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence of Influence",
                        "meaning": "The network transcends the Architect, continuing to grow and evolve, independent of its originator.",
                        "changing": "Clinging to control could impede evolution, keeping the network from realizing its greater potential."
                    },
                    "5": {
                        "name": "Mastery of Influence",
                        "meaning": "Standing at the peak, the Architect sees his web of connections flourishing autonomously.",
                        "changing": "Pride or misjudgment might erode once-stable alliances or leadership principles."
                    },
                    "4": {
                        "name": "Manifestation of Network",
                        "meaning": "His vision gains clarity and strength, aligning harmoniously with the fabric of the city.",
                        "changing": "Ambitious overreach might lead to fragile networks, undermining the steady expansion."
                    },
                    "3": {
                        "name": "Conflict with Tradition",
                        "meaning": "Traditional power threatens to crush the network, challenging the Architect's resolve.",
                        "changing": "Retreat or break could occur before realization if the Architect doubts his own influence."
                    },
                    "2": {
                        "name": "Formation of Connections",
                        "meaning": "With care, the Architect shapes his vision amid resistance, beginning to define pathways of unity.",
                        "changing": "Excessive haste could lead to discord, risking the natural flow and stability of emerging connections."
                    },
                    "1": {
                        "name": "Emergence of Vision",
                        "meaning": "The Architect begins with a silent, unseen potential, laying the groundwork for future connections.",
                        "changing": "Should he hesitate, the initial seeds of unity might fail to take root, delaying his creative impulse."
                    }
                }
            },
            {
                "title": "The Soul of the Forest (Man vs. Nature)",
                "theme": "Gabriel Garcia Marquez",
                "short_story": "In a realm of emerald leaves and ancient whispers, the young dreamer Santiago found his heart entangled with the vibrant pulse of the forest. Possessed by the raw, unshaped potential of his imagination, he resolved to give voice to the murmurs of the trees. But as Santiago began shaping his dream, obstacles arose, for the forest spirits were fickle, hiding their secrets beneath layers of bark and shadow.\n\nSantiago persisted, driven by the rhythm of the forest's pulse, forging connections with each flowering and fading leaf. Yet, as he approached clarity, a storm swept through the realm, testing the limits of his courage and resolve.\n\nRefusing to bow to despair, Santiago refined his vision, aligning with the ancient rhythms of the forest. In time, the once-distant echoes transformed into a harmonious symphony that resonated beyond the leaves.\n\nHe stood at the cusp of mastery, his voice weaving through the branches as he secured a bond between man and nature. However, as his creation loomed complete, Santiago took a step back, realizing his role was but a fleeting note in the eternal masterpiece. The forest sang, now independent of his whisper, a testament to the unity he had rekindled.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence of Creation",
                        "meaning": "Santiago's influence on the forest becomes self-sustaining, reflecting a truth larger than any single effort.",
                        "changing": "Clinging to control instead of letting go stifles the independent evolution of the creation."
                    },
                    "5": {
                        "name": "Mastery of Harmonies",
                        "meaning": "Santiago stands poised, commanding the delicate balance with authority over the connection between humanity and nature.",
                        "changing": "Arrogance or misjudgment risks unraveling the intricate harmony he fought to preserve."
                    },
                    "4": {
                        "name": "Manifesting the Vision",
                        "meaning": "Santiago finds his voice resonating within the forest, gaining momentum in their shared reality.",
                        "changing": "Aggressive ambition could lead to reckless growth, overshadowing the foundation of his creative process."
                    },
                    "3": {
                        "name": "Struggle Against the Tempest",
                        "meaning": "Faced with a storm, Santiago's creation is challenged by nature's raw force, threatening to tear it apart.",
                        "changing": "Withdrawn efforts yield no realization, squandering the opportunity to harness potential."
                    },
                    "2": {
                        "name": "Pathway of Creation",
                        "meaning": "Santiago begins to fashion his potential into a coherent form, encountering resistance that tempers his path.",
                        "changing": "Reckless advancement results in misalignment or disarray, disrupting the natural progression."
                    },
                    "1": {
                        "name": "Emergence of Imagination",
                        "meaning": "His journey initiates with unchecked energy, captured within the chorus of the forest's beginnings.",
                        "changing": "Hesitations or inaction prevent the thrilling spark from igniting into tangible creation."
                    }
                }
            },
            {
                "title": "The Whispering Aspiration (Man vs. Self)",
                "theme": "Virginia Woolf",
                "short_story": "A solitary artist named Alyssa sat in her dim-lit room, surrounded by canvasses filled with the whispers of half-formed ideas. These canvasses were her silent companions, their surfaces teeming with the unshaped potential of something profound, yet elusive. As her hands began to move on the blank canvas, the initial bewilderment gave way to an emerging clarity, hinting at a masterpiece in the making. However, the delicate dance of colors clashed, and doubts rose like an insidious fog, luring her into inaction. \n\nIn the intimate silence, she wrestled with the tumult within, slowly carving a path through the chaos. The swirl of her thoughts mirrored the hues before her, a beautiful chaos taking shape under her persistent gaze. As her vision hardened into form, a zealous spark ignited her spirit, urging her past the tempest of doubt.\n\nMastery was claimed, and Alyssa saw her work emerge, alive and dancing with vitality, a magnetism transcending the moment of its birth. Yet, this creation was not hers to claim alone. It whispered beyond her, becoming a voice for those yet to discover their silent aspirations, gently relinquishing its creator to the quiet, steady pulse of a newly knitted self.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence of the Vision",
                        "meaning": "Alyssa's painting surpasses her initial expectations, existing as an entity with its own impact on others.",
                        "changing": "If yang changes to yin, Alyssa might cling to the painting for personal validation, stifling its broader impact."
                    },
                    "5": {
                        "name": "Mastery of Creation",
                        "meaning": "Alyssa achieves a peak in her artistic ability, controlling the painting’s every facet with confidence.",
                        "changing": "If yang changes to yin, her confidence might falter, risking the integrity of the completed work."
                    },
                    "4": {
                        "name": "Manifestation of Vision",
                        "meaning": "Her vision gains substance, aligning her inner understanding with the external presentation of her work.",
                        "changing": "If yin changes to yang, her ambition could lead to overworking the art, losing its essence."
                    },
                    "3": {
                        "name": "Encounter with Doubt",
                        "meaning": "Alyssa faces deep internal conflict, threatening to halt her progress as doubt contrasts her vigor.",
                        "changing": "If yang changes to yin, she may withdraw, leaving the work incomplete and unrealized."
                    },
                    "2": {
                        "name": "Formation of Potential",
                        "meaning": "Her initial ideas start taking shape, but external challenges and inner barriers test her resolve.",
                        "changing": "If yin changes to yang, she may act prematurely, endangering the natural maturation of her vision."
                    },
                    "1": {
                        "name": "Emergence of Inspiration",
                        "meaning": "Alyssa’s first sparks of creativity awaken, untamed and awaiting direction for realization.",
                        "changing": "If yang changes to yin, hesitation could stall her inspiration, preventing artistic exploration."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "The Most Brilliant Coalition in History",
        "subtitle": "\"Coalition\" in History",
        "short_story": "In 1942, amidst the darkness of World War II, an unprecedented gathering of minds took shape in Los Alamos, New Mexico. The Manhattan Project brought together not just America's brightest scientists, but refugees from Nazi Europe, British allies, and academics from every field of physics and chemistry. What made this coalition extraordinary wasn't just its assembly of genius, but how it transcended traditional boundaries of nationality, specialty, and academic rivalry.\n\nJ. Robert Oppenheimer, chosen to lead this diverse group, proved to be a master of coalition-building. Rather than imposing rigid military hierarchy, he created an atmosphere of open collaboration. Theoretical physicists worked alongside experimental chemists, while engineering challenges were solved through cross-disciplinary teams. Even the housing arrangement was designed to encourage interaction, with Nobel laureates living next to young researchers.\n\nThe project's security requirements created a unique social dynamic. Unable to leave the facility or communicate with the outside world, these brilliant minds formed a tight-knit community. Their children attended the same schools, their families shared meals, and their work discussions continued into evening social gatherings. This forced isolation, rather than hindering progress, created an unprecedented intensity of intellectual exchange.\n\nMost remarkably, this coalition succeeded not through enforced cooperation but through genuine fellowship. Despite the pressure of wartime urgency and the ethical weight of their work, the scientists maintained an atmosphere of collegiate collaboration. Oppenheimer's morning technical meetings became famous for their intellectual openness, where junior scientists could challenge Nobel Prize winners, and theoretical objections were debated regardless of who raised them.\n\nThe project ultimately demonstrated how shared purpose could unite diverse talents into something greater than their sum. While its outcome remains controversial, the Manhattan Project's model of scientific collaboration - crossing boundaries of discipline, nationality, and hierarchy - would influence research organizations for generations to come.",
        "source": [
            "\"American Prometheus: The Triumph",
            "Tragedy of J. Robert Oppenheimer\" by Kai Bird",
            "Martin J. Sherwin (2005)",
            "\"The Making of the Atomic Bomb\" by Richard Rhodes (1986)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Completion through Collaborative Fellowship",
                "meaning": "Closure, return, or dissolution as the coalition reaches the peak of collaboration. It signifies the refinement of collective experience and the surrender to change.",
                "changing": "If Yang replaces Yin, it may indicate resistance to closure, clinging to power, or extending a process beyond its natural completion, potentially challenging the collaborative fellowship."
            },
            "5": {
                "name": "Leadership in Collaborative Execution",
                "meaning": "The full engagement stage where the coalition embodies leadership and executes its vision collectively. It represents the pinnacle of coalition strength and impact.",
                "changing": "If Yin replaces Yang, it could signify indecision, loss of authority, or incomplete realization of the collaborative vision, potentially impacting the leadership role."
            },
            "4": {
                "name": "Manifestation of Unified Purpose",
                "meaning": "Emergence in the outer world where the coalition aligns externally for collective action. It signifies preparation for the external expression of shared goals.",
                "changing": "If Yang replaces Yin, it may suggest premature external assertion before stable conditions are set, risking disruption of the unified purpose."
            },
            "3": {
                "name": "Integration through Intensity",
                "meaning": "Culmination of inner transformation as the coalition transitions to external action. It reflects a shift towards realizing the potential of unified diversity.",
                "changing": "If Yin replaces Yang, it suggests hesitation in carrying inner realization outward, potentially hindering the transition to collective action."
            },
            "2": {
                "name": "Harmonizing Boundaries of Innovation",
                "meaning": "Active state where the coalition structures itself across disciplines and nationalities to align potential with action. It signifies the formation and support of collaborative boundaries.",
                "changing": "If Yang replaces Yin, it could indicate premature action, instability, or struggle to integrate within the boundaries."
            },
            "1": {
                "name": "Emergence of Collaborative Genius",
                "meaning": "The initial stage where potential takes form as a diverse coalition of brilliant minds unites for unprecedented collaboration. This marks the birth of collective genius.",
                "changing": "N/A"
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "The convergence of radiant intellect and lucid insight materializes through the alchemical power of transformative creativity.",
        "Platonic": "Behold, the essence of radiant clarity, unveiled through the conduit of dynamic innovation.",
        "Taoist": "The radiant light of clarity arises from the dance of creative flow.",
        "Tholonic": "In the Tholonic realm, one finds the symphonic union of radiant clarity, achieved through the artistry of potent and imaginative expression.",
        "Thermodynamics": "The radiant emergence of illumination is propelled by the entropic dance of dynamic creativity.",
        "general": "The union of bright clarity and strong creativity gives rise to transformative brilliance.",
        "explanation": "In Coalition, the lower trigram 'The Clinging' symbolizes clarity and illumination, while the upper trigram 'The Creative' embodies strength and innovation. Together, they form a powerful synergy where the clarity of vision is amplified by creative force, resulting in transformative brilliance that aligns with the synthesis of philosophical perspectives."
    },
    "line_type": [
        "───",
        "───",
        "───",
        "───",
        "─ ─",
        "───"
    ]
}