{
    "id": 13,
    "hexagram_code": "䷌",
    "name": "Coalition",
    "description": "The power of aligned forces working toward common purpose. Like light and heat uniting in flame, this represents the synergistic effect of different energies combining in harmony.",
    "king_wen": {
        "sequence": 13,
        "traditional_title": "T'ung Jen",
        "common_title": "Fellowship"
    },
    "binary_sequence": 61,
    "trigrams": {
        "above": {
            "Trigram Number": 1,
            "Binary Decimal": 7,
            "Symbol": "☰",
            "Chinese Symbol": "乾",
            "Phonetic": "Qián",
            "English Translation": "Heaven",
            "English Symbol": "天",
            "Meaning": "The Creative",
            "Quality": "Strong and Creative"
        },
        "below": {
            "Trigram Number": 7,
            "Binary Decimal": 5,
            "Symbol": "☲",
            "Chinese Symbol": "离",
            "Phonetic": "Lí",
            "English Translation": "Fire",
            "English Symbol": "火",
            "Meaning": "The Clinging",
            "Quality": "Bright and Radiant"
        }
    },
    "attributes": {
        "perspective": "Creative power guided by shared understanding",
        "nature": "Unifying",
        "action": "Building connections",
        "success_through": "Harmonizing diverse elements",
        "challenge": "Maintaining individual integrity within collective action"
    },
    "lines": [
        {
            "position": 6,
            "name": "The Culmination of Unity",
            "meaning": "The final line signifies the completion of the journey, where the energies of disparate elements fully integrate into a harmonious and dynamic coalition.",
            "changing": "The lingering yin merges seamlessly with yang, achieving a state of balance and ensuring the enduring strength of the alliance."
        },
        {
            "position": 5,
            "name": "Empowered Union",
            "meaning": "The coalition reaches a period of strong collaboration where combined energies forge forward progress and collective empowerment.",
            "changing": "Cooperative yin energy transforms into a robust yang presence, solidifying leadership and unified action."
        },
        {
            "position": 4,
            "name": "Clarity and Reflection",
            "meaning": "A phase for introspection and evaluation as the coalition seeks to understand its core values and refine its purpose. Reflection invites prudent action.",
            "changing": "The reflective qualities of yin gradually infuse into the clarity of yang, turning uncertainty into measured, decisive insight."
        },
        {
            "position": 3,
            "name": "Tension and Discourse",
            "meaning": "A moment of dynamic interplay where disagreements surface, testing the integrity of the coalition. Conflict spurs clarification and the need for deeper dialogue.",
            "changing": "The yielding yin meets assertive yang, creating a pulse of energy that optimizes the balance between challenge and resolution."
        },
        {
            "position": 2,
            "name": "The Bond of Trust",
            "meaning": "A stage marked by the emergence of mutual respect and sincere connections, where individual intentions converge into a collective strength.",
            "changing": "The receptive yin nurtures rising yang, as trust transforms quiet reserves into dynamic, supportive energy."
        },
        {
            "position": 1,
            "name": "The Genesis of Alliance",
            "meaning": "A humble beginning in which the first steps toward a shared purpose are taken. The energy is cautious yet promising, laying a foundation for unity.",
            "changing": "Subtle yin potential begins to stir into nascent yang, marking the initial spark of transformation."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the negotiation between creative force (Qian/Heaven) and clear understanding (Li/Fire). This creates a dynamic balance between power and purpose, like different talents uniting for greater achievement.",
        "limitation": "Structure is provided by the heaven above, indicating that coalitions must serve higher purposes. The fire below suggests that unity must be based on shared understanding and values.",
        "contribution": "This pattern contributes to evolution by demonstrating how different elements can combine for greater effect. It shows how diversity can become strength through proper alignment.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents the point where individual forces consciously combine to create greater impact. It demonstrates how awareness can coordinate various elements into more powerful wholes."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on maintaining and strengthening existing alliances. Success comes through steady cultivation of relationships and shared purpose.",
        "all_moving_lines": "A complete transformation in how cooperation is achieved is indicated. Old forms of alliance must give way to new patterns of collaboration. Ensure that unity remains authentic while embracing change."
    },
    "hierarchy": {
        "order8child": "Basic connections",
        "order8parent": "EARLY DEVELOPMENT; Building Structure"
    },
    "image": {
        "description": "The image of a flame uniting light and heat embodies Hexagram 13, \"Coalition,\" symbolizing the formation of basic connections that bring individuals and elements together in shared purpose. The interplay of glowing warmth and structural lines reflects the tholonic concept of integration, where distinct components merge harmoniously to create greater unity. The collaborative and vibrant style underscores the dynamic interplay of energies, while the medium of acrylic on canvas captures the depth and intensity of this unifying process. Edgar Degas, renowned for his ability to convey subtle relationships and movement, brings life and cohesion to this portrayal, making it a profound representation of coalition as the foundation of collective growth and harmony.",
        "file": "13.png"
    },
    "energy_cycle": "descending",
    "stories": {
        "title": "Three Tales of \"Coalition",
        "entries": [
            {
                "title": "The Festival of Bridges (Man vs. Man)",
                "theme": "Gabriel García Márquez",
                "summary": "In the city where seven feuding neighborhoods had built walls between their streets, Marina discovered she could make bridges from music. Not physical bridges, but invisible ones that formed when people sang together. While politicians argued about territory and resources, she began organizing small musical gatherings at the edges of each district.\n\nAt first, only children came, attracted by the strange new sounds that seemed to dance between the walls. They brought instruments made from whatever they could find - pots, pipes, strings stretched across boxes. Marina taught them to play not just songs, but to listen for the music in each other's rhythms.\n\nSoon, parents came to watch their children and found themselves drawn into the strange harmonies. Market women recognized their calling songs in the melodies of rival districts. Construction workers heard their hammering rhythms echoed in the drums of strangers. Each performance added new threads to the invisible bridges.\n\nThe city council finally noticed when tax revenues increased in areas where the music gatherings occurred - people were crossing the old boundaries to trade, to learn new songs, to share meals. When they demanded to know how she had breached the ancient divisions, Marina simply handed them instruments and said, \"Some walls can only be crossed through harmony.",
                "lines_in_context": {
                    "6": {
                        "name": "Harmonious Transformation",
                        "meaning": "Signifies the closing of a cycle, surrender to change, or refinement of experience. Marina's approach of bridging through harmony transforms the city's landscape, bringing unity and understanding. Walls begin to dissolve.",
                        "changing": "Resistance to closure or clinging to old divisions may impede the full realization of unity."
                    },
                    "5": {
                        "name": "Expanded Connections",
                        "meaning": "Full engagement in the world, leadership, and execution of potential. The bridges facilitate extensive interactions between neighborhoods, fostering trade and cultural exchange. The unity through music continues to spread.",
                        "changing": "Indecision or incomplete realization may hinder the extended impact of the bridges."
                    },
                    "4": {
                        "name": "Recognition Externalized",
                        "meaning": "Alignment with external forces and preparation for action in the outer world. The city council notices the economic impact of the music gatherings. Awareness of the bridges leads to questioning of traditional divisions.",
                        "changing": "Premature external assertions may lead to resistance or conflict from established authorities."
                    },
                    "3": {
                        "name": "Bridge Culmination",
                        "meaning": "Culmination of inner realization transitioning to external action. Marks the completion of the first phase of bridge-building. The invisible bridges grow stronger with each performance.",
                        "changing": "Stagnation or hesitation may delay the expansion of bridges to new territories."
                    },
                    "2": {
                        "name": "Unified Resonance",
                        "meaning": "Support, alignment, and structuring of potential. Encourages harmony and coherence among the participants, fostering a sense of community. Children and parents start joining the musical gatherings.",
                        "changing": "Premature actions or struggles to integrate may disrupt the emerging harmony."
                    },
                    "1": {
                        "name": "Harmony Emerging",
                        "meaning": "Initiating force bringing birth of potential. Represents inner conditions of potential, preparation, and internal transformation. Marina discovers the power of music to create invisible bridges.",
                        "changing": "Marina's hesitation or weakness may hinder the initial bridge-building efforts."
                    }
                }
            },
            {
                "title": "The Coral Alliance (Man vs. Nature)",
                "theme": "Ursula K. Le Guin",
                "summary": "On an ocean world where rising temperatures threatened the coral reefs, marine biologist Dr. Sarah Chen discovered that different species of coral could help each other survive. While other scientists focused on engineering heat-resistant variants, she studied how coral communities naturally shared resources and protection.\n\nUsing advanced biomonitoring, she mapped the chemical signals between different coral species. She found that some corals produced compounds that protected others from heat stress, while others shared nutrients that boosted collective resilience. The reef wasn't just a collection of species but a vast chemical democracy.\n\nSarah developed what she called \"coalition gardening,\" carefully arranging different coral species to maximize their mutual support networks. The first test reef survived a major heating event not through human intervention but through its own strengthened community bonds.\n\nAs her method spread, reefs began showing unprecedented resilience. The ocean's ecosystems weren't just surviving - they were evolving new forms of cooperation that no single species could have achieved alone.",
                "lines_in_context": {
                    "6": {
                        "name": "Return to Renewed Cooperation",
                        "meaning": "The completion of a cycle prompts a return to refined cooperation and the dissolution of old structures, allowing for the emergence of new adaptive strategies and mutual interactions within the coral ecosystem.",
                        "changing": "When yang transforms to yin in line 6, it may suggest resistance to necessary adaptations or clinging to outdated approaches, hindering the renewal and potential growth of cooperative behaviors."
                    },
                    "5": {
                        "name": "Leadership in Collective Resilience",
                        "meaning": "Full engagement and leadership emerge within the coral community, guiding the effective execution of cooperative strategies and the evolution of new forms of survival and adaptation.",
                        "changing": "If a yin line emerges in place of yang in line 5, it could signal indecision or a lack of authoritative direction, potentially hindering collective efforts and innovations in resilience."
                    },
                    "4": {
                        "name": "Alignment for External Survival",
                        "meaning": "The community of coral species aligns with external forces and conditions, preparing itself for further actions and interactions to ensure survival and resilience in the face of environmental stressors.",
                        "changing": "When yang becomes yin in line 4, it might indicate premature or unbalanced responses to external pressures, risking instability or vulnerability within the coral community's strategies."
                    },
                    "3": {
                        "name": "Culmination in External Action",
                        "meaning": "As inner realizations are ready to be expressed externally, the strengthened community of coral species prepares to face external challenges and events, marking a transition towards active engagement with the environment.",
                        "changing": "If a yin line replaces yang in line 3, it suggests a reluctance or inability to translate inner strengths and cooperation into effective external action, potentially resulting in missed opportunities or stagnation in adaptation."
                    },
                    "2": {
                        "name": "Formation of Chemical Democracy",
                        "meaning": "The chemical signals and interactions between different coral species become structured and supportive, fostering a system of cooperation and mutual benefit within the reef ecosystem.",
                        "changing": "When a yang line shifts to yin in line 2, there may be challenges in coordinating and maintaining the chemical democracy, leading to potential disruptions in the network of mutual support."
                    },
                    "1": {
                        "name": "Emergence of Community Bonds",
                        "meaning": "At the initial stage, the community of coral species begins to form interconnected bonds through sharing resources and protection, shaping the foundation of collective resilience.",
                        "changing": "When a yin line replaces yang in line 1, it signifies a delay or resistance in the establishment of community bonds, potentially hindering the growth of mutual support networks."
                    }
                }
            },
            {
                "title": "The Memory Collective (Man vs. Self)",
                "theme": "Jorge Luis Borges",
                "summary": "In 2157, when memory enhancement became mandatory, psychologist Maya Patel found that individual minds could form temporary coalitions. While others sought to expand personal memory capacity, she developed techniques for people to share memories while maintaining their distinct identities.\n\nThe breakthrough came when she discovered that memories weren't just personal recordings but patterns that could resonate between minds. Like jazz musicians improvising together, people could temporarily merge their mental patterns while each maintained their unique voice.\n\nShe called these \"memory ensembles\" - voluntary coalitions of minds sharing experiences and knowledge. A surgeon could share procedural memory with students without transferring personal associations. Artists could blend their perceptions while maintaining individual creativity.\n\nThe practice transformed human consciousness. People learned to move fluidly between individual and collective awareness, creating new forms of understanding that neither solitude nor permanent merger could achieve.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion and Renewal of Collective Consciousness",
                        "meaning": "The refinement and surrender to change within the shared memory ensembles.",
                        "changing": "If yang replaces yin, it may indicate resistance to closure or forced extension of the collective process."
                    },
                    "5": {
                        "name": "Engagement in Shared Realities",
                        "meaning": "Leadership and execution of collective understanding and creativity.",
                        "changing": "If yin replaces yang, it could mean indecision, loss of authority, or incomplete realization."
                    },
                    "4": {
                        "name": "Alignment in External Manifestations",
                        "meaning": "Preparation for external actions based on shared memories and experiences.",
                        "changing": "If yang replaces yin, it may suggest premature external assertion before stability is achieved."
                    },
                    "3": {
                        "name": "Transition to External Sharing",
                        "meaning": "Culmination of the inner process leading to the outward expression of shared memories.",
                        "changing": "If yin replaces yang, it suggests hesitation in sharing inner realizations externally."
                    },
                    "2": {
                        "name": "Formation of Shared Patterns",
                        "meaning": "The structuring and alignment of mental patterns among individuals, like jazz musicians improvising together.",
                        "changing": "If yang replaces yin, it may indicate premature action, instability, or struggle in integrating different patterns."
                    },
                    "1": {
                        "name": "Emergence of Collective Memory",
                        "meaning": "The birth of the concept of memory ensembles, voluntary coalitions of minds sharing experiences and knowledge.",
                        "changing": "If yin replaces yang, it suggests hesitation or weakness in forming collective memories."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "The Most Brilliant Coalition in History",
        "subtitle": "\"Coalition\" in History",
        "summary": "In 1942, amidst the darkness of World War II, an unprecedented gathering of minds took shape in Los Alamos, New Mexico. The Manhattan Project brought together not just America's brightest scientists, but refugees from Nazi Europe, British allies, and academics from every field of physics and chemistry. What made this coalition extraordinary wasn't just its assembly of genius, but how it transcended traditional boundaries of nationality, specialty, and academic rivalry.\n\nJ. Robert Oppenheimer, chosen to lead this diverse group, proved to be a master of coalition-building. Rather than imposing rigid military hierarchy, he created an atmosphere of open collaboration. Theoretical physicists worked alongside experimental chemists, while engineering challenges were solved through cross-disciplinary teams. Even the housing arrangement was designed to encourage interaction, with Nobel laureates living next to young researchers.\n\nThe project's security requirements created a unique social dynamic. Unable to leave the facility or communicate with the outside world, these brilliant minds formed a tight-knit community. Their children attended the same schools, their families shared meals, and their work discussions continued into evening social gatherings. This forced isolation, rather than hindering progress, created an unprecedented intensity of intellectual exchange.\n\nMost remarkably, this coalition succeeded not through enforced cooperation but through genuine fellowship. Despite the pressure of wartime urgency and the ethical weight of their work, the scientists maintained an atmosphere of collegiate collaboration. Oppenheimer's morning technical meetings became famous for their intellectual openness, where junior scientists could challenge Nobel Prize winners, and theoretical objections were debated regardless of who raised them.\n\nThe project ultimately demonstrated how shared purpose could unite diverse talents into something greater than their sum. While its outcome remains controversial, the Manhattan Project's model of scientific collaboration - crossing boundaries of discipline, nationality, and hierarchy - would influence research organizations for generations to come.",
        "source": [
            "\"American Prometheus: The Triumph",
            "Tragedy of J. Robert Oppenheimer\" by Kai Bird",
            "Martin J. Sherwin (2005)",
            "\"The Making of the Atomic Bomb\" by Richard Rhodes (1986)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Completion through Collaborative Fellowship",
                "meaning": "Closure, return, or dissolution as the coalition reaches the peak of collaboration. It signifies the refinement of collective experience and the surrender to change.",
                "changing": "If Yang replaces Yin, it may indicate resistance to closure, clinging to power, or extending a process beyond its natural completion, potentially challenging the collaborative fellowship."
            },
            "5": {
                "name": "Leadership in Collaborative Execution",
                "meaning": "The full engagement stage where the coalition embodies leadership and executes its vision collectively. It represents the pinnacle of coalition strength and impact.",
                "changing": "If Yin replaces Yang, it could signify indecision, loss of authority, or incomplete realization of the collaborative vision, potentially impacting the leadership role."
            },
            "4": {
                "name": "Manifestation of Unified Purpose",
                "meaning": "Emergence in the outer world where the coalition aligns externally for collective action. It signifies preparation for the external expression of shared goals.",
                "changing": "If Yang replaces Yin, it may suggest premature external assertion before stable conditions are set, risking disruption of the unified purpose."
            },
            "3": {
                "name": "Integration through Intensity",
                "meaning": "Culmination of inner transformation as the coalition transitions to external action. It reflects a shift towards realizing the potential of unified diversity.",
                "changing": "If Yin replaces Yang, it suggests hesitation in carrying inner realization outward, potentially hindering the transition to collective action."
            },
            "2": {
                "name": "Harmonizing Boundaries of Innovation",
                "meaning": "Active state where the coalition structures itself across disciplines and nationalities to align potential with action. It signifies the formation and support of collaborative boundaries.",
                "changing": "If Yang replaces Yin, it could indicate premature action, instability, or struggle to integrate within the boundaries."
            },
            "1": {
                "name": "Emergence of Collaborative Genius",
                "meaning": "The initial stage where potential takes form as a diverse coalition of brilliant minds unites for unprecedented collaboration. This marks the birth of collective genius.",
                "changing": "N/A"
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "The convergence of radiant intellect and lucid insight materializes through the alchemical power of transformative creativity.",
        "Platonic": "Behold, the essence of radiant clarity, unveiled through the conduit of dynamic innovation.",
        "Taoist": "The radiant light of clarity arises from the dance of creative flow.",
        "Tholonic": "In the Tholonic realm, one finds the symphonic union of radiant clarity, achieved through the artistry of potent and imaginative expression.",
        "Thermodynamics": "The radiant emergence of illumination is propelled by the entropic dance of dynamic creativity."
    },
    "line_type": [
        "⚊",
        "⚊",
        "⚊",
        "⚊",
        "⚋",
        "⚊"
    ]
}