{
  "id": 17,
  "hexagram_code": "䷐",
  "name": "Resonance",
  "description": "The alignment of energies that creates natural harmony and following. Like thunder over a lake causing ripples to form in perfect patterns, this represents the power of authentic energy to create spontaneous order and willing participation.",
  "king_wen": {
    "sequence": 17,
    "traditional_title": "Sui",
    "common_title": "Following"
  },
  "binary_sequence": 25,
  "trigrams": {
    "above": {
      "Trigram Number": 8,
      "Binary Decimal": 4,
      "Symbol": "☱",
      "Chinese Symbol": "兑",
      "Phonetic": "Duì",
      "English Translation": "Lake/Marsh",
      "English Symbol": "泽",
      "Meaning": "The Joyous",
      "Quality": "Joyful and Harmonious"
    },
    "below": {
      "Trigram Number": 4,
      "Binary Decimal": 1,
      "Symbol": "☳",
      "Chinese Symbol": "震",
      "Phonetic": "Zhèn",
      "English Translation": "Thunder",
      "English Symbol": "雷",
      "Meaning": "The Arousing",
      "Quality": "Dynamic and Exciting"
    }
  },
  "attributes": {
    "perspective": "Natural alignment creating harmonious movement",
    "nature": "Harmonious",
    "action": "Attuning and aligning",
    "success_through": "Creating natural resonance rather than forced compliance",
    "challenge": "Maintaining authenticity while creating alignment"
  },
  "lines": [
    {
      "position": 6,
      "name": "Final Resonance",
      "meaning": "The hexagram’s journey culminates as the initial echoes transform into a lasting force. It symbolizes both a completion and the promise of regeneration through continuity.",
      "changing": "In this final stage, the lingering wisdom of yin merges with the full, creative power of yang, laying the groundwork for new cycles of resonance."
    },
    {
      "position": 5,
      "name": "Harmonious Convergence",
      "meaning": "The energies reach a point of synthesis, harmonizing individual efforts into a unified vision. This state is marked by leadership and the collective embrace of purpose.",
      "changing": "A mature yin essence seamlessly transitions into the commanding presence of yang, embodying the fulfillment of potential and inspiring others."
    },
    {
      "position": 4,
      "name": "Amplified Echo",
      "meaning": "Resonance becomes more distinct and forceful, echoing outwards with clarity. There is a call to refine one’s purpose and harness the rising energy effectively.",
      "changing": "The melding of yin’s receptive strength with yang’s dynamic vigor creates a transformative blend, urging decisive yet measured action."
    },
    {
      "position": 3,
      "name": "Threshold of Change",
      "meaning": "An inflection point is reached where uncertainty meets opportunity. This line advises caution as conflicting inner impulses offer a moment for reassessment.",
      "changing": "Though the inherent yin hesitates, it is gradually nudged towards the assertiveness of yang, demanding a careful balance between restraint and initiative."
    },
    {
      "position": 2,
      "name": "Building Momentum",
      "meaning": "The energy gathers strength as resonance deepens. In this stage, intentions align and supportive forces become apparent, setting a steady pace for progress.",
      "changing": "The soft yin influence begins to energize into a more dynamic yang, suggesting that the initial stirrings are solidifying into impactful action."
    },
    {
      "position": 1,
      "name": "First Reverberation",
      "meaning": "The initial contact of resonance signifies the nascent stirring of energy. It marks the beginning of a journey where subtle signals hint at emerging potential.",
      "changing": "A quiet, underlying yin quality gently gives way to the first bursts of yang activity, signaling a slow but deliberate shift."
    }
  ],
  "tholonic_analysis": {
    "negotiation": "The hexagram represents the negotiation between inspiring movement (Chen/Thunder) and joyful response (Dui/Lake). This creates a dynamic balance between leadership and following, where influence flows naturally through resonance rather than force.",
    "limitation": "Structure is provided by the need for authentic alignment. The thunder above indicates that movement must arise naturally from true resonance rather than artificial manipulation.",
    "contribution": "This pattern contributes to evolution by demonstrating how natural harmony creates sustainable order. It shows how aligned energies can create spontaneous organization and willing participation.",
    "significance_in_thologram": "In the tholonic system, this hexagram represents the point where consciousness creates order through resonance rather than force. It demonstrates how awareness can align different elements into harmonious patterns."
  },
  "transformations": {
    "no_moving_lines": "When no lines are changing, focus on maintaining authentic resonance and allowing natural alignment to develop. Success comes through genuine connection rather than forced coordination.",
    "all_moving_lines": "A complete transformation in how alignment is achieved is indicated. Old patterns of influence must give way to new forms of resonance. Ensure that harmony remains authentic while embracing change."
  },
  "hierarchy": {
    "order8child": "Adaptability and alignment",
    "order8parent": "INNER GROWTH; Internal Development"
  },
  "image": {
    "description": "The image of thunder over a lake, depicted through fluid lines and vibrant contrasts, captures Hexagram 17, \"Resonance,\" symbolizing adaptability and alignment in the dynamic interplay of forces. The intertwining branches and clouds illustrate the tholonic concept of negotiation, where harmony is achieved through the delicate balance of opposing energies. The harmonious and fluid style reflects the natural rhythm of resonance, while the medium of watercolor on silk conveys an ethereal softness and interconnected flow. Katsushika Hokusai, with his mastery of capturing the sublime in nature, brings this imagery to life, portraying the transformative and unifying power of resonance in growth and alignment.",
    "file": "17.png"
  },
  "energy_cycle": "ascending",
  "stories": {
    "title": "Three Tales of \"Resonance\"",
    "entries": [
      {
        "title": "The Sculptor's Dream (Man vs. Man)",
        "theme": "Gabriel García Márquez",
        "short_story": "In a mystical town where time seemed to meander like a lazy river, a sculptor named Lucius lived. He was known for his ability to breathe life into stone, creating sculptures that whispered secrets to those who dared to listen. One day, as he wandered through the market, Lucius stumbled upon a peculiar block of marble, radiant with hidden promise. He sensed an unborn masterpiece within.\n\nBack in his studio, Lucius began his work. Each strike of the chisel released echoes of long-held dreams, the stone responding to his intentions as though it had long awaited this moment. His vision of a majestic winged figure was vivid, yet as the sculpture took shape, it seemed imbued with a will of its own. The stone resonated with the rhythm of creation, but not without struggles. Moments of doubt deformed the marble, threatening to derail his efforts.\n\nYet, Lucius persevered, listening to the marble's story as much as his own. The sculpture grew, a magnificent creature poised to soar—a testament to Lucius's skill and the marble's inherent story. But as he neared completion, Lucius hesitated. Would his creation transcend his vision, unfurling wings to fly beyond his grasp? As he touched the final stroke, a profound peace washed over him. He let go, allowing the edifice to stand not as his creation, but as a new entity written by both man and stone, existing in harmony with the world's symphony.",
        "lines_in_context": {
          "6": {
            "name": "The Release to the Cosmos",
            "meaning": "Lucius relinquishes control, allowing his creation to transcend its marble confines.",
            "changing": "If yin changes to yang, Lucius struggles to release his creation, causing it to remain earthbound and unfulfilled, potentially robbing it of its opportunity to inspire beyond his intentions."
          },
          "5": {
            "name": "Synchronicity of Mastery",
            "meaning": "Lucius reaches a state of masterpiece creation, where his skill and the marble's potential align perfectly.",
            "changing": "If yang changes to yin, overconfidence might overshadow his insight, resulting in a work that fails to realize its potential fully."
          },
          "4": {
            "name": "Form's Awakening",
            "meaning": "The emerging shape is a reflection of Lucius’s artistic vision, refined and yet meaningful.",
            "changing": "If yang changes to yin, there could be unnecessary constraints, limiting the full expression of the sculpture's intent."
          },
          "3": {
            "name": "Tension of Aspiration",
            "meaning": "Lucius must navigate his ambitions and the innate qualities of the stone, a balancing act between artistic dream and physical reality.",
            "changing": "If yin changes to yang, his determination could overtake harmony, forcing the creation to fit his will rather than allow for organic growth."
          },
          "2": {
            "name": "Solidification of Intent",
            "meaning": "Lucius’s technique begins to manifest as structure, bringing his abstract ideals into reality.",
            "changing": "If yin changes to yang, he might act prematurely, leading to an incomplete work that lacks foundation."
          },
          "1": {
            "name": "The Quickening of Vision",
            "meaning": "Lucius feels the initial stirring of potential, where his creative spirit fuses with the marble’s promise.",
            "changing": "If yang changes to yin, hesitation may take hold, hampering the emergence of the vision and delaying the commencement of creation."
          }
        }
      },
      {
        "title": "The Symphonic Dance of the Elements (Man vs. Nature)",
        "theme": "J.R.R. Tolkien",
        "short_story": "In the heart of the ancient realm of Eorlas, where the land breathed with the whispers of the gods, a young guardian named Elanor embarked on her quest. Her goal was to harness the raw forces of nature and awaken the dormant power within the Mountain of Aear, known for its ancient songs of earth and sky. \n\nElanor stood at the mountain's base, feeling the earth's deep thrum beneath her feet, a melody waiting to be born. Her task was immense, requiring harmony with the elemental forces—earth, water, fire, and air. As she ascended, each step was a note in the grand symphony of creation. \n\nAt dawn, she reached an ancient circle of stones, a place where the elements danced in eternal unity. Here, she sang the songs of the earth, coaxing the water to rise, the fire to ignite, and the air to weave their essences together. \n\nThe elements resisted at first, each guarding its primal strength. Yet through patience and unwavering intention, Elanor wove them into a single, harmonious song that reverberated throughout the mountain. \n\nHer journey mirrored the hexagram, with each line representing a stage in this transformation. \n\nBy dusk, the mountain awakened, shimmering with the light of a new dawn. Elanor realized that in guiding the elements, she, too, had transformed. She let go, allowing the symphony to unfold, an ever-echoing resonance of balance and creation.",
        "lines_in_context": {
          "6": {
            "name": "Transcendence of the Elemental Symphony",
            "meaning": "The mountain's awakening symbolizes the transcendence of Elanor's quest, where the elements unite in an endless symphony of harmony.",
            "changing": "If yin changes to yang, Elanor might cling too tightly to her control, risking the dissonance of the elements and missing the true potential of their unity."
          },
          "5": {
            "name": "Mastery of Elemental Harmony",
            "meaning": "Elanor's full alignment with the elements marks her mastery over their once-separate forces.",
            "changing": "If yang changes to yin, Elanor's confidence could falter, and she could lose sight of the symphony, leading to discord amongst the elements."
          },
          "4": {
            "name": "Manifestation of Elemental Unity",
            "meaning": "The elements begin to respond to Elanor's song, echoing through the stones.",
            "changing": "If yin changes to yang, the elements may overpower her voice, threatening the fragile harmony she has achieved."
          },
          "3": {
            "name": "Conflict of Elemental Forces",
            "meaning": "The elements stand in opposition, each asserting its primal will against Elanor's intentions.",
            "changing": "If yin changes to yang, the elements might surge unexpectedly, requiring Elanor to adapt swiftly or face being overwhelmed."
          },
          "2": {
            "name": "Formation of Intentional Unity",
            "meaning": "Elanor's focus solidifies, melding her will with the natural flow of the elements.",
            "changing": "When yin changes to yang, she might act too quickly, disrupting the element's natural order and causing instability."
          },
          "1": {
            "name": "Emergence of Elemental Connection",
            "meaning": "Elanor senses the first stirrings of the elemental forces, their ancient songs awakening within her spirit.",
            "changing": "If yang changes to yin, hesitation might cloud her connection, delaying the symphony's full emergence."
          }
        }
      },
      {
        "title": "A Dance with Creation (Man vs. Self)",
        "theme": "Haruki Murakami",
        "short_story": "In the vibrant city of Kyoto, where tradition and modernity entwine like cherry blossoms swirling in the wind, lived Hana, a reclusive artist. Her life was a quiet symphony, composed of routine sketches and silent conversations with the paints that lined her shelves. Yet beneath this calm, a tempest brewed—a desire to create a piece that spoke the unspoken truths of human existence.\n\nThe journey began with a blank canvas, a void waiting to be filled. Hana approached it not with a brush, but with a dance of colors that flowed from her soul. Shapes emerged and dissolved, a testament to the chaos and order of life itself. As the colors swirled, they resonated with an energy that beckoned deeper exploration.\n\nHana's mind was a battlefield of doubts, yet she pressed on, each stroke of the brush a step in her journey. The painting took shape—a vibrant cascade of colors and forms mirroring the complexity of existence. Yet, just as her vision neared fruition, an inner voice sowed doubt, whispering of imperfections and unseen mistakes.\n\nHana realized her struggle wasn't with the painting, but with herself. Her art was not a creation to be controlled, but a dance to be joined—a resonant call to those who view it to find their own place in the tapestry. And thus, she released her grip, allowing the piece to transcend her, fulfilling its own purpose and echoing into the hearts of those who dared to listen.",
        "lines_in_context": {
          "6": {
            "name": "Echoes of the Soul",
            "meaning": "The painting becomes something beyond Hana, resonating with the shared experiences of those who encounter it.",
            "changing": "If yin changes to yang, Hana may find herself clinging to her vision, limiting the painting's potential to transcend her intent and inspiring in only a limited capacity."
          },
          "5": {
            "name": "Harmony of Vision",
            "meaning": "Hana's mastery shines as her vision and execution align seamlessly, creating a masterpiece that resonates deeply.",
            "changing": "If yang changes to yin, self-doubt may creep in, potentially diminishing the potency of Hana's final creation, which could falter in conveying its intended message."
          },
          "4": {
            "name": "Emergent Clarity",
            "meaning": "The forms and lines find their place within the painting, showcasing a newfound clarity and purpose.",
            "changing": "If yin changes to yang, the painting might take on unintended shapes, veering from its destined path and challenging Hana to adapt and reshape her approach."
          },
          "3": {
            "name": "Internal Struggle",
            "meaning": "Hana faces a battle between her creative impulse and the self-doubt that threatens to stall her progress.",
            "changing": "When yin changes to yang, Hana could find a sudden burst of confidence, propelling her beyond her inner conflicts and refining her vision with newfound vigor."
          },
          "2": {
            "name": "The Artist's Touch",
            "meaning": "Hana's hands move with intuitive grace, as the raw elements of her vision begin to solidify into coherent forms.",
            "changing": "If yin changes to yang, Hana might act too hastily, potentially disrupting the equilibrium of her burgeoning vision and requiring recalibration."
          },
          "1": {
            "name": "The Spark of Creation",
            "meaning": "Hana senses the first whispers of inspiration, a spark igniting the vast potential of her canvas.",
            "changing": "If yang changes to yin, hesitation may overshadow her initial enthusiasm, stalling the birth of her creation and necessitating a patient return to inspiration."
          }
        }
      }
    ]
  },
  "history": {
    "title": "Galileo and the Stars: A Symphony of Observation",
    "subtitle": "\"Resonance\" in History",
    "short_story": "In the dawn of the 17th century, the Italian astronomer Galileo Galilei stood resolute with his telescope, peering into the cosmos. His hands were steady as he gazed into the vast unknown, challenging the geocentric view that had held sway for centuries. Each night, Galileo methodically recorded the heavenly bodies, uncovering moons orbiting Jupiter and the phases of Venus—compelling evidence that the earth was not the universe's center.\n\nThis bold journey of observation was not without conflict. Skepticism and tension grew among those who staunchly defended established doctrines. Yet, Galileo's relentless pursuit of truth resonated strongly with the emerging scientific community, fostering a burgeoning understanding of the natural world.\n\nHis discoveries marked a critical shift, a manifestation of the Copernican Revolution that transformed humanity's perspective of the universe. Despite facing the Inquisition and his eventual house arrest, Galileo's mastery over the realm of astronomy endured. His work transcended personal limitations, inspiring generations to follow the path of science and reason. It was a resonance of knowledge that echoed through time, establishing a foundation for modern astronomy.",
    "source": [
      "Galileo: A Life by James Reston Jr.",
      "Galileo's Daughter by Dava Sobel"
    ],
    "lines_in_history": {
      "6": {
        "name": "Celestial Transcendence",
        "meaning": "Galileo's discoveries transcended his personal trials, resonating through time and establishing a foundation for modern astronomy.",
        "changing": "If yin changes to yang, Galileo might have resisted the natural course of disseminating his findings, limiting their transformative impact and integration into accepted scientific understanding."
      },
      "5": {
        "name": "Stellar Mastery",
        "meaning": "Galileo's mastery in observing celestial bodies brought the natural order of the cosmos into clearer focus, ushering in a new era of understanding.",
        "changing": "If yang changes to yin, doubt or lack of clarity might obscure his observations, potentially diminishing their significance and halting the progress of astronomical knowledge."
      },
      "4": {
        "name": "Manifestation of Stars",
        "meaning": "As Galileo's observations took form, they revealed the true structure of our solar system, challenging long-held beliefs.",
        "changing": "If yang changes to yin, suppression of his observations could have led to stagnation, delaying the advancement of astronomical knowledge."
      },
      "3": {
        "name": "Conflict of Inquiry",
        "meaning": "Galileo faced resistance from traditionalists as his findings contrasted with established dogma, a tension between innovation and orthodoxy.",
        "changing": "If yin changes to yang, potential acceptance and recognition of his findings might have accelerated scientific breakthroughs, facilitating swifter development of astronomical theories."
      },
      "2": {
        "name": "Formation of Insight",
        "meaning": "Galileo's methodical observations laid the groundwork for a paradigm shift in understanding the universe.",
        "changing": "If yin changes to yang, premature conclusions might disrupt the integrity of his observations, potentially leading to misinformation and misunderstandings."
      },
      "1": {
        "name": "Emergence of Observation",
        "meaning": "Galileo’s initial observations prompted a profound shift in celestial understanding, marking the nascent stirrings of revolutionary insight.",
        "changing": "If yang changes to yin, Galileo might hesitate, impeding his investigations and delaying the revelation of his groundbreaking discoveries."
      }
    }
  },
  "trigram_phrase": {
    "Jungian": "The mesmerizing dance of Thunder's dynamic fervor intertwines with Lake's serene joy, crafting an enchanting symphony of vitality and delight.",
    "Platonic": "In the realm of Forms, the exuberant essence of Thunder's dynamic vigor finds its true expression within the tranquil harmony of the Lake, thus weaving a splendid tapestry of exhilaration and bliss.",
    "Taoist": "When Thunder's vigorous pulse meets the Lake's tranquil delight, life dances in harmonious accord.",
    "Tholonic": "In the realm of Joyful Concord, the Vibrant Energy unfurls with elegance, revealing its splendor through the art of Harmonious Expression.",
    "Thermodynamics": "The fusion of Thunder's kinetic energy with the tranquil entropy of the Lake creates a thermodynamic symphony of exhilarating equilibrium and delight.",
    "general": "The dynamic energy of excitement meets the joyful harmony of delight, creating a vibrant dance of life.",
    "explanation": "The lower trigram 'The Arousing' symbolizes dynamic and exciting energy, igniting movement and change. The upper trigram 'The Joyous' embodies joy and harmony, bringing balance and pleasure. Together, they blend excitement with joy, forming a lively and harmonious interaction that reflects the essence of vibrant life."
  },
  "line_type": [
    "yin",
    "yang",
    "yang",
    "yin",
    "yin",
    "yang"
  ],
  "pairpath": {
    "title": "Adaptation Cycle",
    "ascending_hex_num": 17,
    "ascending_hex_name": "Following",
    "descending_hex_num": 18,
    "descending_hex_name": "Work on What Has Been Spoiled",
    "description": "This pair-path illustrates the dynamic interplay between aligning oneself with the natural flow and addressing past imbalances. 'Following' represents the ascent through harmony and adaptability, while 'Work on What Has Been Spoiled' signifies the descent into rectification and renewal. Together, they embody a cycle of adapting to circumstances and correcting misalignments.",
    "kstate": "stable",
    "image_prompt": "A serene landscape with a flowing river symbolizing harmony and adaptability, juxtaposed with an ancient, weathered structure being carefully restored, representing the cycle of adaptation and rectification.",
    "path_num": 8
  }
}