{
    "id": 17,
    "hexagram_code": "䷐",
    "name": "Resonance",
    "description": "The alignment of energies that creates natural harmony and following. Like thunder over a lake causing ripples to form in perfect patterns, this represents the power of authentic energy to create spontaneous order and willing participation.",
    "king_wen": {
        "sequence": 17,
        "traditional_title": "Sui",
        "common_title": "Following"
    },
    "binary_sequence": 25,
    "trigrams": {
        "above": {
            "Trigram Number": 8,
            "Binary Decimal": 4,
            "Symbol": "☱",
            "Chinese Symbol": "兑",
            "Phonetic": "Duì",
            "English Translation": "Lake/Marsh",
            "English Symbol": "泽",
            "Meaning": "The Joyous",
            "Quality": "Joyful and Harmonious"
        },
        "below": {
            "Trigram Number": 4,
            "Binary Decimal": 1,
            "Symbol": "☳",
            "Chinese Symbol": "震",
            "Phonetic": "Zhèn",
            "English Translation": "Thunder",
            "English Symbol": "雷",
            "Meaning": "The Arousing",
            "Quality": "Dynamic and Exciting"
        }
    },
    "attributes": {
        "perspective": "Natural alignment creating harmonious movement",
        "nature": "Harmonious",
        "action": "Attuning and aligning",
        "success_through": "Creating natural resonance rather than forced compliance",
        "challenge": "Maintaining authenticity while creating alignment"
    },
    "lines": [
        {
            "position": 6,
            "name": "Final Resonance",
            "meaning": "The hexagram’s journey culminates as the initial echoes transform into a lasting force. It symbolizes both a completion and the promise of regeneration through continuity.",
            "changing": "In this final stage, the lingering wisdom of yin merges with the full, creative power of yang, laying the groundwork for new cycles of resonance."
        },
        {
            "position": 5,
            "name": "Harmonious Convergence",
            "meaning": "The energies reach a point of synthesis, harmonizing individual efforts into a unified vision. This state is marked by leadership and the collective embrace of purpose.",
            "changing": "A mature yin essence seamlessly transitions into the commanding presence of yang, embodying the fulfillment of potential and inspiring others."
        },
        {
            "position": 4,
            "name": "Amplified Echo",
            "meaning": "Resonance becomes more distinct and forceful, echoing outwards with clarity. There is a call to refine one’s purpose and harness the rising energy effectively.",
            "changing": "The melding of yin’s receptive strength with yang’s dynamic vigor creates a transformative blend, urging decisive yet measured action."
        },
        {
            "position": 3,
            "name": "Threshold of Change",
            "meaning": "An inflection point is reached where uncertainty meets opportunity. This line advises caution as conflicting inner impulses offer a moment for reassessment.",
            "changing": "Though the inherent yin hesitates, it is gradually nudged towards the assertiveness of yang, demanding a careful balance between restraint and initiative."
        },
        {
            "position": 2,
            "name": "Building Momentum",
            "meaning": "The energy gathers strength as resonance deepens. In this stage, intentions align and supportive forces become apparent, setting a steady pace for progress.",
            "changing": "The soft yin influence begins to energize into a more dynamic yang, suggesting that the initial stirrings are solidifying into impactful action."
        },
        {
            "position": 1,
            "name": "First Reverberation",
            "meaning": "The initial contact of resonance signifies the nascent stirring of energy. It marks the beginning of a journey where subtle signals hint at emerging potential.",
            "changing": "A quiet, underlying yin quality gently gives way to the first bursts of yang activity, signaling a slow but deliberate shift."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the negotiation between inspiring movement (Chen/Thunder) and joyful response (Dui/Lake). This creates a dynamic balance between leadership and following, where influence flows naturally through resonance rather than force.",
        "limitation": "Structure is provided by the need for authentic alignment. The thunder above indicates that movement must arise naturally from true resonance rather than artificial manipulation.",
        "contribution": "This pattern contributes to evolution by demonstrating how natural harmony creates sustainable order. It shows how aligned energies can create spontaneous organization and willing participation.",
        "significance_in_thologram": "In the tholonic system, this hexagram represents the point where consciousness creates order through resonance rather than force. It demonstrates how awareness can align different elements into harmonious patterns."
    },
    "transformations": {
        "no_moving_lines": "When no lines are changing, focus on maintaining authentic resonance and allowing natural alignment to develop. Success comes through genuine connection rather than forced coordination.",
        "all_moving_lines": "A complete transformation in how alignment is achieved is indicated. Old patterns of influence must give way to new forms of resonance. Ensure that harmony remains authentic while embracing change."
    },
    "hierarchy": {
        "order8child": "Adaptability and alignment",
        "order8parent": "INNER GROWTH; Internal Development"
    },
    "image": {
        "description": "The image of thunder over a lake, depicted through fluid lines and vibrant contrasts, captures Hexagram 17, \"Resonance,\" symbolizing adaptability and alignment in the dynamic interplay of forces. The intertwining branches and clouds illustrate the tholonic concept of negotiation, where harmony is achieved through the delicate balance of opposing energies. The harmonious and fluid style reflects the natural rhythm of resonance, while the medium of watercolor on silk conveys an ethereal softness and interconnected flow. Katsushika Hokusai, with his mastery of capturing the sublime in nature, brings this imagery to life, portraying the transformative and unifying power of resonance in growth and alignment.",
        "file": "17.png"
    },
    "energy_cycle": "ascending",
    "stories": {
        "title": "Three Tales of \"Resonance",
        "entries": [
            {
                "title": "The Street Orchestra (Man vs. Man)",
                "theme": "Gabriel García Márquez",
                "summary": "In the city where every sound had been regulated by decree, young Miguel discovered he could make music from the everyday rhythms of street life. The sweep of brooms, the clatter of cart wheels, the murmur of vendors - to his ears, they formed a perfect urban symphony that bypassed the city's strict noise ordinances.\n\nInstead of fighting the authorities directly, Miguel began subtly conducting the street's natural orchestra. He taught vendors to time their calls to complement each other, showed sweepers how their brooms could create gentle percussion, and helped cart-pushers find routes that added rhythm rather than chaos to the street's song.\n\nOther neighborhoods began to notice how Miguel's street had become mysteriously harmonious. The sounds weren't quieter, but they flowed together so naturally that even the noise inspectors found themselves nodding along. Soon, vendors from across the city sought Miguel's corner, not for his conducting but for the way their voices seemed to find their perfect place in the street's chorus.\n\nWhen the city council finally investigated the phenomenon, they found not a rebellion against their rules but a perfect demonstration of how regulation could emerge naturally through resonance. The street's symphony had created order more perfect than any decree could enforce.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion through Order",
                        "meaning": "The city council's investigation reveals that Miguel's symphony of the street exemplifies the natural emergence of order through resonance and coordination. The final stage of the transformation showcases how harmonious unity, when embraced organically, can surpass the constraints of regulation and bureaucracy, leading to a higher form of societal order.",
                        "changing": "When Line 6 changes from Yin to Yang, it signifies a resistance to closure or a reluctance to let go of power, potentially prolonging a process that has reached its natural completion."
                    },
                    "5": {
                        "name": "Manifestation of Influence",
                        "meaning": "Miguel's street becomes a beacon of inspiration for the city, drawing crowds and attention not for defiance but for the magnetic allure of its orchestrated cacophony. Other urban enclaves seek to emulate the transformative effects of harmonious unity, recognizing the potent influence of alignment and cooperation in creating a more resonant society.",
                        "changing": "When Line 5 changes from Yang to Yin, it indicates a potential loss of authority or direction in the manifestation of influence, hinting at an incomplete realization or wavering leadership."
                    },
                    "4": {
                        "name": "Emergence of Recognition",
                        "meaning": "Neighboring neighborhoods begin to notice the enchanting harmony emanating from Miguel's street, sparking intrigue and appreciation for the newfound musical order. The external world starts to align with the inner resonance, laying the foundation for broader acknowledgment and recognition of the transformative power of harmony.",
                        "changing": "When Line 4 changes from Yin to Yang, it suggests an early external assertion or action that may disrupt the delicate balance and preparation for broader acceptance."
                    },
                    "3": {
                        "name": "Transition to Symphony",
                        "meaning": "As the symphony of the street grows in complexity and beauty, Miguel's conducting transitions from an internal realization to an external manifestation. The culmination of his efforts leads to a profound transformation in how the city perceives and interacts with the urban soundscape, offering a glimpse of harmony amid discord.",
                        "changing": "When Line 3 changes from Yang to Yin, it hints at a possible reluctance to fully embrace the external expression of the inner harmony, causing a pause in the evolution towards a unified symphony."
                    },
                    "2": {
                        "name": "Formation of Unity",
                        "meaning": "By teaching the denizens of the street to synchronize their actions and sounds, Miguel cultivates a sense of unity and coordination among them. Each individual component begins to contribute to the greater orchestral whole, aligning their rhythms and melodies to create a coherent symphony of city life.",
                        "changing": "When Line 2 changes from Yin to Yang, it indicates a disruption in the forming unity, suggesting a potential for premature actions or struggles in maintaining the harmonious structure."
                    },
                    "1": {
                        "name": "Emergence of Harmony",
                        "meaning": "At the outset, Miguel begins to perceive and unlock the musical potential inherent in the bustling street life of the city. He discovers a hidden symphony waiting to be conducted from the everyday sounds of vendors, brooms, and carts. This marks the birth of a new order within the chaos of urban noise.",
                        "changing": "When Line 1 changes from Yang to Yin, it signifies a moment of hesitation or missed opportunity, potentially stalling the nascent harmonious transformation."
                    }
                }
            },
            {
                "title": "The Wave Whisperer (Man vs. Nature)",
                "theme": "Ursula K. Le Guin",
                "summary": "On an ocean planet where storms threatened the floating cities, Marina developed a different approach to wave control. While other engineers built stronger barriers and more powerful stabilizers, she studied how waves naturally harmonized and canceled each other.\n\nThrough years of observation, she learned that every wave pattern had its counter-pattern, not as an opposite force but as a complementary rhythm. She designed resonance generators that didn't fight the waves but joined their dance, subtly influencing their patterns through synchronized vibrations.\n\nThe first tests were conducted during minor storms, with the generators creating ripples that seemed to whisper to the waves rather than shout at them. To everyone's amazement, the waves began responding, their chaotic patterns gradually shifting into more harmonious forms that flowed around the cities rather than crashing against them.\n\nMarina's method spread across the ocean world, transforming coastal defense from a battle against nature into a dance with it. The floating cities learned to move with the waves, their very structure becoming part of the ocean's rhythm rather than its adversary.",
                "lines_in_context": {
                    "6": {
                        "name": "name",
                        "meaning": "meaning",
                        "changing": "changing"
                    },
                    "5": {
                        "name": "name",
                        "meaning": "meaning",
                        "changing": "changing"
                    },
                    "4": {
                        "name": "name",
                        "meaning": "meaning",
                        "changing": "changing"
                    },
                    "3": {
                        "name": "name",
                        "meaning": "meaning",
                        "changing": "changing"
                    },
                    "2": {
                        "name": "name",
                        "meaning": "meaning",
                        "changing": "changing"
                    },
                    "1": {
                        "name": "name",
                        "meaning": "meaning",
                        "changing": "changing"
                    }
                }
            },
            {
                "title": "The Dream Synchronist (Man vs. Self)",
                "theme": "Jorge Luis Borges",
                "summary": "In the year 2157, when consciousness could be digitally mapped and analyzed, Dr. Sarah Chen discovered that human thoughts had natural frequencies, like musical notes in an endless symphony. While others sought to control or direct these thought-waves, she became interested in how they naturally harmonized.\n\nWorking with patients suffering from internal discord, she developed a method she called \"cognitive resonance.\" Rather than trying to change troubling thoughts, she helped people find their mind's natural rhythms, letting conflicting thoughts gradually align themselves into harmony.\n\nHer breakthrough came when she realized that every discordant thought pattern contained within it the seed of its own resolution. By helping patients attune to these inherent harmonies, she enabled their minds to find natural balance. The process couldn't be forced - it had to emerge through gentle attention and patient alignment.\n\nThe technique revolutionized psychological treatment. Instead of fighting mental discord, practitioners learned to help patients discover their mind's own healing rhythms. Thought patterns that seemed hopelessly conflicted would gradually synchronize when given the space to find their natural resonance.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion Through Harmony",
                        "meaning": "The closure of a cycle of alignment and balance, surrendering to change and refinement of experiences through embracing the natural rhythms of thought.",
                        "changing": "If a yang line replaces the natural yin line, it may indicate resistance to concluding the harmonization process, clinging to outdated patterns, or extending processes past their natural course."
                    },
                    "5": {
                        "name": "Manifestation of Balance",
                        "meaning": "Full engagement in finding external harmony, exemplifying leadership in embracing and executing harmonious thought patterns, emphasizing the authority in balancing internal and external realities.",
                        "changing": "When a yin line replaces the natural yang line, it signifies an incomplete realization of harmonious vision, potential indecision, or loss of authority in maintaining balance."
                    },
                    "4": {
                        "name": "Harmony in Preparation",
                        "meaning": "Preparation for external alignment, focusing on the stabilization of internal balances before external manifestation, emphasizing the importance of stable foundations.",
                        "changing": "If a yang line replaces the natural yin line, it may indicate premature external assertion without stable internal conditions, risking potential imbalance or discord."
                    },
                    "3": {
                        "name": "Transition to Balance",
                        "meaning": "The culmination of the inner realization and the commencement of external harmony seeking, enabling individuals to carry their balanced internal state outward.",
                        "changing": "When a yin line replaces the natural yang line, it signifies hesitation in transitioning to external harmonization, potentially leading to stagnation or resistance to change."
                    },
                    "2": {
                        "name": "Aligning Potential",
                        "meaning": "Supporting individuals in finding and structuring their mind's natural rhythms, assisting in the integration of conflicting thoughts through gentle attention and alignment.",
                        "changing": "If a yang line replaces the natural yin line, it suggests premature action or struggle in embracing the natural harmonies, leading to potential instability."
                    },
                    "1": {
                        "name": "Emergence of Harmony",
                        "meaning": "The initial recognition of natural thought frequencies and harmonies, understanding the potential for alignment and balance within discordant patterns.",
                        "changing": "When a yin line replaces the natural yang line, it indicates hesitation or resistance to embracing the inherent harmonies present in discordant thoughts."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "Gandhi's Salt March: Leading Through Natural Alignment",
        "subtitle": "\"Resonance\" in History",
        "summary": "In March 1930, when British colonial rule seemed unshakeable in India, Mahatma Gandhi initiated a movement that would demonstrate the extraordinary power of resonance in social change. Rather than confronting British authority directly, he chose to challenge the Salt Laws - regulations that prohibited Indians from collecting or selling salt, forcing them to buy it from British monopolies.\n\nGandhi's genius lay not in the magnitude of his opposition but in its simplicity and natural resonance with daily life. Salt was essential to everyone, rich and poor alike. By choosing to make salt from seawater - a basic right denied to all Indians - Gandhi created an action that naturally resonated with the entire population.\n\nThe march began with just 78 followers walking from Sabarmati Ashram to the coastal village of Dandi. But as they walked, something remarkable happened. The action created what historians would later call a \"cascade of participation.\" People from all walks of life, seeing the simple truth of the protest, began making salt in their own communities. The British found themselves unable to stop an action that was simultaneously everywhere and nowhere.\n\nThe brilliance of the campaign lay in how it allowed people to participate naturally, each in their own way. Unlike previous protests that required direct confrontation, the salt satyagraha invited people to simply exercise a natural right. The movement spread not through organization but through resonance, as people recognized their own struggle in Gandhi's simple act.\n\nBy the time Gandhi reached the sea and picked up a handful of salt, the entire nation had been transformed. The British authorities found themselves facing not an organization they could suppress, but a natural movement that flowed like water around their attempts at control. This demonstration of peaceful resonance would become a model for social movements worldwide.",
        "source": [
            "Gandhi: Prisoner of Hope by Judith Brown (1989)",
            "The Life of Mahatma Gandhi by Louis Fischer (1950)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Completion of Natural Movement",
                "meaning": "Represents the completion and dissolution phase of the natural movement, where the British authorities face a movement they cannot suppress, leading to a model for social movements worldwide.",
                "changing": "If a changing line occurs at this stage, it may signify resistance to closure or challenges in relinquishing power, potentially hindering the transformative completion of the movement."
            },
            "5": {
                "name": "Leadership and Execution",
                "meaning": "Signifies full engagement in the world as Gandhi's leadership leads to a national transformation, setting an example for social movements globally.",
                "changing": "When experiencing a changing line here, it could suggest challenges in leadership effectiveness or incomplete realization of the movement's vision, impacting the overall execution and impact."
            },
            "4": {
                "name": "Resonance in External World",
                "meaning": "Reflects the emergence of resonance in the external world, where the British authorities face a transformed nation resonating with Gandhi's peaceful movement, showcasing a natural flow around attempts at control.",
                "changing": "If a changing line appears at this stage, it might indicate disruptions in the resonance observed in the external world, potentially affecting the movement's impact and effectiveness."
            },
            "3": {
                "name": "Transition to External Action",
                "meaning": "Marks the culmination of inner realization transitioning into external action, symbolized by Gandhi reaching the sea and picking up salt, signifying the external manifestation of the movement.",
                "changing": "When a changing line occurs at this stage, it could symbolize a delay or hesitation in transitioning to external action, or challenges in fully realizing the external impact of the movement."
            },
            "2": {
                "name": "Alignment and Participation",
                "meaning": "Represents the active state where people from diverse backgrounds align with the protest, participating through their own actions in making salt, in alignment with Gandhi's leadership.",
                "changing": "A changing line here signifies a disruption in the alignment and participation phase, possibly indicating a challenge in maintaining unity or collective action."
            },
            "1": {
                "name": "Emergence of Resonance",
                "meaning": "The initial stage of the transformation, where the concept of resonance emerges through Gandhi's choice to challenge the Salt Laws, demonstrating a natural alignment with the populace.",
                "changing": "When the changing line occurs, it reflects a shift in the emergence of resonance, potentially indicating a disruption in the natural alignment."
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "The mesmerizing dance of Thunder's dynamic fervor intertwines with Lake's serene joy, crafting an enchanting symphony of vitality and delight.",
        "Platonic": "In the realm of Forms, the exuberant essence of Thunder's dynamic vigor finds its true expression within the tranquil harmony of the Lake, thus weaving a splendid tapestry of exhilaration and bliss.",
        "Taoist": "When Thunder's vigorous pulse meets the Lake's tranquil delight, life dances in harmonious accord.",
        "Tholonic": "In the realm of Joyful Concord, the Vibrant Energy unfurls with elegance, revealing its splendor through the art of Harmonious Expression.",
        "Thermodynamics": "The fusion of Thunder's kinetic energy with the tranquil entropy of the Lake creates a thermodynamic symphony of exhilarating equilibrium and delight."
    },
    "line_type": [
        "⚋",
        "⚊",
        "⚊",
        "⚋",
        "⚋",
        "⚊"
    ]
}