{
    "id": 47,
    "hexagram_code": "䷮",
    "name": "Depletion",
    "description": "A time of diminishing resources and challenging circumstances that demands resilience and strategic conservation. Like a lake during drought or batteries running low, this represents the need to manage scarcity while maintaining essential functions.",
    "king_wen": {
        "sequence": 47,
        "traditional_title": "Kun/Oppression/Exhaustion",
        "common_title": ""
    },
    "binary_sequence": 26,
    "trigrams": {
        "above": {
            "Trigram Number": 8,
            "Binary Decimal": 4,
            "Symbol": "☱",
            "Chinese Symbol": "兑",
            "Phonetic": "Duì",
            "English Translation": "Lake/Marsh",
            "English Symbol": "泽",
            "Meaning": "The Joyous",
            "Quality": "Joyful and Harmonious"
        },
        "below": {
            "Trigram Number": 6,
            "Binary Decimal": 2,
            "Symbol": "☵",
            "Chinese Symbol": "坎",
            "Phonetic": "Kǎn",
            "English Translation": "Water",
            "English Symbol": "水",
            "Meaning": "The Abysmal",
            "Quality": "Deep and Mysterious"
        }
    },
    "attributes": {
        "perspective": "Managing scarcity while maintaining core integrity",
        "nature": "Constraining, challenging, limiting",
        "action": "Conservation, adaptation, endurance",
        "success_through": "Careful resource management and maintaining optimism",
        "challenge": "Maintaining effectiveness and spirit during times of scarcity"
    },
    "lines": [
        {
            "position": 6,
            "name": "The Transcendent End",
            "meaning": "The final line marks the culmination of depletion, where what remains is refined into a state ready for rebirth. It signifies that every ending holds the seed of a new beginning.",
            "changing": "At this terminal phase, the exhausted yin completes its cycle by fully metamorphosing into yang energy, signaling the imminent arrival of regeneration and fresh potential."
        },
        {
            "position": 5,
            "name": "Crystalline Resolve",
            "meaning": "Amid the decay, a clarifying moment crystallizes determination. This line embodies the emergence of clarity and firmness in purpose during trying times.",
            "changing": "The energy of passive yin, when honed by resolve, transforms into a potent yang that consolidates dwindling resources into a concentrated drive for renewal."
        },
        {
            "position": 4,
            "name": "The Waning Beacon",
            "meaning": "Even as resources and energies diminish, a residual light offers wisdom. This line speaks to the deep understanding that comes from accepting limitations.",
            "changing": "In the balance of loss and learning, the remaining yin can be refashioned into a focused yang force, providing measured progress from the embers."
        },
        {
            "position": 3,
            "name": "Crossroads of Decline",
            "meaning": "Positioned in the heart of depletion, this line represents a critical juncture where decision and insight become essential. The path chosen now determines the future stability.",
            "changing": "By recognizing this pivotal moment, one can catalyze a reawakening of yang energy from the passive yin, setting the stage for a reformed outlook."
        },
        {
            "position": 2,
            "name": "Resisting Decay",
            "meaning": "A struggle emerges between diminishing resources and the will to persevere. This line reflects the tension of trying to maintain what is precious amid inevitable loss.",
            "changing": "Through determined action, the passive yin can begin to transform gradually into active yang, symbolizing the slow rekindling of strength."
        },
        {
            "position": 1,
            "name": "Hidden Fractures",
            "meaning": "At the inception of depletion, subtle cracks signal inherent vulnerability. This line advises careful observation of the weakening structure and cautious steps forward.",
            "changing": "A latent potential exists to stir a small burst of yang energy from a receding yin, hinting at the possibility of initiating renewal."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the balance between scarcity and sufficiency. The water below (danger) and lake above (joy) suggests that even in times of depletion, opportunities for renewal exist if resources are managed wisely.",
        "limitation": "The structure defines boundaries between necessary and wasteful expenditure. It establishes how conservation must occur within practical constraints, showing that effective management requires understanding true needs.",
        "contribution": "This configuration contributes to systemic evolution by demonstrating how systems adapt to and survive periods of scarcity. It shows how limitation can lead to innovation and more efficient use of resources.",
        "significance_in_thologram": "Represents a critical phase where systems must optimize and adapt to reduced resources. Functions as a model for how awareness navigates scarcity. Important in understanding how systems maintain integrity during challenging periods."
    },
    "transformations": {
        "no_moving_lines": "The situation calls for careful conservation and strategic adaptation. Continue managing resources wisely while maintaining core functions. Success comes through patient endurance.",
        "all_moving_lines": "Complete transformation of the resource situation is occurring. All aspects of scarcity are in flux. The depletion will lead to fundamental change, requiring careful attention to maintaining essential operations."
    },
    "hierarchy": {
        "order8child": "Depletion before renewal",
        "order8parent": "RESOLUTION; Moving Toward Completion"
    },
    "image": {
        "description": "The imagery chosen for the hexagram \"Depletion\" illustrates a profound interplay of universal patterns and hierarchical relationships, capturing the essence of scarcity and resilience. The stark contrast between the gnarled, withered branches and the ethereal forms suggests a dynamic relationship where chaos and structure coexist. This visual triad, linking the grounded roots with the airy, abstract shapes above, embodies the concept of emergent order, where constraints spur adaptation and innovation. The dark, foreboding trees represent constraining forces while the suspended, fluid forms indicate potential renewal and adaptability, echoing the balance between maintaining core integrity amidst limitation. The medium's contrast and the spatial dynamics highlight the choreography between depletion and optimism, mirroring metamorphosis through strategic conservation and endurance.",
        "file": "47.png"
    },
    "energy_cycle": "ascending",
    "stories": {
        "title": "Three Tales of 'Depletion'",
        "entries": [
            {
                "title": "The Final Canvas (Man vs. Man)",
                "theme": "Virginia Woolf",
                "short_story": "Amidst the chaos of an art studio filled with unfinished canvases, Clara stood, a custodian of raw potential begging to be shaped. Her brushes lay idle, unblemished by color, as she wrestled with the daunting task of creation. The initial impulse was there, a spark buried beneath layers of doubt. Yet for Clara, doubt transformed into resolve, and she picked up her brush, daring the canvas to reflect the depth within her soul. As she painted, lines and colors began to take form, each stroke a testament to the beauty of her vision. But soon, whispers of doubt threatened to douse her burgeoning flame, reminding her of the critics lurking in every shadow. The canvas taunted her, a battlefield between inspiration and hesitation. Just as despair loomed, a vision crystallized—she must paint for herself, not the world. With renewed vigor, her art blossomed, capturing an essence that transcended form. Mastery was found not in the acceptance of others but in the unrestrained fusion of freedom and realization. Finally, as dawn broke, Clara's creation stood complete—not hers alone but a testament to the eternal dance of inspiration, capturing the world in its timeless gaze.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "The artwork transcends personal creation, becoming an entity in its own right, engaging others' perceptions.",
                        "changing": "If the transcendence shifts back to control, it reflects an inability to let go, hindering broader influence."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Clara achieves control over her creation, standing at the height of her creative power.",
                        "changing": "A shift from mastery to caution indicates overestimation of one's power or capability."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "Clara begins aligning her vision with the physical world, gaining momentum in her creative endeavor.",
                        "changing": "An overreach may occur if manifestation pushes beyond sustainable limits."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Clara encounters resistance from her own doubts and external pressures, threatening her progress.",
                        "changing": "A retreat means the protagonist steps back before fully realizing her potential."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "The realization of her vision begins, setting the parameters of creative flow.",
                        "changing": "If formed too quickly, it results in misalignment and potential instability."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "The initial raw potential stirs within Clara, waiting to be transformed.",
                        "changing": "Hesitation or failure to act could bury the creative spark."
                    }
                }
            },
            {
                "title": "The Struggle Against the Tide (Man vs. Nature)",
                "theme": "Gabriel García Márquez",
                "short_story": "In a remote village, Santiago, a determined young fisherman, stood before the vast sea with an aging boat and dwindling supplies. The ocean—the final frontier, and his formidable adversary—beckoned him with its mysterious whispers of treasures hidden beneath its waves. The village elders spoke of a mythical catch that could end Santiago’s struggles, yet doubt cloaked their eyes, casting shadows over his hopes. He set out at dawn, the horizon a bright sliver against the ocean's relentless, murmuring expanse. The journey unfolded with deceptive tranquility, the sea’s surface mirroring the clouds' gentle drift. But as Santiago cast his nets, a great storm loomed, a dark crescendo of nature’s might. The winds howled, waves crashed, threatening to engulf his fragile vessel. Fear gripped him, yet deep within, a primal force ignited—a covenant with the sea. He persevered, channeling every flicker of strength. In the storm's wake, Santiago glimpsed a shimmer—a silver-scaled bounty entangled in his nets. Triumph and exhaustion intertwined as he realized that the true catch was not just the fish but the understanding that nature’s trials were part of a cycle. With resilience, he had grasped a fragment of divine order from chaos, returning home with not just bounty, but a profound connection to the world's endless rhythm.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "Santiago's journey concludes with understanding, as his experience transcends personal gain to connect with universal wisdom.",
                        "changing": "If he clings to control instead of learning from the experience, it prevents the evolution of his understanding."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Santiago gains control over his destiny by confronting the sea, reaching the peak of his abilities.",
                        "changing": "If his mastery leads to arrogance, it risks undermining his success."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "Santiago begins to see his dreams align with reality as he gains momentum in his struggle.",
                        "changing": "Overreaching ambition may lead to an unsustainable expansion of his efforts."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Santiago faces the storm, a manifestation of nature's opposition to his quest.",
                        "changing": "Retreating would indicate exhaustion before reaching full realization of his potential."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Santiago shapes his potential, defining his creative path amidst the elements.",
                        "changing": "Premature actions could lead to instability or misalignment with the natural flow."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "Santiago is filled with raw, unshaped potential as he sets out to sea.",
                        "changing": "Hesitation or failure to act delays the creative impulse, sinking his hopes."
                    }
                }
            },
            {
                "title": "The Sculptor's Dilemma (Man vs. Self)",
                "theme": "Haruki Murakami",
                "short_story": "In a quaint atelier, Hiroshi sat amidst blocks of marble, each a silent guardian of unspoken truths. His hands tingled with anticipation, yet a paralysis gripped him, holding his creative spirit captive. The potential was raw, boundless within him, but the first chisel blow eluded Hiroshi. Days turned into hollow echoes of indecision until a profound realization dawned. He embraced the marble, feeling its story entwine with his own. His chisel danced, weaving visions that defied initial hesitation. Yet, as the sculpture emerged, imperfections rose to challenge him. Each flaw stopped Hiroshi, the marble mocking his ambition. Frustration welled. For every flaw, a resolution awaited. Accepting flaws as integral to beauty, Hiroshi's hands found new rhythm, harmonizing imperfection with grace. A masterpiece rose, seemingly alive, eyes and soul entwined within the stone. At the zenith of his art, a transcendent moment arrived; his pride severed, Hiroshi released the sculpture to the world. His creation, now its own, rearranged untold echoes in the hearts of those who witnessed it, signaling an endless cycle of creation.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence",
                        "meaning": "The sculpture transcends Hiroshi's creation, engaging others beyond personal attachment.",
                        "changing": "Clinging to the sculpture might mean Hiroshi's inability to let go, hindering its broader impact."
                    },
                    "5": {
                        "name": "Mastery",
                        "meaning": "Hiroshi stands at the height of his creative power, fully controlling his art.",
                        "changing": "Misjudgment or arrogance could undermine his success if mastery faltered back to uncertainty."
                    },
                    "4": {
                        "name": "Manifestation",
                        "meaning": "Hiroshi aligns his vision with reality, gaining momentum in his creative endeavor.",
                        "changing": "Overreaching could lead to an unsustainable burden, risking collapse."
                    },
                    "3": {
                        "name": "Conflict",
                        "meaning": "Imperfections challenge Hiroshi's progress, stalling his creation.",
                        "changing": "Retreat might mean exhaustion before realizing his full potential."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Hiroshi begins shaping his potential, establishing a creative path.",
                        "changing": "Hasty formation might misalign with the natural artistic flow."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "Raw potential stirs within Hiroshi, awaiting transformation.",
                        "changing": "Hesitation could stifle the creative spark, delaying creation."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "The Long March of Mao",
        "subtitle": "\"Depletion\" in History",
        "short_story": "In October 1934, Mao Zedong and the Chinese Communist Party faced near annihilation. Surrounded by Nationalist forces and severely depleted in resources, they embarked on what would become known as the Long March - one of history's most remarkable examples of endurance under extreme depletion. Beginning with 86,000 troops, the Communists were forced to abandon their stronghold in Jiangxi Province, beginning a retreat that would cover over 6,000 miles through some of China's most treacherous terrain. Their resources were desperately scarce: soldiers survived on a daily ration of a handful of rice, many without shoes or adequate clothing. They crossed 18 mountain ranges and 24 rivers, often while under attack from hostile forces and dealing with severe weather conditions. The march depleted their numbers drastically - only about 8,000 of the original marchers completed the journey. Yet this period of extreme hardship ultimately strengthened the movement. The survivors developed incredible resilience and resourcefulness, and the march became a powerful symbol of determination against overwhelming odds. When they finally reached their destination in Yan'an, the remaining force had been forged into a hardened core that would eventually lead the Communist Party to victory in 1949.",
        "source": [
            "The Long March: The True History of Communist China's Founding Myth by Sun Shuyun (Doubleday, 2006)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Completion - Closure and New Beginnings",
                "meaning": "Concluding the cycle, this stage signals the closure of a phase, surrendering to change, and refining experiences for new beginnings. It represents the end of a chapter and the preparation for fresh starts and transformations. When the line's yin or yang value changes to its opposite, there is a shift from clinging to power or resisting closure to embracing necessary endings and facilitating the process of renewal and regeneration.",
                "changing": "changing line"
            },
            "5": {
                "name": "Action - Full Engagement and Leadership",
                "meaning": "Representing full engagement in the external world, this stage embodies leadership and the active execution of potential. It signifies taking charge and leading with authority, ensuring the realization of objectives and visions. When the line's yin or yang value changes to its opposite, there is a shift from indecision or incomplete realization to assertive decision-making and the fulfillment of responsibilities with clarity and confidence.",
                "changing": "changing line"
            },
            "4": {
                "name": "Adaptation - Flexibility and Preparation",
                "meaning": "In the outer world cycle, this stage emphasizes alignment with external forces and preparation for action. It calls for adaptability and readiness to respond to changing circumstances, setting the stage for effective engagement with the environment. When the line's yin or yang value changes to its opposite, there is a shift from premature assertion to strategic preparedness, allowing for a more grounded and effective approach to external challenges.",
                "changing": "changing line"
            },
            "3": {
                "name": "Transition - Culmination and Transition",
                "meaning": "As the culmination of the inner cycle, this stage marks the transition to external action, signifying the completion of internal processes and readiness for outward manifestations. It symbolizes the threshold of change and the evolution towards tangible outcomes. When the line's yin or yang value changes to its opposite, there is a shift from stagnation or hesitation to proactive progression, urging the realization of inner transformations in the external world.",
                "changing": "changing line"
            },
            "2": {
                "name": "Alignment - Forming Support",
                "meaning": "At this stage, receptivity and alignment with supportive forces come into play, structuring the potential for growth and development. It signifies the need for stability and harmony to nurture emerging possibilities. When the line's yin or yang value changes to its opposite, there is a shift from premature action or instability to a solid foundation that fosters growth and resilience in the face of challenges.",
                "changing": "changing line"
            },
            "1": {
                "name": "Emergence - Initiating Potential",
                "meaning": "This stage represents the birth of potential and the initiation of a force. The emergence of new beginnings and the spark of action are embodied in this transformation. When the line's yin or yang value changes to its opposite, a decisive shift occurs, signaling a transition from hesitation or weakness to a bold step forward in embracing new opportunities and overcoming obstacles.",
                "changing": "changing line"
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "In the dance of the psyche, the deepest mysteries reveal themselves when we harmonize with the joyful resonance of the Self.",
        "Platonic": "The emergence of true profundity is discovered in the harmonious balance of joy and order.",
        "Taoist": "In the dance of vibrant balance, the essence of deep mystery reveals itself.",
        "Tholonic": "In the dance between profound depth and radiant harmony, hidden insights unfold, whispered through a joyous and unified expression.",
        "Thermodynamics": "The revelation of deep enigma emerges as a thermodynamic waltz in a state of joyful equilibrium.",
        "general": "In the dance of joy and mystery, profound insights emerge through harmonious balance.",
        "explanation": "The Abysmal, symbolizing depth and mystery, combines with The Joyous, representing joy and harmony, to create a state where deep understanding arises. This union reflects a balance between the unknown and the uplifting, allowing hidden truths to surface through a harmonious interplay of contrasting energies, much like a dance that reveals insights in the equilibrium of its movements."
    },
    "line_type": [
        "─ ─",
        "───",
        "───",
        "─ ─",
        "───",
        "─ ─"
    ]
}