{
    "id": 58,
    "hexagram_code": "䷹",
    "name": "Resonance",
    "description": "The joyful exchange of energy and ideas between compatible elements. Like harmonious music or synchronized oscillators, this represents the natural alignment of complementary forces and the pleasure of mutual enhancement.",
    "king_wen": {
        "sequence": 58,
        "traditional_title": "Dui/The Joyous, Lake",
        "common_title": ""
    },
    "binary_sequence": 27,
    "trigrams": {
        "above": {
            "Trigram Number": 8,
            "Binary Decimal": 4,
            "Symbol": "☱",
            "Chinese Symbol": "兑",
            "Phonetic": "Duì",
            "English Translation": "Lake/Marsh",
            "English Symbol": "泽",
            "Meaning": "The Joyous",
            "Quality": "Joyful and Harmonious"
        },
        "below": {
            "Trigram Number": 8,
            "Binary Decimal": 4,
            "Symbol": "☱",
            "Chinese Symbol": "兑",
            "Phonetic": "Duì",
            "English Translation": "Lake/Marsh",
            "English Symbol": "泽",
            "Meaning": "The Joyous",
            "Quality": "Joyful and Harmonious"
        }
    },
    "attributes": {
        "perspective": "The self-reinforcing power of harmonious interaction",
        "nature": "Harmonious, receptive, interactive",
        "action": "Sharing joy, creating harmony",
        "success_through": "Open exchange and mutual appreciation",
        "challenge": "Maintaining depth while sharing openly"
    },
    "lines": [
        {
            "position": 6,
            "name": "The Return to Stillness",
            "meaning": "In the concluding line, the outward momentum settles into a profound, contemplative silence. It reflects the completion of a cycle and the integration of transformative energies.",
            "changing": "The excess of active yang recedes back into the quiet, stable yin, inviting a reflective pause and the promise of renewal in the cycle ahead."
        },
        {
            "position": 5,
            "name": "The Climax of Resonance",
            "meaning": "At its peak, this line symbolizes the full florescence of energy where creative insight and potent action manifest. It is the culmination of harmonized efforts and resonant power.",
            "changing": "The deep, calm reservoir of yin erupts into the brilliance of yang, signifying the height of transformation and dynamic achievement."
        },
        {
            "position": 4,
            "name": "The Harmonious Bridge",
            "meaning": "Acting as a pivot, this line connects inner potential with outer expression. It represents a moment of equilibrium where dual energies merge to form a pathway for transformation.",
            "changing": "A transformative stage where the maintaining nature of yin gives way to the innovative spark of yang, establishing a balanced conduit between forces."
        },
        {
            "position": 3,
            "name": "The Echoing Call",
            "meaning": "This line signifies the resonance that travels outward, echoing the inner call for change. It is a clarion signal to maintain balance amid emerging dynamism.",
            "changing": "A transition in which the soft, nurturing yin progressively channels its latent strength into the radiant expression of yang energy."
        },
        {
            "position": 2,
            "name": "The Vibrant Exchange",
            "meaning": "This line embodies the mutual influence and exchange between opposing energies. It lays the foundation for balanced interaction and creative transformation.",
            "changing": "An unfolding process where the inward, reflective yin begins to merge with emergent yang action, creating a harmonious interplay of forces."
        },
        {
            "position": 1,
            "name": "The Stirring Origin",
            "meaning": "This line represents the initial impulse, the seed from which transformation and resonance emerge. It signifies the awakening of energy and the start of a dynamic process.",
            "changing": "A subtle awakening where gentle yin receptivity begins to kindle a spark of yang initiative, marking the transition from potential to active force."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "The hexagram represents the balance between giving and receiving. The doubled lake shows how joy multiplies through sharing, demonstrating that mutual exchange creates abundance.",
        "limitation": "The structure defines boundaries between genuine and superficial connection. It establishes how sharing must maintain authenticity, showing that true resonance requires honesty.",
        "contribution": "This configuration contributes to systemic evolution by demonstrating how harmonious interaction enhances all participants. It shows how aligned energies create greater effects than isolated ones.",
        "significance_in_thologram": "Represents the critical role of harmonious interaction in evolution. Functions as a model for how awareness grows through exchange. Important in understanding how systems benefit from synchronized cooperation."
    },
    "transformations": {
        "no_moving_lines": "The situation calls for maintaining joyful exchange. Continue sharing openly while preserving authenticity. Success comes through genuine interaction.",
        "all_moving_lines": "Complete transformation through resonance is occurring. All aspects of connection are active. The harmony will create fundamental change, requiring careful attention to maintaining authentic exchange."
    },
    "hierarchy": {
        "order8child": "Fulfilled joy",
        "order8parent": "COMPLETION & RENEWAL; Return to Source"
    },
    "image": {
        "description": "The choice of a jazz ensemble, Impressionism, music as a medium, and Pablo Picasso as the artist symbolizes the hexagram's theme of completion and renewal through dynamic harmony and creative spontaneity. Jazz, with its fluidity and improvisation, mirrors the Tholonic Model's principles of awareness and interaction, embracing integration and contribution as musicians respond to each other, creating a transcendent whole. Impressionism captures fleeting moments of joy and fulfillment, resonating with the idea of fulfilled joy and renewal. The musical medium enhances the holistic and non-tangible aspects of resonance, echoing tholonic energy's influence in shaping experiences and connections. Picasso, renowned for breaking conventional boundaries and symbolic expression, embodies universal love and creativity, driving the endless renewal and expansive patterns of the Thologram, reflecting a return to the source of awareness and intention.",
        "file": "58.png"
    },
    "energy_cycle": "ascending",
    "stories": {
        "title": "Three Tales of \"Resonance\"",
        "entries": [
            {
                "title": "The Harmonious Duet (Man vs. Man)",
                "theme": "Gabriel Garcia Marquez",
                "short_story": "In a vibrant village square, amidst the chaos of a market day, two musicians discovered a world of harmony yet untapped. Santiago, with his guitar, played notes that whispered of forgotten dreams, while Lucia, her flute poised like a bird on a branch, breathed melodies that danced in the wind. At first, their music was raw, unshaped, a cacophony in search of unity. Hesitation filled Santiago as he faltered, nearly losing the creative spark that had brought them together. But as Lucia's notes wove through his own, they found a rhythm, a path of understanding. Their music began to form, bouncing off the walls, catching the attention of passersby who stopped to listen, caught in the web of sound. Just as conflict seemed to threaten their newfound harmony, with a crowd clamoring for different tunes, they stood firm, resolute in their shared vision. As their playing aligned with the wind, and the market's hum, they gained momentum, the notes resonating with the beat of human life. At last, Santiago and Lucia transcended their music; it belonged to the square, to the people. And when silence fell, it was a shared breath of satisfaction, a moment of collective transcendence.",
                "lines_in_context": {
                    "6": {
                        "name": "Collective Transcendence",
                        "meaning": "The music, once the musicians' own, becomes a gift to the community, a shared creation that exists beyond its creators.",
                        "changing": "If yang changes to yin, it signifies clinging to control instead of allowing the music to take on its own life, potentially stifling its impact."
                    },
                    "5": {
                        "name": "Mastery and Unity",
                        "meaning": "The musicians gain full command of their creation, reaching the peak of their synergy, creating a unified and powerful composition.",
                        "changing": "If yang changes to yin, it suggests a risk of arrogance or misjudgment that could undermine their successful collaboration."
                    },
                    "4": {
                        "name": "Gaining Momentum",
                        "meaning": "Their music finds alignment with the external environment, the village's bustle turning into accompaniments, and gaining wider audience engagement.",
                        "changing": "If yin changes to yang, it may indicate overreaching ambition, leading to unsustainable growth in their musical influence."
                    },
                    "3": {
                        "name": "Meeting the Crowd",
                        "meaning": "The musicians face opposition from the crowd, whose desires could divert their artistic intent, testing their resolve to maintain focus.",
                        "changing": "If yang changes to yin, it indicates retreat or exhaustion before achieving full creative realization, leading to potential compromise."
                    },
                    "2": {
                        "name": "Harmony in Formation",
                        "meaning": "The initial clamor begins to form melodies, developing a cohesive structure as the musicians work through their differences.",
                        "changing": "If yin changes to yang, it signifies premature action, creating instability or misalignment with the natural flow of their creative intentions."
                    },
                    "1": {
                        "name": "Creative Awakening",
                        "meaning": "The raw potential of music brims in the air, as the musicians are filled with the first impulses of creation, yet to find form.",
                        "changing": "If yang changes to yin, it suggests hesitation or failure to act, delaying the creative impulse before it takes flight."
                    }
                }
            },
            {
                "title": "The Symphony of the Elements (Man vs. Nature)",
                "theme": "Gabriel Garcia Marquez",
                "short_story": "In the heart of the Amazon, Vicente, a gifted musician, perceived the jungle not merely as an environment but as an orchestra, waiting for a conductor. With each note composed, the jungle echoed its approval, flowers blossoming to the rhythm and rivers running in concert. As his symphony took shape, it seemed the very elements bent to his melody. But one day, a violent storm shattered his equipment, silencing his creation. Undeterred, Vicente rebuilt from nature itself, crafting instruments from bamboo reeds and animal sinews. As he resumed his symphony, the jungle danced anew, the wind his strings, the rain his percussion. The music transcended his control, enveloping the world in an uncontainable harmony, transforming Vicente into a legend, the man who sang with the earth.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcendence into Legend",
                        "meaning": "Vicente's creation achieves a life of its own, reaching beyond his influence and becoming a myth.",
                        "changing": "If yang changes to yin, it indicates an attempt to retain personal control over his music, limiting its potential to become legendary."
                    },
                    "5": {
                        "name": "Mastery of Harmony",
                        "meaning": "Vicente commands the symphony with skill, orchestrating the entire jungle to play at his behest.",
                        "changing": "If yang changes to yin, it suggests that his confidence may tip into arrogance, risking the unraveling of the harmony he has orchestrated."
                    },
                    "4": {
                        "name": "Manifestation in Nature",
                        "meaning": "His music physically manifests, influencing the natural world and gaining momentum.",
                        "changing": "If yin changes to yang, it may depict a reckless ambition that disrupts the delicate balance of the elements, causing disharmony."
                    },
                    "3": {
                        "name": "Conflict with the Storm",
                        "meaning": "Vicente faces a devastating storm that threatens to destroy his symphony.",
                        "changing": "If yang changes to yin, it signifies a withdrawal before fully realizing his vision, succumbing to the chaos of nature."
                    },
                    "2": {
                        "name": "Formation of Nature's Instruments",
                        "meaning": "Vicente begins crafting instruments from the jungle, shaping his creative vision.",
                        "changing": "If yin changes to yang, it suggests rash improvisation, leading to an unstable symphony lacking coherence."
                    },
                    "1": {
                        "name": "Emergence of Musical Potential",
                        "meaning": "The jungle stirs with raw potential as Vicente hears the initial whispers of harmony.",
                        "changing": "If yang changes to yin, it reflects hesitance or inability to harness nature's music, stalling the blossoming of his symphony."
                    }
                }
            },
            {
                "title": "The Whisper of Creation (Man vs. Self)",
                "theme": "Ray Bradbury",
                "short_story": "In the quiet suburb of Elmwood, Harold, an unassuming inventor brimming with ideas, felt the first stirrings of an extraordinary creation. Yet, his hands trembled, unsure of how to give shape to the whirlwind of possibilities swirling within his mind. The night was his canvas; the glow of his workshop, his muse. Harold began gathering electronics, molding them into a rudimentary shape but soon encountered the cold resistance of malfunction and miscalculation, questioning if he dared proceed. As dawn broke, his persistence carved a path through opposition, the components finally aligning into a remarkable device. The invention hummed to life, resonating with the pulse of the universe itself, capturing the fascination of distant observers. Commanding his creation with quiet confidence, Harold realized he stood on the precipice of mastery, guiding its potential with deft hands. Yet, as its influence grew, he felt the gentle pull of its endless reach, calling to become part of a greater tapestry, a thread in the vast fabric of discovery. If he could only let go, his creation would transcend his own understanding, a gift to the world, evolving beyond him.",
                "lines_in_context": {
                    "6": {
                        "name": "Transcending Boundaries",
                        "meaning": "Harold perceives his invention as a gift to the world, shifting beyond personal possession to influence others.",
                        "changing": "If yang changes to yin, Harold might cling to control, preventing the creation from evolving into something grander."
                    },
                    "5": {
                        "name": "Commanding Mastery",
                        "meaning": "Harold achieves mastery over his creation, honing its capabilities to align with his vision.",
                        "changing": "If yang changes to yin, it suggests Harold risks undermining his success through arrogance or miscalculated judgment."
                    },
                    "4": {
                        "name": "Gaining Momentum",
                        "meaning": "The creation gathers pace as it aligns with Harold's external reality, gaining the intrigue of others.",
                        "changing": "If yin changes to yang, it may indicate Harold's ambition outpaces sustainable growth, risking overextension."
                    },
                    "3": {
                        "name": "Facing Resistance",
                        "meaning": "Harold encounters challenging malfunctions, external obstacles that threaten his creative venture.",
                        "changing": "If yang changes to yin, Harold may retreat or lose momentum before realizing his invention's full potential."
                    },
                    "2": {
                        "name": "Shaping Potential",
                        "meaning": "Harold begins concretizing his vision, defining his invention through trial and error.",
                        "changing": "If yin changes to yang, it signifies that Harold acts prematurely, leading to instability or misalignment of his efforts."
                    },
                    "1": {
                        "name": "Creative Stirring",
                        "meaning": "Harold feels the initial creative force bubbling within, yet he lacks direction to shape it.",
                        "changing": "If yang changes to yin, Harold hesitates, potentially stalling the drive to transform his ideas into reality."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "The Woodstock Festival",
        "subtitle": "\"Resonance\" in History",
        "short_story": "In August 1969, what began as a music festival became a legendary example of spontaneous human harmony and resonance. Despite crowds swelling to over 400,000 people, far beyond capacity, and challenging weather conditions that could have sparked chaos, Woodstock demonstrated an extraordinary spirit of peaceful cooperation. When food ran short, people shared what they had. When rain turned the fields to mud, strangers helped strangers find shelter. The music itself became a medium of mass resonance - when Richie Havens improvised \"Freedom\" on the spot, when Jimi Hendrix transformed the national anthem, when half a million people swayed together to \"i Feel Like I'm Fixin' to Die Rag,\" the festival transcended mere entertainment to become a demonstration of collective harmony. Even the local townspeople, initially alarmed by the invasion of hippies, began providing free food and assistance. The festival revealed how joy could be both intimate and universal, personal and collective. Max Yasgur, the dairy farmer who provided his land for the festival, later said he witnessed \"the greatest demonstration of compassion and consideration that America has ever seen.",
        "source": [
            "\"Woodstock: Three Days That Rocked the World\" by Mike Evans",
            "Paul Kingsbury (Sterling, 2009)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Completion in Harmony",
                "meaning": "The closing of the festival marked a return to individual experiences, surrendering to the transformational power of the collective event. Participants refined their understanding of unity, signaling the end of a cycle that emphasized the beauty of shared experiences and the essence of togetherness.",
                "changing": "Line 6 changed to Yang: The completion in harmony may face resistance to closure, clinging to power, or an extended presence when the transformative cycle has naturally concluded."
            },
            "5": {
                "name": "Manifestation of Unity",
                "meaning": "Amidst the festival, the full manifestation of unity and resonance became evident, as participants engaged fully in shared experiences, leading with leadership and executing the potential for collective harmony. The vision of unity reached its peak as the community embraced a sense of oneness.",
                "changing": "Line 5 changed to Yin: The manifestation of unity may face indecision or loss of authority, hindering the complete realization of the vision of collective harmony."
            },
            "4": {
                "name": "Emergence of Cooperation",
                "meaning": "Externally, the emergence of cooperation became apparent as participants aligned with external forces and prepared for further actions rooted in collaboration and mutual understanding. The foundation of cooperation was laid, setting the stage for expanded harmony.",
                "changing": "Line 4 changed to Yang: The emergence of cooperation encounters premature external assertion or instability, challenging the preparedness for further actions rooted in collaboration."
            },
            "3": {
                "name": "Transition to Unity",
                "meaning": "The culmination of inner realization led to a transition where the spirit of unity was ready to manifest externally. Participants stood at the threshold of change, poised to carry the essence of harmony into the outer world, marking a transformative shift in collective consciousness.",
                "changing": "Line 3 changed to Yin: The transition to unity faces hesitation in carrying the inner realization outward, potentially leading to stagnation in the manifestation of collective consciousness."
            },
            "2": {
                "name": "Formation of Fellowship",
                "meaning": "As the festival progressed, the formation of a unique fellowship unfolded, characterized by shared resources, mutual support, and the structuring of communal bonds. Participants aligned in their efforts to create a space of inclusivity and collaboration.",
                "changing": "Line 2 changed to Yang: The formation of fellowship encounters premature action or instability, disrupting the harmonious structuring of communal bonds."
            },
            "1": {
                "name": "Emergence of Harmony",
                "meaning": "In the initial stage, the Woodstock Festival emerged as a gathering of music enthusiasts seeking connection and unity. The spirit of cooperation and harmony began to take shape, setting the tone for a transformative event where individuals came together as a collective.",
                "changing": "Line 1 changed to Yin: The emergence of harmony faces a moment of hesitation and potential weakness, challenging the initial birth of unity."
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "In the symphony of Joyful and Harmonious elements, the dual expression amplifies the resonance of shared delight and mutual enrichment.",
        "Platonic": "The confluence of Joy and Harmony, through their twofold expressions, magnifies mutual delight and augments the wealth of shared enrichment.",
        "Taoist": "In the dance of Joy and Harmony, when we hold both with gentle hands, the shared delight deepens, and harmony blooms.",
        "Tholonic": "When Joyful and Harmonious energies dance in mutual resonance, they birth a magnified synergy of collective delight and profound harmony.",
        "Thermodynamics": "The confluence of Joyful and Harmonious energies, through their mutual expression, elevates the entropy of a shared symphony, resonating with profound order and delight.",
        "general": "When Joy and Harmony unite, their shared resonance amplifies delight and enriches the collective spirit.",
        "explanation": "The trigrams of 'The Joyous' both embody Joyful and Harmonious qualities, creating a powerful synergy. This duality enhances the resonance between them, fostering a deeper shared delight and enriching the collective spirit. The mutual expression of these energies amplifies their impact, much like a harmonious melody that grows richer and more profound when played together, illustrating how their union elevates the experience of joy and harmony."
    },
    "line_type": [
        "─ ─",
        "───",
        "───",
        "─ ─",
        "───",
        "───"
    ]
}