{
    "id": 36,
    "hexagram_code": "䷣",
    "name": "Obscured Light",
    "description": "Intelligence and clarity operating under constraints. Like the sun below the earth, this represents inner radiance maintaining its strength despite external darkness.",
    "king_wen": {
        "sequence": 36,
        "traditional_title": "Ming I",
        "common_title": "Darkening of the Light"
    },
    "binary_sequence": 5,
    "trigrams": {
        "above": {
            "Trigram Number": 2,
            "Binary Decimal": 0,
            "Symbol": "☷",
            "Chinese Symbol": "坤",
            "Phonetic": "Kūn",
            "English Translation": "Earth",
            "English Symbol": "地",
            "Meaning": "The Receptive",
            "Quality": "Receptive and Nurturing"
        },
        "below": {
            "Trigram Number": 7,
            "Binary Decimal": 5,
            "Symbol": "☲",
            "Chinese Symbol": "离",
            "Phonetic": "Lí",
            "English Translation": "Fire",
            "English Symbol": "火",
            "Meaning": "The Clinging",
            "Quality": "Bright and Radiant"
        }
    },
    "attributes": {
        "perspective": "Wisdom persisting through adversity",
        "nature": "Hidden strength",
        "action": "Preservation",
        "success_through": "Internal cultivation",
        "challenge": "Sustaining clarity amid darkness"
    },
    "lines": [
        {
            "position": 6,
            "name": "Diminished Glow",
            "meaning": "In the final stage, excess radiance can become overwhelming, risking the loss of subtlety and balance if not carefully managed.",
            "changing": "A dynamic equilibrium is required as the lingering yin begins to integrate with a potent yang force, ensuring that transformation remains balanced."
        },
        {
            "position": 5,
            "name": "Luminous Beacon",
            "meaning": "A pivotal juncture where clarity and purpose shine forth, dispelling doubts and guiding the way forward with renewed energy.",
            "changing": "The suppressed yin qualities now erupt into enlightening yang brilliance, marking a transformation that illuminates the path ahead."
        },
        {
            "position": 4,
            "name": "Subtle Radiance",
            "meaning": "The inherent light begins to break through the haze, suggesting that wisdom and innate strength are emerging from humble origins.",
            "changing": "A quiet yin energy gradually shifts into an assertive yang expression when inner truths are acknowledged."
        },
        {
            "position": 3,
            "name": "Veiled Impulse",
            "meaning": "A moment when inner urges are obscured by doubt and uncertainty; caution is advised in acting without clear vision.",
            "changing": "A restrained yin impulse can transform into a confident yang initiative as clarity overcomes hesitation."
        },
        {
            "position": 2,
            "name": "Glimmering Hope",
            "meaning": "An early sign that beneath darkened outward appearances, hope and opportunity are beginning to emerge, waiting to be seized.",
            "changing": "The yielding yin quality slowly unfolds into a decisive yang action, symbolizing the delicate shift from uncertainty to clarity."
        },
        {
            "position": 1,
            "name": "Hidden Spark",
            "meaning": "A subtle starting point where a faint light appears despite prevailing obscurity; the moment of potential that requires careful nurturing.",
            "changing": "A muted yin presence can gradually ignite into a vibrant yang force when recognized and cultivated."
        }
    ],
    "tholonic_analysis": {
        "negotiation": "Balance between expression and preservation. The hexagram shows how wisdom can thrive even when constrained. Represents negotiation between visibility and protection.",
        "limitation": "Creates protection through concealment. The earth above contains and protects the fire below, showing how limitation can preserve rather than extinguish.",
        "contribution": "Contributes by demonstrating how awareness can persist and develop under adverse conditions. Like a seed growing underground, this constraint enables future emergence.",
        "significance_in_thologram": "Represents crucial phases where development must occur hidden from view. Shows how temporary constraint can strengthen rather than weaken a system."
    },
    "transformations": {
        "no_moving_lines": "A period where wisdom must be cultivated internally. Accept this time of restricted expression as necessary for development. Focus on inner growth.",
        "all_moving_lines": "Complete transformation from concealment to expression approaching. The period of constraint has served its purpose. Prepare for emergence while maintaining gained wisdom."
    },
    "hierarchy": {
        "order8child": "Hidden transformation",
        "order8parent": "TRANSFORMATION; Active Change"
    },
    "image": {
        "description": "In this representation of the hexagram \"OBSCURED LIGHT,\" the camouflaged chameleon symbolizes hidden transformation, embodying the principle of negotiation as it balances between visibility and invisibility, mirroring the dynamic of change and adaptation inherent in awareness. Styled in surrealism, this portrayal transcends ordinary perception to reveal deeper layers of reality, akin to the Thologram's recursive exploration of existence. Georgia O'Keeffe, recognized for capturing the essence beyond the apparent, parallels the Tholonic model's emphasis on awareness as fundamental. The choice of gouache enhances the vivid yet nuanced textures, reflecting the interplay of contribution and limitation — highlighting the chameleon’s integration into its environment while maintaining distinctiveness. This composition, as award-winning and highly symbolic, encapsulates the essence of active change, unmasking the subtleties of transformative processes within both the physical and abstract realms.",
        "file": "36.png"
    },
    "energy_cycle": "ascending",
    "stories": {
        "title": "Three Tales of \"Obscured Light",
        "entries": [
            {
                "title": "The Hidden Scholar (Man vs. Man)",
                "theme": "The Brothers Grimm",
                "summary": "In a kingdom where learning had been forbidden, lived a wise woman who taught children in secret. By day, she worked as a humble washerwoman, but at night, her cellar became a sanctuary of knowledge. She taught reading by candlelight, drawing letters in ash, and whispered mathematics like fairy tales. When soldiers searched the village, they found only drying linens and soap bubbles, never suspecting that beneath their feet, future scholars were taking root. Years passed until finally, when the cruel king fell, her students emerged as learned leaders who rebuilt the kingdom with wisdom preserved through darkness.",
                "lines_in_context": {
                    "6": {
                        "name": "Refinement",
                        "meaning": "Completion of a hidden cycle, surrendering to change and refining wisdom for a new era of enlightenment",
                        "changing": "Signifies clinging to power or resistance to the natural progression of change"
                    },
                    "5": {
                        "name": "Engagement",
                        "meaning": "Full leadership and execution of preserved wisdom, emergence of learned leaders shaping the kingdom's future",
                        "changing": "May represent incomplete realization or a struggle with decision-making in leadership roles"
                    },
                    "4": {
                        "name": "Alignment with Forces",
                        "meaning": "Preparation for external manifestation and action, aligning with the changing external environment",
                        "changing": "Indicates premature external assertion or lack of stability before revealing the truth"
                    },
                    "3": {
                        "name": "Culmination",
                        "meaning": "The completion of inner realization and the transition towards revealing wisdom to the world from a place of secrecy",
                        "changing": "Signifies a delayed revelation or the readiness to share insights with others"
                    },
                    "2": {
                        "name": "Alignment",
                        "meaning": "The covert structuring of potential into knowledge, quietly nurturing growth and understanding in the shadows",
                        "changing": "May signify premature exposure or destabilizing of carefully built foundations"
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "The beginning of a hidden transformation, where potential takes form in secrecy and preparation for change",
                        "changing": "Indicates hesitation or a surprising reveal of a hidden truth"
                    }
                }
            },
            {
                "title": "The Winter Garden (Man vs. Nature)",
                "theme": "Murasaki Shikibu",
                "summary": "Deep within the Imperial gardens, Master Chen tended a precious plum tree through the harshest winter ever recorded. While other gardeners abandoned their posts, he built an intricate shelter of bamboo and oil paper, creating a small pocket of warmth within the frozen landscape. Each night, he placed heated stones around the tree's roots, and each day, he carefully monitored the delicate buds. Though outside his shelter lay only ice and snow, within, the tree not only survived but thrived. When spring finally arrived, his plum tree bloomed first, its flowers more vibrant for having been so carefully protected.",
                "lines_in_context": {
                    "6": {
                        "name": "Completion and Refinement",
                        "meaning": "As the plum tree fully blooms, its flowers stand as a testament to Master Chen's dedication and the completion of a cycle within the winter garden. This stage signifies the closing of a cycle, surrender to change, and the refinement of the tree's experience.",
                        "changing": "If a yang line replaces yin, it may indicate resistance to closure, clinging to power, or a forced extension of the tree's process beyond its natural completion."
                    },
                    "5": {
                        "name": "Leadership in Manifestation",
                        "meaning": "As spring approaches, the plum tree in Master Chen's garden emerges as a leader in blooming first, showcasing the successful manifestation of potential and full engagement with the external world. Its vibrant flowers reflect a complete execution of the vision.",
                        "changing": "If a yin line replaces yang, it could mean indecision, loss of authority, or an incomplete realization of the tree's beauty."
                    },
                    "4": {
                        "name": "Alignment with External Forces",
                        "meaning": "Master Chen prepares the plum tree for the eventual emergence into the external world, ensuring it is ready for the transition from winter to spring. This phase represents alignment with external forces and the preparation for action.",
                        "changing": "If a yang line replaces yin, it may suggest premature external assertion before the conditions are fully stable."
                    },
                    "3": {
                        "name": "Culmination of Transition",
                        "meaning": "As the winter progresses, the plum tree's buds reach a critical juncture under Master Chen's attentive care. This stage signifies the completion of the inner process and the impending transition to external action when the tree will bloom.",
                        "changing": "If a yin line replaces yang, it suggests hesitation in carrying the inner realization outward, potentially leading to stagnation at the threshold of change."
                    },
                    "2": {
                        "name": "Alignment and Structure",
                        "meaning": "Within the shelter, the heated stones and protective environment allow the delicate buds to align and strengthen. This phase represents support, alignment, and the formative structuring of the potential within the plum tree.",
                        "changing": "If a yang line replaces yin, it may indicate premature action, instability, or struggle to integrate the external conditions with the inner alignment."
                    },
                    "1": {
                        "name": "Emergence of Potential",
                        "meaning": "Master Chen begins his careful tending of the plum tree, creating a shelter to protect it from the harsh winter conditions. This marks the birth of potential and an initiating force to safeguard the delicate buds.",
                        "changing": "If a yin line replaces yang, it suggests hesitation, weakness, or a lack of readiness in tending to the tree's needs."
                    }
                }
            },
            {
                "title": "The Silent Code (Man vs. Self)",
                "theme": "Isaac Asimov",
                "summary": "Dr. Sarah Chen discovered the quantum encryption breakthrough at the worst possible moment - just as her laboratory faced a hostile takeover. Unable to trust her computers or colleagues, she developed a system to encode her findings within seemingly routine data logs. Each day, she added to her discovery while appearing to conduct failed experiments, knowing that rushing to announce her findings would lead to their theft. For six months, she wove her breakthrough into innocuous test results, visible only to those who knew where to look. When finally the takeover failed and new management restored integrity to the lab, she had not only preserved her discovery but refined it through months of careful documentation.",
                "lines_in_context": {
                    "6": {
                        "name": "Integration",
                        "meaning": "Closing a cycle and surrender to change",
                        "changing": "When a yin changes to yang, it indicates resistance to closure, clinging to power, or extending a process beyond its natural completion, necessitating a shift towards acceptance and refinement."
                    },
                    "5": {
                        "name": "Manifestation",
                        "meaning": "Full engagement in external world",
                        "changing": "When a yang changes to yin, it symbolizes a movement from leadership to indecision, signaling a loss of authority or completion falling short of full realization."
                    },
                    "4": {
                        "name": "Alignment",
                        "meaning": "Preparation for external action",
                        "changing": "When a yin changes to yang, it implies a shift from premature assertion to readiness, guiding towards a state of alignment before engaging with external forces."
                    },
                    "3": {
                        "name": "Transition",
                        "meaning": "Culmination of inner realization transitioning outward",
                        "changing": "When a yin changes to yang, it signifies movement from stagnation to action, indicating the completion of an inner process ready for manifestation."
                    },
                    "2": {
                        "name": "Formation",
                        "meaning": "Structuring potential into manifestation",
                        "changing": "When a yang changes to yin, it suggests a shift from premature action to alignment, instability to support, reflecting a need to consolidate before moving forward."
                    },
                    "1": {
                        "name": "Emergence",
                        "meaning": "Initiation of transformation within",
                        "changing": "When a yin changes to yang, it indicates a shift from hesitation to initiative, from weakness to strength, signaling the birth of potential with newfound force."
                    }
                }
            }
        ]
    },
    "history": {
        "title": "The Underground Railroad",
        "subtitle": "\"Obscured Light\" in History",
        "summary": "Between 1810 and 1850, the Underground Railroad represented one of history's most powerful examples of light persisting through darkness. Harriet Tubman, known as \"Moses\" to those she helped free, conducted 19 secret missions along this clandestine network of safe houses and hidden routes. Operating under the constant threat of capture, she and other conductors developed intricate systems of codes and signals. Quilts hung on clotheslines contained map symbols, lanterns in windows indicated safe houses, and spirituals contained hidden messages about escape routes. In total, the Underground Railroad helped an estimated 100,000 enslaved people reach freedom, all while maintaining strict secrecy. The entire operation functioned like a flame burning beneath the earth - invisible to those above but providing crucial light to those who needed to find their way to freedom.",
        "source": [
            "\"Bound for Canaan: The Underground Railroad",
            "the War for the Soul of America\" by Fergus Bordewich (2005)"
        ],
        "lines_in_history": {
            "6": {
                "name": "Reflection on Sacrifice",
                "meaning": "Contemplating the completion of a transformative journey and the sacrifices made. This line embodies the closure of a cycle, reflecting on the sacrifices and changes necessary for growth and completion. If changing to its opposite state, the reflection on sacrifice may turn into resistance or reluctance to let go, hindering the process of renewal and the transition to a new cycle of light and liberation.",
                "changing": "When this line shifts, the reflection on sacrifice and the closure of a cycle may face resistance or attachment, challenging the surrender to transformation and hindering the ability to embrace the renewal of light and liberation that follows the completion of a transformative journey."
            },
            "5": {
                "name": "Radiant Leadership",
                "meaning": "Exemplifying the full expression of guiding light and leadership. This line signifies the embodiment of radiant guidance and decisive actions, illuminating the path with clarity and authority. If transitioning to its opposite state, the radiant leadership may falter, casting shadows of doubt and uncertainty, potentially dimming the light that guides others to freedom.",
                "changing": "When this line transforms, the radiant leadership and authority in guiding others may face challenges, leading to moments of hesitation and loss of clarity, potentially dimming the beacon that lights the way for those seeking freedom from darkness."
            },
            "4": {
                "name": "Adaptation to Shadows",
                "meaning": "Embracing the challenge of manifesting light in the external world. This line represents the integration of light within the shadows, navigating the complexities of operating in secrecy and under constant threat. When changing to its opposite, the adaptation to shadows may waver, leading to exposure or vulnerability, jeopardizing the safety and efficacy of guiding others towards light in the darkness.",
                "changing": "A changing line here suggests a shift in adapting to shadows, where the balance between concealment and exposure may be disrupted, impacting the ability to operate covertly and protect both the light and those seeking it in the depths of darkness."
            },
            "3": {
                "name": "Culmination of Resilience",
                "meaning": "Reaching the pinnacle of inner strength and transition towards external action. This line symbolizes the completion of inner fortitude and the readiness to manifest light outwardly. If transitioning to its opposite state, the culmination of resilience may face obstacles, delaying the transformation of inner strength into visible actions, hindering the ability to shine brightly in the face of adversity.",
                "changing": "As this line transitions, the culmination of inner resilience may encounter hurdles, testing the ability to extend that resilience outwardly, affecting the readiness to shine light into the darkness with full strength."
            },
            "2": {
                "name": "Harmonious Alignment",
                "meaning": "Establishing connections and structures to support the emerging light. This line embodies the formation of supportive networks and strategies that enhance the spreading of light and hope. When shifting to its opposite state, the alignment may falter, leading to disruptions in the flow of support and guidance, hindering the progression towards illumination.",
                "changing": "When this line changes, the harmonious alignment of sources of support and guidance may face challenges, impacting the stability of the network and the effectiveness of conveying light in the midst of darkness."
            },
            "1": {
                "name": "Emergence of Light",
                "meaning": "The initial spark of hope and illumination emerges in the darkness. This line represents the birth of potential light, signaling a transformative force ready to shine. When transitioning to its opposite state, the emergence of light may be obscured or delayed, hindering progress and clarity in the journey from darkness to illumination.",
                "changing": "This changing line signifies a critical moment when the potential for light to break through is either embraced and amplified or obscured, challenging the path to enlightenment."
            }
        }
    },
    "trigram_phrase": {
        "Jungian": "Illumination arises where the psyche remains open, fostering the soul's vibrance under the gentle embrace of nurturing shadows.",
        "Platonic": "Within the embrace of a nurturing soul, the brilliance and clarity of the inner light are unveiled and flourish.",
        "Taoist": "Radiant clarity emerges when the receptive and nurturing embrace the flow.",
        "Tholonic": "The luminous essence unfolds through its serene union with the earth's nurturing embrace.",
        "Thermodynamics": "The entropic potential of inherent brilliance manifests itself through the gentle facilitation and thermal conduciveness of openness and receptivity."
    },
    "line_type": [
        "⚋",
        "⚋",
        "⚋",
        "⚊",
        "⚋",
        "⚊"
    ]
}