[
    {
        "hexagram": "䷂",
        "name": "Initiation",
        "description": "The challenging beginning of new growth. Like plants breaking through soil, this represents the difficult but necessary start of any significant endeavor.",
        "king_wen_sequence": 3,
        "king_wen_title": "Chun (Difficulty at the Beginning)",
        "binary_sequence": 17,
        "above": "Kan (Water, Flow, Danger)",
        "below": "Chen (Thunder, Movement, Awakening)",
        "perspective": "Dynamic movement meeting resistance",
        "nature": "Pioneering",
        "action": "Breaking through",
        "success_through": "Persistence and proper preparation",
        "image": "Thunder beneath water; A seed sprouting",
        "challenge": "Overcoming initial obstacles",
        "lines_in_transition": {
            "6": "Clear Path - Obstacles overcome; Progress with confidence",
            "5": "Measured Steps - Careful advancement; Move strategically",
            "4": "Resource Management - Support systems; Build foundations",
            "3": "Early Challenges - First hurdles; Stay committed",
            "2": "Patient Growth - Building strength; Develop capabilities",
            "1": "First Movement - Breaking ground; Begin with purpose"
        },
        "tholonic_analysis": {
            "negotiation": "The hexagram represents the negotiation between flowing resistance (Kan/Water) and awakening force (Chen/Thunder). This creates dynamic tension between movement and obstacle.",
            "limitation": "Structure is provided by water above, indicating that growth faces resistance. Thunder below suggests that energy must break through barriers.",
            "contribution": "This pattern contributes to evolution by showing how new developments emerge. It demonstrates how initiative overcomes inertia.",
            "significance_in_thologram": "In the tholonic system, this hexagram represents where consciousness initiates change. It shows how awareness creates new pathways through resistance."
        },
        "no_moving_lines": "When no lines are changing, focus on steady progress through obstacles. Success comes through persistent effort rather than force.",
        "all_moving_lines": "A complete transformation in how beginnings are approached is indicated. Old methods of starting must give way to new approaches. Ensure determination remains while embracing change."
    }
]
