[
    {
        "hexagram": "䷉",
        "name": "Potential",
        "description": "The dynamic state of unrealized power. Like a tiger observing its surroundings before acting, this represents latent energy awaiting the right moment for expression.",
        "king_wen_sequence": 10,
        "king_wen_title": "Lü (Treading)",
        "binary_sequence": 59,
        "above": "Qian (Heaven, Creative Force, Dynamic)",
        "below": "Dui (Lake, Joy, Expression)",
        "perspective": "Power held in check by awareness",
        "nature": "Contained strength",
        "action": "Mindful conduct",
        "success_through": "Disciplined restraint of power",
        "image": "Treading on a tiger's tail; Walking on thin ice",
        "challenge": "Maintaining control while possessing strength",
        "lines_in_transition": {
            "6": "Surveying Result: Looking back at the path taken; Review consequences",
            "5": "Decisive Action: Knowing when to move forward; Act with confidence",
            "4": "Careful Progress: Moving through danger; Maintain vigilance",
            "3": "Testing Limits: Exploring boundaries; Know your capacity",
            "2": "Clear Path: Understanding the way forward; Follow natural course",
            "1": "Initial Conduct: First steps require care; Begin with awareness"
        },
        "tholonic_analysis": {
            "negotiation": "The hexagram represents the negotiation between powerful force (Qian/Heaven) and joyful expression (Dui/Lake). This creates a dynamic balance between strength and restraint.",
            "limitation": "Structure is provided by heaven above, indicating that power must be guided by higher principles. The lake below suggests that expression must be contained.",
            "contribution": "This pattern contributes to evolution by demonstrating how controlled power leads to sustainable progress. It shows how awareness guides force.",
            "significance_in_thologram": "In the tholonic system, this hexagram represents the point where power meets conscious restraint. It demonstrates how awareness can guide potential into proper expression."
        },
        "no_moving_lines": "When no lines are changing, focus on maintaining disciplined conduct. Success comes through careful management of power rather than its release.",
        "all_moving_lines": "A complete transformation in how potential is handled is indicated. Old patterns of restraint must give way to new forms of control. Ensure that power remains guided while embracing change."
    }
]