[
    {
        "hexagram": "䷌",
        "name": "Coalition",
        "description": "The power of aligned forces working toward common purpose. Like light and heat uniting in flame, this represents the synergistic effect of different energies combining in harmony.",
        "king_wen_sequence": 13,
        "king_wen_title": "T'ung Jen (Fellowship)",
        "binary_sequence": 61,
        "above": "Qian (Heaven, Creative Force, Dynamic)",
        "below": "Li (Fire, Clarity, Intelligence)",
        "perspective": "Creative power guided by shared understanding",
        "nature": "Unifying",
        "action": "Building connections",
        "success_through": "Harmonizing diverse elements",
        "image": "Fire rising to heaven; People gathering for common cause",
        "challenge": "Maintaining individual integrity within collective action",
        "lines_in_transition": {
            "6": "Universal Unity: Achievement of broad-scale harmony; Expand connections mindfully",
            "5": "Leadership Through Unity: Guiding through shared vision; Foster collective strength",
            "4": "Strategic Alliance: Building effective partnerships; Choose associations wisely",
            "3": "Tested Partnership: Overcoming challenges together; Stay true to shared values",
            "2": "Mutual Understanding: Developing trust and rapport; Build authentic connections",
            "1": "Initial Connection: Beginning of fellowship; Start with clear intentions"
        },
        "tholonic_analysis": {
            "negotiation": "The hexagram represents the negotiation between creative force (Qian/Heaven) and clear understanding (Li/Fire). This creates a dynamic balance between power and purpose, like different talents uniting for greater achievement.",
            "limitation": "Structure is provided by the heaven above, indicating that coalitions must serve higher purposes. The fire below suggests that unity must be based on shared understanding and values.",
            "contribution": "This pattern contributes to evolution by demonstrating how different elements can combine for greater effect. It shows how diversity can become strength through proper alignment.",
            "significance_in_thologram": "In the tholonic system, this hexagram represents the point where individual forces consciously combine to create greater impact. It demonstrates how awareness can coordinate various elements into more powerful wholes."
        },
        "no_moving_lines": "When no lines are changing, focus on maintaining and strengthening existing alliances. Success comes through steady cultivation of relationships and shared purpose.",
        "all_moving_lines": "A complete transformation in how cooperation is achieved is indicated. Old forms of alliance must give way to new patterns of collaboration. Ensure that unity remains authentic while embracing change."
    }
]