[
    {
        "hexagram": "䷚",
        "name": "Regenerative Nourishment",
        "description": "The cultivation and provision of sustainable nourishment, both physical and spiritual. Like a mountain's nourishing springs feeding the earth below, this hexagram represents the careful stewardship of resources to sustain and regenerate systems.",
        "king_wen_sequence": 27,
        "king_wen_title": "I (Nourishment, Corners of the Mouth)",
        "binary_sequence": 33,
        "above": "Mountain (Stillness, Meditation)",
        "below": "Thunder (Movement, Initiative)",
        "perspective": "The conscious cultivation of resources that sustain and regenerate systems",
        "nature": "Nurturing and Sustaining",
        "action": "Mindful cultivation and distribution",
        "success_through": "Discerning what truly nourishes and provides sustainable value",
        "image": "Thunder beneath the mountain - energy contained and directed to nourish",
        "challenge": "Balancing immediate needs with long-term sustainability",
        "lines_in_transition": {
            "6": "Transcendent Source - The origin of nourishment - understanding true sources; Recognize ultimate origins of sustenance",
            "5": "Conscious Directio - Deviating from the ordinary path - finding better ways; Seek innovative solutions to sustainability",
            "4": "Strategic Vision - Looking upward for nourishment - seeking higher wisdom; Align with deeper principles",
            "3": "Disciplined Choic - Forsaking proper nourishment - consequences of poor choices; Make conscious decisions about resources",
            "2": "Balanced Approach - Reversing natural order - innovative solutions needed; Challenge conventional methods",
            "1": "Foundation Setting - Neglecting self-care impacts all - start with basics; Establish sustainable foundations"
        },
        "tholonic_analysis": {
            "negotiation": "The hexagram represents negotiation between stillness (Mountain) and movement (Thunder). This interaction produces sustainable systems of nourishment. The lines show progressive stages of understanding how to cultivate and distribute resources effectively.",
            "limitation": "Mountain above Thunder shows how containing and directing energy creates sustainable nourishment. Like a mountain watershed system, limitations create the channels through which resources can flow effectively. These boundaries ensure sustainable distribution.",
            "contribution": "This configuration contributes understanding of how systems can be sustainably nourished through conscious cultivation and distribution of resources. It demonstrates how awareness can create regenerative cycles that benefit the whole system.",
            "significance_in_thologram": "This hexagram occupies a position in the thologram where primal energy meets conscious containment to create sustainable systems. It represents how awareness can shape energy flows to create regenerative cycles, essential for the long-term survival and evolution of systems."
        },
        "no_moving_lines": "When no lines are moving, focus on maintaining existing nourishment systems. Pay attention to sustainability and regular maintenance of resources. Progress comes through steady, mindful cultivation rather than dramatic changes.",
        "all_moving_lines": "When all lines move, a complete transformation in how resources are cultivated and distributed is indicated. Old systems of nourishment give way to new, more sustainable approaches. Stay grounded while implementing fundamental changes."
    }
]
