[
    {
        "hexagram": "䷞",
        "name": "Resonant Attraction",
        "description": "The harmonious interplay of complementary forces creating mutual influence and transformation. Like electromagnetic fields that invisibly shape and affect each other, this hexagram represents the dynamic attraction between different but compatible energies that leads to creative unity.",
        "king_wen_sequence": 31,
        "king_wen_title": "Hsien (Influence/Wooing)",
        "binary_sequence": 28,
        "above": "Lake (Joy, Openness)",
        "below": "Mountain (Stillness, Groundedness)",
        "perspective": "The dynamic interplay between receptivity and stability that creates sustainable influence",
        "nature": "Magnetic and Harmonizing",
        "action": "Cultivating mutual influence",
        "success_through": "Understanding and working with natural affinities",
        "image": "A lake on a mountain - gentle influence from above meeting solid foundation below",
        "challenge": "Maintaining authentic connection while allowing natural development",
        "lines_in_transition": {
            "6": "Universal Harmony: Achievement of lasting resonance; Establish sustainable connections",
            "5": "Conscious Influence: Deliberate yet gentle guidance; Lead through example and invitation",
            "4": "Magnetic Alignment: Natural attraction emerges; Allow genuine connections to form",
            "3": "Dynamic Balance: Finding equilibrium in movement; Adjust to maintain harmony",
            "2": "Core Authenticity: True nature attracts naturally; Be genuine in all interactions",
            "1": "Initial Contact: First recognition of affinity; Notice natural resonances"
        },
        "tholonic_analysis": {
            "negotiation": "The hexagram represents negotiation between openness (Lake) and stability (Mountain). This interaction produces sustainable influence through natural affinity. The lines show progressive stages of developing mutual resonance.",
            "limitation": "Lake above Mountain shows how containing influence creates lasting effect. Like water finding its level, limitations guide energy into sustainable patterns. These boundaries ensure authentic connection.",
            "contribution": "This configuration contributes understanding of how systems naturally influence each other. It demonstrates how awareness can guide the development of harmonious relationships through recognition of natural affinities.",
            "significance_in_thologram": "This hexagram occupies a position in the thologram where different energies naturally align. It represents how systems develop sustainable relationships through mutual influence, essential for creating higher-order harmonies."
        },
        "no_moving_lines": "When no lines are moving, focus on maintaining current harmonious connections. Stay authentic and allow natural affinities to develop. Progress comes through steady cultivation rather than forced influence.",
        "all_moving_lines": "When all lines move, a complete transformation in relationship dynamics is indicated. Old patterns of influence give way to new forms of connection. Stay centered while navigating fundamental shifts in interaction."
    }
]