[
    {
        "hexagram": "䷦",
        "name": "Strategic Resistance",
        "description": "Represents encountering obstacles and developing strategic approaches to overcome them. Like water finding its path around a mountain, success comes through adaptability and intelligent navigation of challenges.",
        "king_wen_sequence": 39,
        "king_wen_title": "Obstruction",
        "binary_sequence": 20,
        "above": "Water (Danger, Adaptation)",
        "below": "Mountain (Stillness, Meditation)",
        "perspective": "Challenge creates opportunity for strategic growth",
        "nature": "Strategic and adaptive",
        "action": "Calculated withdrawal and preparation",
        "success_through": "Intelligent assessment and timing",
        "image": "A mountain stream finding alternate paths",
        "challenge": "Maintaining progress despite obstacles",
        "lines_in_transition": {
            "6": "The Strategic Retreat: Knowing when to step back; Conserving energy",
            "5": "The Patient Observer: Waiting for optimal conditions; Building strength",
            "4": "The Resource Gatherer: Collecting allies and tools; Preparation",
            "3": "The Persistent Explorer: Testing different approaches; Learning from setbacks",
            "2": "The Loyal Supporter: Finding strength in alliance; Mutual support",
            "1": "The Careful Planner: Assessing the situation; Foundation building"
        },
        "tholonic_analysis": {
            "negotiation": "Balance between action and restraint creates effective strategy. Like water meeting stone, resistance generates creative solutions. Shows how obstacles become opportunities through proper negotiation.",
            "limitation": "Obstacles define potential pathways and reveal hidden strengths. Limitations force innovation and efficiency. Creates structure through necessary adaptation.",
            "contribution": "Returns complexity to simplicity through strategic problem-solving. Like water wearing down stone, persistence contributes to eventual breakthrough. Demonstrates how resistance generates growth.",
            "significance_in_thologram": "Represents the dynamic between Definition (obstacle) and Contribution (solution). Shows how resistance shapes development. Essential for evolution through challenge."
        },
        "no_moving_lines": "Current obstacles require patient strategy and careful planning. Stable resistance enables methodical progress. Maintain steady approach while building resources.",
        "all_moving_lines": "Complete transformation through full strategic adaptation. All approaches shift simultaneously, revealing new pathways. Navigate change through comprehensive strategy."
    }
]