[
    {
        "hexagram": "䷧",
        "name": "Liberation From Burden",
        "description": "Represents release from difficulty and the restoration of free movement. Like a thunderstorm clearing stagnant air, it marks the moment when obstacles dissolve.",
        "king_wen_sequence": 40,
        "king_wen_title": "Deliverance",
        "binary_sequence": 10,
        "above": "Thunder (Movement, Initiative)",
        "below": "Water (Danger, Adaptation)",
        "perspective": "Freedom through release of constraints",
        "nature": "Dynamic release",
        "action": "Timely disengagement",
        "success_through": "Recognizing moment of opportunity",
        "image": "Storm waters breaking through a dam",
        "challenge": "Maintaining control during rapid change",
        "lines_in_transition": {
            "6": "The Final Release: Complete liberation; Freedom with responsibility",
            "5": "The Clear Path: Obstacles dissolve; Direction becomes clear",
            "4": "The Swift Exit: Escape from limitation; Decisive action",
            "3": "The Burden Dropped: Relief from pressure; Letting go",
            "2": "The Opening Door: Path becomes available; Seizing opportunity",
            "1": "The First Step: Initial movement; Beginning of release"
        },
        "tholonic_analysis": {
            "negotiation": "Balance between restraint and release creates optimal timing. Like water finding breakthrough point, liberation requires discernment. Shows how tension resolves through proper timing.",
            "limitation": "Freedom paradoxically requires boundaries. Release must be controlled to be constructive. Creates structure through managed liberation.",
            "contribution": "Returns restricted energy to fluid movement. Like lightning releasing atmospheric tension, liberation enables new potential. Demonstrates how release generates renewal.",
            "significance_in_thologram": "Represents transition from Definition to Contribution. Shows how limitation transforms to opportunity. Essential for evolution through release."
        },
        "no_moving_lines": "Current liberation process requires steady progression. Stable release enables controlled change. Maintain balanced approach while restrictions lift.",
        "all_moving_lines": "Complete transformation through full liberation. All constraints release simultaneously. Navigate change through comprehensive awareness."
    }
]