[
    {
        "hexagram": "䷩",
        "name": "Mindful Expansion",
        "description": "Represents beneficial increase through conscious growth. Like a well-planned garden, it emphasizes sustainable development that benefits all involved.",
        "king_wen_sequence": 42,
        "king_wen_title": "Increase",
        "binary_sequence": 49,
        "above": "Wind (Gentle Penetration)",
        "below": "Thunder (Movement, Initiative)",
        "perspective": "Growth through balanced contribution",
        "nature": "Generative expansion",
        "action": "Purposeful growth",
        "success_through": "Equitable distribution",
        "image": "Spring rain nourishing seeds",
        "challenge": "Maintaining sustainable growth",
        "lines_in_transition": {
            "6": "The Universal Benefactor: Sharing abundance; Enriching all",
            "5": "The Wise Steward: Managing growth; Balanced distribution",
            "4": "The Fair Distributor: Equitable sharing; Just allocation",
            "3": "The Growth Catalyst: Stimulating development; Enabling progress",
            "2": "The Resource Manager: Organizing assets; Efficient allocation",
            "1": "The Foundation Strengthener: Building capacity; Solid growth"
        },
        "tholonic_analysis": {
            "negotiation": "Balance between growth and sustainability creates lasting value. Like ecosystem expansion, increase requires harmony. Shows how mindful growth enables flourishing.",
            "limitation": "Strategic growth defines sustainable boundaries. Increase must be structured to be beneficial. Creates framework for healthy expansion.",
            "contribution": "Returns individual gain to collective benefit. Like nutrient cycling, increase generates shared prosperity. Demonstrates how growth serves whole system.",
            "significance_in_thologram": "Represents evolution from Definition to Contribution. Shows how increase enables emergence. Essential for development through sharing."
        },
        "no_moving_lines": "Current growth process requires steady nurturing. Stable increase enables proper development. Maintain balanced approach while expanding.",
        "all_moving_lines": "Complete transformation through comprehensive growth. All aspects develop simultaneously. Navigate change through holistic expansion."
    }
]