[
    {
        "hexagram": "䷯",
        "name": "Restoration",
        "description": "The process of renewal and replenishment after depletion. Like a well being refilled or an ecosystem recovering after disruption, this represents the natural cycle of restoration and the return of vitality.",
        "king_wen_sequence": 48,
        "king_wen_title": "Jing/The Well",
        "binary_sequence": 22,
        "above": "Kan (Water/Danger)",
        "below": "Xun (Wind/Gentle)",
        "perspective": "The renewal of resources through steady nourishment",
        "nature": "Restorative, nourishing, sustaining",
        "action": "Replenishment, maintenance, cultivation",
        "success_through": "Consistent care and attention to fundamental needs",
        "image": "Well water rising through wood - natural resources sustaining community",
        "challenge": "Maintaining reliable access to essential resources",
        "lines_in_transition": {
            "6": "Culmination: Drawing from the fullest source; Access highest wisdom",
            "5": "Integration: Clear and pure flow established; Share resources freely",
            "4": "Emergence: Well being lined with stone; Build lasting infrastructure",
            "3": "Deployment: Well is cleared but unused; Prepare for future needs",
            "2": "Definition: Well as fishing ground; Missing the true purpose",
            "1": "Inception: Mud in the well; Clear the source"
        },
        "tholonic_analysis": {
            "negotiation": "The hexagram represents the balance between giving and receiving nourishment. The gentle wind below supports the movement of water above, showing how subtle forces can maintain essential resources when properly channeled.",
            "limitation": "The structure defines boundaries between sustainable use and depletion. It establishes how resources must be maintained within natural cycles, showing that ongoing restoration requires consistent care.",
            "contribution": "This configuration contributes to systemic evolution by demonstrating how resources can be sustainably maintained. It shows how proper stewardship ensures continuing availability of essential elements.",
            "significance_in_thologram": "Represents the critical function of resource renewal in any system. Functions as a model for how awareness maintains access to vital resources. Important in understanding how systems sustain themselves through proper resource management."
        },
        "no_moving_lines": "The situation calls for steady maintenance and careful stewardship. Continue tending to essential resources while ensuring sustainable access. Success comes through consistent care.",
        "all_moving_lines": "Complete transformation of the resource system is occurring. All aspects of maintenance are in flux. The restoration will create fundamental change, requiring careful attention to maintaining reliable access to essentials."
    }
]