[
    {
        "hexagram": "䷱",
        "name": "Transformation",
        "description": "The sacred vessel that enables transformation and renewal. Like a crucible that transforms base metals or a ritual space that transforms consciousness, this represents the container or context that makes profound change possible.",
        "king_wen_sequence": 50,
        "king_wen_title": "Ding/The Cauldron",
        "binary_sequence": 46,
        "above": "Li (Fire/Clarity)",
        "below": "Xun (Wind/Gentle)",
        "perspective": "The structured space within which transformation occurs",
        "nature": "Alchemical, transformative, sacred",
        "action": "Creating conditions for change",
        "success_through": "Proper preparation and respect for process",
        "image": "Fire fed by wind beneath vessel - controlled transformation",
        "challenge": "Maintaining the integrity of the transformative space",
        "lines_in_transition": {
            "6": "Culmination: Vessel reaches highest refinement; Honor the achievement",
            "5": "Integration: Vessel properly aligned; Perfect conditions manifest",
            "4": "Emergence: Vessel requires repair; Address structural issues",
            "3": "Deployment: Vessel's contents spoiled; Clear blockages",
            "2": "Definition: Vessel fills steadily; Trust the process",
            "1": "Inception: Vessel overturned; Clear past residue"
        },
        "tholonic_analysis": {
            "negotiation": "The hexagram represents the balance between container and contained. The gentle wind below feeds the fire above, showing how supportive conditions enable transformation.",
            "limitation": "The structure defines boundaries necessary for safe transformation. It establishes how change must occur within protected space, showing that transformation requires proper containment.",
            "contribution": "This configuration contributes to systemic evolution by demonstrating how structured environments enable transformation. It shows how proper vessels facilitate sustainable change.",
            "significance_in_thologram": "Represents the critical role of containment in transformation. Functions as a model for how awareness creates spaces for change. Important in understanding how systems provide context for evolution."
        },
        "no_moving_lines": "The situation calls for maintaining proper conditions. Continue supporting the transformative process while preserving boundaries. Success comes through patient holding of space.",
        "all_moving_lines": "Complete transformation of the vessel is occurring. All aspects of containment are in flux. The transformation will create fundamental change, requiring careful attention to maintaining structural integrity."
    }
]