[
    {
        "hexagram": "ไทน",
        "name": "Resonance",
        "description": "The joyful exchange of energy and ideas between compatible elements. Like harmonious music or synchronized oscillators, this represents the natural alignment of complementary forces and the pleasure of mutual enhancement.",
        "king_wen_sequence": 58,
        "king_wen_title": "Dui/The Joyous, Lake",
        "binary_sequence": 27,
        "above": "Dui (Lake/Joy)",
        "below": "Dui (Lake/Joy)",
        "perspective": "The self-reinforcing power of harmonious interaction",
        "nature": "Harmonious, receptive, interactive",
        "action": "Sharing joy, creating harmony",
        "success_through": "Open exchange and mutual appreciation",
        "image": "Lake over lake - joy doubled and reflected",
        "challenge": "Maintaining depth while sharing openly",
        "lines_in_transition": {
            "6": "Joy becomes complete; Share wisdom",
            "5": "Trust brings truth; Be authentic",
            "4": "Discussion leads to clarity; Communicate openly",
            "3": "False joy fades; Seek genuine connection",
            "2": "Inner joy radiates; Express sincerely",
            "1": "Harmony begins; Start with openness"
        },
        "tholonic_analysis": {
            "negotiation": "The hexagram represents the balance between giving and receiving. The doubled lake shows how joy multiplies through sharing, demonstrating that mutual exchange creates abundance.",
            "limitation": "The structure defines boundaries between genuine and superficial connection. It establishes how sharing must maintain authenticity, showing that true resonance requires honesty.",
            "contribution": "This configuration contributes to systemic evolution by demonstrating how harmonious interaction enhances all participants. It shows how aligned energies create greater effects than isolated ones.",
            "significance_in_thologram": "Represents the critical role of harmonious interaction in evolution. Functions as a model for how awareness grows through exchange. Important in understanding how systems benefit from synchronized cooperation."
        },
        "no_moving_lines": "The situation calls for maintaining joyful exchange. Continue sharing openly while preserving authenticity. Success comes through genuine interaction.",
        "all_moving_lines": "Complete transformation through resonance is occurring. All aspects of connection are active. The harmony will create fundamental change, requiring careful attention to maintaining authentic exchange."
    }
]