{
    "hx": {
        "core": {
            "hexagram": "䷣",
            "name": "Obscured Light",
            "description": "Intelligence and clarity operating under constraints. Like the sun below the earth, this represents inner radiance maintaining its strength despite external darkness.",
            "king_wen_sequence": 36,
            "king_wen_title": "Ming I (Darkening of the Light)",
            "binary_sequence": 5,
            "above": "KUN - Earth, Receptivity, Support",
            "below": "LI - Fire, Clarity, Intelligence",
            "perspective": "Wisdom persisting through adversity",
            "nature": "Hidden strength",
            "action": "Preservation",
            "success_through": "Internal cultivation",
            "image": "Fire beneath the earth, maintaining brightness while concealed",
            "challenge": "Sustaining clarity amid darkness",
            "lines_in_transition": {
                "6": "Breaking Free: Light finally emerges from darkness; Maintain wisdom gained in shadow",
                "5": "Inner Radiance: Wisdom shines despite external darkness; Let truth guide through confusion",
                "4": "Protected Light: Preservation through careful concealment; Guard your resources",
                "3": "Sudden Darkness: Unexpected challenges to clarity; Adapt to changing conditions",
                "2": "Sustained Brightness: Maintaining inner light; Nurture internal wisdom",
                "1": "Initial Dimming: Recognition of approaching darkness; Prepare for challenges"
            },
            "tholonic_analysis": {
                "negotiation": "Balance between expression and preservation. The hexagram shows how wisdom can thrive even when constrained. Represents negotiation between visibility and protection.",
                "limitation": "Creates protection through concealment. The earth above contains and protects the fire below, showing how limitation can preserve rather than extinguish.",
                "contribution": "Contributes by demonstrating how awareness can persist and develop under adverse conditions. Like a seed growing underground, this constraint enables future emergence.",
                "significance_in_thologram": "Represents crucial phases where development must occur hidden from view. Shows how temporary constraint can strengthen rather than weaken a system."
            },
            "no_moving_lines": "A period where wisdom must be cultivated internally. Accept this time of restricted expression as necessary for development. Focus on inner growth.",
            "all_moving_lines": "Complete transformation from concealment to expression approaching. The period of constraint has served its purpose. Prepare for emergence while maintaining gained wisdom."
        },
        "stories": {
            "title": "Three Tales of \"Obscured Light\"",
            "stories": [
                {
                    "title": "The Hidden Scholar (Man vs. Man)",
                    "style": "The Brothers Grimm",
                    "description": "In a kingdom where learning had been forbidden, lived a wise woman who taught children in secret. By day, she worked as a humble washerwoman, but at night, her cellar became a sanctuary of knowledge. She taught reading by candlelight, drawing letters in ash, and whispered mathematics like fairy tales. When soldiers searched the village, they found only drying linens and soap bubbles, never suspecting that beneath their feet, future scholars were taking root. Years passed until finally, when the cruel king fell, her students emerged as learned leaders who rebuilt the kingdom with wisdom preserved through darkness.",
                    "key_elements": {
                        "6": "Liberation - The eventual freedom to teach openly",
                        "5": "Hidden Wisdom - Maintaining knowledge despite oppression",
                        "4": "Clever Concealment - Using her washerwoman role as cover",
                        "3": "Close Calls - Managing surprise inspections",
                        "2": "Underground Teaching - Maintaining educational standards in secret",
                        "1": "Recognition - Understanding the need for secrecy"
                    }
                },
                {
                    "title": "The Winter Garden (Man vs. Nature)",
                    "style": "Murasaki Shikibu",
                    "description": "Deep within the Imperial gardens, Master Chen tended a precious plum tree through the harshest winter ever recorded. While other gardeners abandoned their posts, he built an intricate shelter of bamboo and oil paper, creating a small pocket of warmth within the frozen landscape. Each night, he placed heated stones around the tree's roots, and each day, he carefully monitored the delicate buds. Though outside his shelter lay only ice and snow, within, the tree not only survived but thrived. When spring finally arrived, his plum tree bloomed first, its flowers more vibrant for having been so carefully protected.",
                    "key_elements": {
                        "6": "Spring's Arrival - The triumphant blooming",
                        "5": "Protected Growth - Maintaining life despite harsh conditions",
                        "4": "Careful Tending - Daily preservation efforts",
                        "3": "Weather Challenges - Adapting to worsening conditions",
                        "2": "Inner Warmth - Creating a nurturing environment",
                        "1": "Winter's Approach - Preparing for hardship"
                    }
                },
                {
                    "title": "The Silent Code (Man vs. Self)",
                    "style": "Isaac Asimov",
                    "description": "Dr. Sarah Chen discovered the quantum encryption breakthrough at the worst possible moment - just as her laboratory faced a hostile takeover. Unable to trust her computers or colleagues, she developed a system to encode her findings within seemingly routine data logs. Each day, she added to her discovery while appearing to conduct failed experiments, knowing that rushing to announce her findings would lead to their theft. For six months, she wove her breakthrough into innocuous test results, visible only to those who knew where to look. When finally the takeover failed and new management restored integrity to the lab, she had not only preserved her discovery but refined it through months of careful documentation.",
                    "key_elements": {
                        "6": "Vindication - The successful revelation of her work",
                        "5": "Hidden Progress - Continuing research despite constraints",
                        "4": "Data Protection - Cleverly concealing discoveries",
                        "3": "Security Threats - Managing unexpected dangers",
                        "2": "Encoded Work - Maintaining research in secret",
                        "1": "Threat Assessment - Recognizing the need for concealment"
                    }
                }
            ]
        },
        "history": {
            "title": "The Underground Railroad",
            "subtitle": "\"Obscured Light\" in History",
            "description": "Between 1810 and 1850, the Underground Railroad represented one of history's most powerful examples of light persisting through darkness. Harriet Tubman, known as \"Moses\" to those she helped free, conducted 19 secret missions along this clandestine network of safe houses and hidden routes. Operating under the constant threat of capture, she and other conductors developed intricate systems of codes and signals. Quilts hung on clotheslines contained map symbols, lanterns in windows indicated safe houses, and spirituals contained hidden messages about escape routes. In total, the Underground Railroad helped an estimated 100,000 enslaved people reach freedom, all while maintaining strict secrecy. The entire operation functioned like a flame burning beneath the earth - invisible to those above but providing crucial light to those who needed to find their way to freedom.",
            "source": "\"Bound for Canaan: The Underground Railroad and the War for the Soul of America\" by Fergus Bordewich (2005)",
            "key_elements": {
                "6": "The eventual success in reaching free states and Canada",
                "5": "The inner strength that sustained both conductors and passengers",
                "4": "The elaborate coding systems that protected the network",
                "3": "Managing sudden threats and betrayals",
                "2": "Maintaining hope and determination during dangerous journeys",
                "1": "The initial recognition of escape routes and possibilities"
            }
        }
    }
}